{"title":"Auslogics Disk Defrag 3.1.3.100","uid":5431121,"size":2321016,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:003f01c7c25799fc3b55854006abdbe13c9fc830&amp;dn=Auslogics+Disk+Defrag+3.1.3.100&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1268417287,"description":"Copied from Auslogics Homepage:\n\n\nDisk Defrag - Intelligent Defragmenter\n\nAuslogics Disk Defrag is a compact and fast defragmenter that supports both FAT 16/32, and NTFS file systems. It is supplied with advanced optimization techniques, which will remedy your system sluggishness and crashes caused by files fragmentation.\n\n\nOptimizes file system\n\nThis tool will speed up your computer and make it run more smoothly by moving system files to the faster part of the disk and clearing the MFT Reserved Zone from regular data files.\n\n\nConsolidates free space\n\nDisk Defrag doesn't only defragment files - it prevents further files fragmentation by merging free space on the disk into a large contiguous block.\n\n\nCan defrag automatically\n\nYou can set the program to run automatically when your system goes idle.\nIt will analyze the disks and defragment them in the background if required.\nWith this feature your files fragmentation will be eliminated as soon as it occurs.\n\n\nProvides flexible scheduler\n\nDefragmentation yields better results when implemented on a regular basis.\nUsing flexible scheduler you can set the most suitable time span for defragmenting your hard drives.\n\n\nCan defrag a single file or folder\n\nHave no time for defragmenting an entire hard drive?\nWith Disk Defrag you can defragment a single file, several files or a folder.\n\n\nSupports multi-terabyte volumes\n\nDisk Defrag is supplied with a powerful engine, which can easily defragment large disk volumes of several terabytes, as well as several drives simultaneously.\n\n\nCompact &amp; Fast\n\nSmart defragmentation algorithms allow Disk Defrag to run much faster than similar defragmenters and consume less system resources.\n\n\nAdvanced Defragmentation Features by Auslogics\n\nDefragment &amp; Optimize\n\nDisk Defrag allows not only to defragment, but to optimize your hard drives for maximum performance. It can consolidate free space, move system files to the faster part of the disk and clear the MFT Reserved Zone from regular data files. These optimization techniques will speed up your system and make it more stable. And with all the advanced optimization techniques it has, Disk Defrag is extremely compact and easy to use!\n\n\nFree space consolidation\n\nSimple defragmentation of data files leaves fragmented free space.\nThis means that there are many free space &quot;holes&quot; all over the disk.\nWindows fills those &quot;holes&quot; with newly created or extended files.\nThe more fragmented the free space is, the more fragmented new files will be.\nDisk Defrag merges free space into a large contiguous block during optimization process. This technology effectively prevents further files fragmentation and speeds up disk access.\n\n\nSystem files smart placement\n\nSystem files are necessary for the operating system to perform its numerous functions. Commonly used by Windows, system files may be scattered all over the disk and intermixed with regular data files. Disk Defrag defragments them and moves them to the faster part of the disk. Such intelligent way of defragmentation minimizes the time needed for HDD to access system files and thus improves overall computer performance.\n\n\nKeeping the MFT Reserved Zone Clear\n\nNormally, NTFS file system reserves about 12,5% of the disk space for the MFT records. However, when the rest of the disk space is getting low, the MFT Reserved Zone will be used for storing regular files.\nThis may lead to MFT fragmentation. Disk Defrag moves regular data files from the MFT Reserved Zone into the rest of the disk space, allowing NTFS to allocate contiguous space for the MFT records and thus to prevent its fragmentation.\n\n\nSingle file or folder defragmentation\n\nSometimes it makes more sense to defragment frequently used files only, instead of defragmenting an entire drive. Disk Defrag can save your time by defragmenting only files that you want. It allows you to defragment a single file, several files or an entire folder. This option would be useful if you want to speed up application performance immediately and have no time for defragmentation of the entire hard drive.\n\n\nList of fragmented files\n\nDisk Defrag lists all fragmented files after performing disk analysis.\nSelecting any file from the list will highlight its clusters' location on the fragmentation map. You can find the most fragmented files and their paths by sorting the list. The list also lets you chose which files to defragment and files you want to add to the ignore list. All you need to do is right-click on any file directly in the list and select the operation you want to perform.\n\n\nAuto-defragmentation mode\n\nWith its auto-defragmentation feature, Disk Defrag acts in real time, while your system is idle. Since the program is very compact and requires few system resources, it can easily defragment your hard drives in the background and you will not even notice its activity. Use a handy icon (in the bottom-left corner) to easily customize and control auto-defrag mode. Just set Disk Defrag to run automatically and you'll forget about files fragmentation shortly.\n\n\nScheduled defragmentation\n\nRunning Disk Defrag at least once a weak assures your hard drives are optimized for maximum performance. The program's scheduler will help you to maintain your hard drives on a regular basis. Use a wide range of its options to set the most suitable time span for disks defragmentation. It can be run daily, weekly or monthly, at any time you want. In addition, you can set Disk Defrag to save reports after each defragmentation to control its activity.\n\n\nCustomizing Disk Defrag\n\nUse many handy settings to customize your Disk Defrag.\nIt can be integrated into the Windows Explorer context menu and minimized to system tray on close. The last option you'll find especially convenient when using the auto-defragmentation mode. You can also set the program to automatically shut down your computer after defragmentation is done.\nAnd with its several fragmentation map colour themes you can change the way your Disk Defrag looks.\n\n\nMultiple Languages\n\nWe are very grateful to our users who have helped us to translate Disk Defrag into their native languages! Thanks to them, the program is available in English, German, Spanish, French, Hungarian, Italian, Japanese, Korean, Polish, Portuguese and Russian.\n\n\nSystem Requirements\n\nWindows 7 / Vista / 2008 / XP (32-bit &amp; 64-bit)\n50 MB available hard disk space\n32 MB RAM\n\n\nChangelog:\n\n\n3.1.3.100 (03/10/2010)\n\n- Faster optimization algorithm\n- Improved Move System Files option\n- Fixed bugs that caused random program shut downs\n- Improved Windows Classic theme support\n- Improved Installer\n\n\n3.1.2.90 (12/11/2009)\n\n- Added new languages\n- Improved program appearance\n- Fixed bugs\n- Improved installer\n\n\n3.1.1.80 (12/02/2009)\n\n- Added an option to exclude SSD disks from the defragmentation process\n- Added an option to check disks for errors\n- Corrected mistakes in language files\n- Improved file lists functionality\n- Fixed bugs\n\n\n3.1.0.65 (11/12/2009)\n\n- Improved processing of files blocked by the system (e.g. system restore points)\n- Added new colour to the map = unmovable files\n- Fixed a compaction algorithm bug that moved files into the MFT zone when there wasn't enough disk space\n- Tuned up colour theme colours - now they match better\n- Improved tray program operation\n- Simplified program interface\n- Improved program installer, fixed a bug that caused incorrect installation of a new version over an older version\n- Corrected mistakes in language files\n\n\n3.0.3.50 (11/05/2009)\n\n- Added new languages: German, French, Portuguese, Polish, Italian, Japanese, Korean\n- Added an option to disable simultaneous checking of all the disks at once to reduce system recourses usage\n- Significantly improved interaction with the Windows Task Scheduler\n- Defragmentation algorithm improved for faster defragmentation of highly fragmented disks with low free space available\n- Improved MFT handling on NTFS drives\n- Fixed memory leaks and exceptions\n- Fixed errors in language files\n\n\n3.0.2.40 (10/20/2009)\n\n- Added a disk optimization mode which allows to consolidate free space by placing all files on the disk contiguously\n- Added an ability of defragmenting all drives at once\n- Added a capability of viewing the list of all the fragmented files and their clusters location on the disk\n- Added a capability to move system files to the faster part of the disk; this significantly speeds up system boot and makes it running more stable\n- Significantly improved automatic defragmentation mode\n- Defragmentation speed increased by approximately 30-50%\n- Added disk optimization commands to the console version of the program\n- Added an option of minimizing the program into system tray\n- Disk Defrag can now be set to start automatically on Windows logon\n- Improved exceptions list function. Fixed a bug that led to defragmentation slowdowns caused by a great number of files in the list\n- Added a &quot;Real Time Priority&quot; mode that boosts defragmentation speed by using additional system resources\n- Various minor improvements and optimizations\n\n\n2.1.2.50 (09/04/2009)\n\n- Added new languages\n- Fixed bugs\n- Improved installers\n\n\n2.1.2.40 (08/04/2009)\n\nThis service pack fixes issues found in version 2.1 and improves program stability.\n\n- Fixed a Disk Defrag bug causing it to hang on start up on some computers\n- Fixed a Disk Defrag bug causing an error on program shutdown\n- Added new languages\n\n\n2.1.1.30 (07/27/2009)\n\n- Added background autodefragmentation\n- Added an option to minimize the program into system tray\n- Added Windows Explorer integration\n- Added numerous new options and possibilities\n- Corrected mistakes in the localization files\n- Improved installers\n\n\n2.0.0.15 (06/20/2009)\n\n- Added new interface languages: German, Dutch, Japanese\n- Added an option to change disk map color\n- Added new themes\n- The portable version is now available on the website\n- Added an option to include only problem files in the report\n- Added a new option to the console version of the program\n- Added a real-time file defragmentation counter\n- Added a total defragmentation progress\n- Improved functionality with the computer reboot option\n- Improved splitter functionality in the main program window\n- Added skipped files information to the report window\n- Fast disk analysis now takes into account user exceptions list\n- Added MFT errors disk checkup\n- Improved MFT table read, fixed a number of bugs that led to defragmentation interruption\n- Improved very large disks defragmentation (from 1 TB)\n- Optimized memory usage, now the program uses even less RAM\n- Some minor improvements that make using the program even easier\n- Fixed localization module bug. Now the program supports all interface languages\n- Fixed errors in localization files\n\n\nVersion 2.0 beta (06/02/2009)\n\n- Added the capability to defragment all drives at once\n- Added the capability to analyze any disk\n- Added full Unicode encoding support\n- Defragmentation speed improved by 30%\n- Added animated legend\n- Added the option to shut down computer after defragmentation\n- Added full 64 bit Windows 7 support\n- Added full screen option\n- Added exceptions list, that allows to skip all kinds of folders\n- Added capability to skip files with large fragments\n- Improved report, added status descriptions\n- Added more console version commands\n- Improved scheduler, added new start time setup options\n- Improved defragmentation chart and report look\n- Improved defragmentation chart behaviour, now it shows file locations more correctly\n- Improved latest Windows 7 versions support\n- CPU usage during defragmentation decreased by 5% (normal CPU load)\n- Improved external drives, USB devices, and SSD support\n- Now defragmentation progress works correctly\n- Fixed minor defragmentation algorithm bugs\n\n\nED2K Link:\ned2k://|file|disk-defrag-setup.exe|2321016|B42F87D75FF5ACBFCC6FA8FDFA591961|h=2P2A456LD5AV3TFPUJRAYZZ6GGHPV3H5|/\n\n\nComments from the uploader (olofolleola4):\nHere is some links if you cannot download it through this torrent:\nupload box  .  com  /  files  /  5ec03078bd\nrapid share  .  com  /  files  /  362461144  /  disk-defrag-setup.exe","torrent":{"xt":"urn:btih:003f01c7c25799fc3b55854006abdbe13c9fc830","amp;dn":"Auslogics+Disk+Defrag+3.1.3.100","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"003f01c7c25799fc3b55854006abdbe13c9fc830","infoHashBuffer":{"type":"Buffer","data":[0,63,1,199,194,87,153,252,59,85,133,64,6,171,219,225,60,159,200,48]},"announce":[],"urlList":[]}}