{"title":"Richard J. Evans - The Coming of the Third Reich","uid":6497880,"size":4213699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00bdc5b0a5257e2b073843226c2ab7810459edc2&amp;dn=Richard+J.+Evans+-+The+Coming+of+the+Third+Reich&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FatFreddy39","files":1,"time":1309140476,"description":"All books are in .mobi format\n\nIf you don't have a program that can convert or view .mobi you can download the free program calibre\n &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n\nPleese seed. \n\nBook List:\n\nThe Coming of the Third Reich\n\n\nOn March 30, 1933, two months after Hitler achieved power, Paul Nikolaus, a Berlin cabaret comedian, wrote disconsolately, &quot;For once, no joke. I am taking my own life.... [U]nfortunately I have fallen in love with my Fatherland. I cannot live in these times.&quot; How Germans could remain in love with their fatherland under Nazism and even contribute willingly to its horrific extremism is the subject of Cambridge historian Evans's gripping if overwhelmingly detailed study, the first of three projected volumes. Readers watch a great and historic culture grow grotesquely warped from within, until, in 1933, a dictatorial state was imposed upon the ruins of the Weimar republic. A host of shrill demagogues had, in the preceding decades, become missionaries to an uneasy coalition of the discontented, eager to subvert Germany's democratic institutions. This account contrasts with oversimplified diagnoses of how Nazism succeeded in taking possession of the German psyche. Evans asserts that Hitler's manipulative charisma required massive dissatisfaction and resentment available to be exploited. Nazism found convenient scapegoats in historic anti-Semitism, the shame of an imposed peace after WWI and the weakness of an unstable government alien to the disciplined German past. Although there have been significant recent studies of Hitler and his regime, like Ian Kershaw's brilliant two volumes, Evans (In Hitler's Shadow, etc.) broadens the historic perspective to demythologize how morbidly fertile the years before WWI were as an incubator for Hitler","torrent":{"xt":"urn:btih:00bdc5b0a5257e2b073843226c2ab7810459edc2","amp;dn":"Richard+J.+Evans+-+The+Coming+of+the+Third+Reich","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00bdc5b0a5257e2b073843226c2ab7810459edc2","infoHashBuffer":{"type":"Buffer","data":[0,189,197,176,165,37,126,43,7,56,67,34,108,42,183,129,4,89,237,194]},"announce":[],"urlList":[]}}