{"title":"Liane Moriarty - Stora små lögner - Svensk","uid":14871123,"size":467055432,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:01019a432305905af7ade3c75f683410c7f7e073&amp;dn=Liane+Moriarty+-+Stora+sm%26aring%3B+l%26ouml%3Bgner+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"totomas1","files":196,"time":1465573913,"description":"Liane Moriarty – Stora små lögner\r\n\r\nVid en första anblick framstår den prydliga villaförorten Pirriwee som en välmående och sömnig idyll.\r\nMen under ytan kokar det.\r\n\r\nMadeline och Celeste är grannar och bästa vänner. De har barn i samma förskoleklass och tar alla tillfällen de får att prata om livet på favoritcaféet. Madeline har händerna fulla med sin tonårsdotter, som plötsligt tycks föredra sin pappa och yogafrälsta styvmamma framför henne (hur är det möjligt??).\r\nMen hon kan inte låta bli att samtidigt kasta sig in i intrigerandet mellan olika fraktioner av föräldrar på skolan. Förortens okrönta skönhetsdrottning Celeste backar förstås upp Madeline, men har verkat mer virrig än vanligt på sistone - kanske inte så konstigt med två helvilda tvillingpojkar där hemma och en man som ständigt är på resande fot. Eller finns det något som Celeste inte berättar?\r\n\r\nNär den unga ensamma mamman Jane flyttar in i området möts hon av kyliga blickar från de andra förskolemammorna och blir misstagen för att vara femårige Ziggys barnflicka. Madeline och Celeste tar dock Jane under sina vingar, och står på hennes sida när stämningen blir allt mer hätsk efter att Ziggy blivit anklagad för mobbning.\r\nTemperaturen på skolgårdar och villagator skruvas upp för att nå sin våldsamma kulmen under skolans årliga föräldrakväll...\r\n\r\nStora små lögner är en roman om vänner, mammor, döttrar, nya fruar och före detta män - full av igenkänning, värme och humor. Men det är också en roman som inte väjer för det mörka i livet, för gråzonerna vi accepterar och de farliga lögnerna vi intalar oss själva.\r\n\r\n\r\nAntal CD: 13 CD\r\nUppläsare: Kerstin Andersson\r\nSpeltid: 16 timmar, 11 minuter","torrent":{"xt":"urn:btih:01019a432305905af7ade3c75f683410c7f7e073","amp;dn":"Liane+Moriarty+-+Stora+sm%26aring%3B+l%26ouml%3Bgner+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01019a432305905af7ade3c75f683410c7f7e073","infoHashBuffer":{"type":"Buffer","data":[1,1,154,67,35,5,144,90,247,173,227,199,95,104,52,16,199,247,224,115]},"announce":[],"urlList":[]}}