{"title":"Paul Simon - You Can Call Me Al","uid":4423764,"size":161454084,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:026bc8e0c29290b6c172f46f56d548ba800bf4d2&amp;dn=Paul+Simon+-+You+Can+Call+Me+Al&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"2nafish","files":1,"time":1222918370,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video is the &quot;Chevy Chase Version.&quot;\n\n\n\n&quot;You Can Call Me Al&quot; is a song by Paul Simon, the first single released from his album Graceland. The song originally charted in the U.S. at #44 in October, 1986 but it was reissued with greater promotion in March, 1987 and hit #23. In the UK it peaked at #4.\n\nThe lyrics describe a man experiencing an identity crisis (&quot;Where&amp;#039;s my wife and family? What if I die here? Who&amp;#039;ll be my role model?&quot;) which is ultimately resolved when he takes a trip to &quot;the Third World&quot;.\n\nPaul Simon is reported to have not liked the original music video that was made, which was a performance of the song Simon gave during the monologue when he hosted Saturday Night Live. When he was appearing on Saturday Night Live, a replacement video was conceived and recorded, wherein Chevy Chase lip-synced all of Simon&amp;#039;s vocals in an upbeat presentation, with gestures punctuating the lyrics. Simon wore a bored expression throughout the piece, while also lugging instruments into view (such as conga drums) to sync them with the audio track at the appropriate moments. The only time he opened his mouth was to provide the lower-pitched harmony on the phrases &quot;If you&amp;#039;ll be my bodyguard&quot; and &quot;I can call you Betty&quot;. During the fade-out instrumental, Chase and Simon performed a rhythmic dance step in sync, Chase, being about 6&amp;#039;4&quot;, towering over the much shorter Simon (5&amp;#039;2&quot;).\n\nThe song features an unusual bass solo from Bakithi Kumalo in which the second half is a reversed recording of the first half. The bass solo was recorded on Kumalo&amp;#039;s birthday.\n\nThe names in the song came from an incident at a party that Simon went to with his wife Peggy Harper. The host of the party called Paul &quot;Al&quot;, and Peggy &quot;Betty&quot;, inspiring Simon to write a song.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:026bc8e0c29290b6c172f46f56d548ba800bf4d2","amp;dn":"Paul+Simon+-+You+Can+Call+Me+Al","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"026bc8e0c29290b6c172f46f56d548ba800bf4d2","infoHashBuffer":{"type":"Buffer","data":[2,107,200,224,194,146,144,182,193,114,244,111,86,213,72,186,128,11,244,210]},"announce":[],"urlList":[]}}