{"title":"Air Pollution and Greenhouse Gases","uid":12743507,"size":10000973,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04834d8700188e44020f827c55bfd33f9ed0a4db&amp;dn=Air+Pollution+and+Greenhouse+Gases&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":1,"time":1447274641,"description":"Air Pollution and Greenhouse Gases - From Basic Concepts to Engineering Applications for Air Emission Control (Springer, 2014).pdf\r\n\r\nISBN 9789812872111\r\n\r\nThis textbook discusses engineering principles relating to air pollution and greenhouse gases (GHGs); it focuses on engineering principles and designs of related devices and equipment for air emission control for a variety of industries such as energy, chemical, and transportation industries. The book aims primarily at senior undergraduate and graduate students in mechanical, chemical and/or environmental engineering departments; it can also be used as a reference book by technical staff and design engineers who are interested in and need to have technical knowledge in air pollution and GHGs. The book is motivated by recent rapid advances in air pollution and greenhouse gas emissions and their control technologies. In addition to classic topics related to air pollution, this book is also featured with emerging topics related to air pollution and GHGs. It covers recent advances in engineering approaches to the reduction of GHG emissions including, but are not limited to, green energy technologies and carbon sequestration and storage. It also introduces an emerging topic in air pollution, which is referred to as Nano Air Pollution. It is a growing concern in air pollution, but largely missing in similar books, likely because of recent rapid advances in nanotechnology has outpaced the advances in nano air pollution control","torrent":{"xt":"urn:btih:04834d8700188e44020f827c55bfd33f9ed0a4db","amp;dn":"Air+Pollution+and+Greenhouse+Gases","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04834d8700188e44020f827c55bfd33f9ed0a4db","infoHashBuffer":{"type":"Buffer","data":[4,131,77,135,0,24,142,68,2,15,130,124,85,191,211,63,158,208,164,219]},"announce":[],"urlList":[]}}