{"title":"Call Of Duty 1 - Special PacSteam Forum Release 18-01-2007","uid":3982420,"size":445033768,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:05488f6179a01b0ae3db9dd8b292de89a64c2278&amp;dn=Call+Of+Duty+1+-+Special+PacSteam+Forum+Release+18-01-2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"real-pacman","files":1,"time":1200618994,"description":"--- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- \n\nCall Of Duty 1 - Special PacSteam Forum Release 18-01-2007 \n\nPaCmAnÂ´s NOTE: Last time I just managed to use about 1 week uploading more than 10 GB with extracted versions of games that is now on steam. The whole FTP server was deleted about 2-3 days later. This time I am going to try putting them out on torrents just like the new Quake 1 2008 version, because that seems to be working VERY well- As long as people keep sharing the games. Anyway: Consider this COD1 repack as a &quot;share test&quot;, and if everything goes well, I might also begin to upload the bigger game repacks I did such as COD 2 - Flatout 1 - Flatout 2 etc. etc. PLEASE support this project by downloading and sharing the files, otherwise it will shut down again before it begins. My major problem so far have been harddisk space to use for sharing, but I just got a new HD that will give me about 120 GB of space to use for this project when installed. Thats it from me about this subject, because now its all up to YOU out there to deside if this PaCmAn repack torrent project is going to be a success or not. \n\n--- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- \n\n\nCall Of Duty 1 \nWith PaCmAn Installer - Download and burn to disk \n\nTopic updated: 18-01-2007 \nUpdated by: PaCmAn \n\n\nPaCmAn Pack with installer \nType: FULL Game Rip from &quot;the one eyed&quot; \nSize: 424 MB - exe \n\n\n^^ GOOD, FULL RIP VERSION - NO CD KEY NEEDED, JUST UNPACK AND PLAY ^^ \n\n\nDescription: \n\n\n There is no shortage of World War II-themed first-person shooters available, and it&amp;#039;s no secret that a number of them, including Medal of Honor: Allied Assault and Battlefield 1942, are extremely good. Now you can add Call of Duty to that list. The first game by Infinity Ward, a studio composed of some of the same team that worked on Allied Assault, Call of Duty presents outstanding action all around and is at least as good as, and in several ways is simply better than, any similar game. Though both its single-player and multiplayer modes will be familiar to those who&amp;#039;ve been keeping up with the WWII-themed shooters of the past several years, most anyone who plays games would more than likely be very impressed with Call of Duty&amp;#039;s authentic presentation, well designed and often very intense single-player missions, and fast-paced, entertaining multiplayer \nMore information http://au.gamespot.com/pc/action/callofduty/review.html \n\n\n\n\n---","torrent":{"xt":"urn:btih:05488f6179a01b0ae3db9dd8b292de89a64c2278","amp;dn":"Call+Of+Duty+1+-+Special+PacSteam+Forum+Release+18-01-2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05488f6179a01b0ae3db9dd8b292de89a64c2278","infoHashBuffer":{"type":"Buffer","data":[5,72,143,97,121,160,27,10,227,219,157,216,178,146,222,137,166,76,34,120]},"announce":[],"urlList":[]}}