{"title":"Kingdom Of Heaven - Greek Subtitles (Optional) - By Omifast","uid":4397907,"size":719843844,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:05af007600460ec7502614ce44d6f5a85b5ffd7d&amp;dn=Kingdom+Of+Heaven+-+Greek+Subtitles+%28Optional%29+-+By+Omifast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OmifastGR","files":3,"time":1221524822,"description":"Kingdom of Heaven (2005) - Starring:  Orlando Bloom, Eva Green, Jeremy Irons.\n\nThis is a Hight Quality Nero Digital Movie!\n\nThis Movie Recode it from the Original DVD.\n\nSpoken Languages: English.\n\nSubtitles: Greek.\n\nIt Can Play in Any Media Player.\n.\n================================================\nBut If You Want To Change Language Or Subtitles,\nYou Must Have Nero ShowTime Player.\n================================================\n.\nYou can find Nero ShowTime player: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4382965/NeroVision_Express_2___Serial___Update_-_Virus_Free&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4382965/NeroVision_Express_2___Serial___Update_-_Virus_Free&lt;/a&gt;\n\nDVD Cover &lt;a href=&quot;\nhttp://www.orlandocentral.net/pics/film/kingdom/kohposter01.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orlandocentral.net/pics/film/kingdom/kohposter01.jpg&lt;/a&gt;\n\nTrailer &lt;a href=&quot;\nhttp://movies.yahoo.com/movie/1808529407/video/2981340/20041223/165/2981340-100-wmv-s.11048400-141232,2981340-56-wmv-s.11048398-141232,2981340-700-wmv-s.11048399-141232,2981340-300-wmv-s.11048404-141232&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://movies.yahoo.com/movie/1808529407/video/2981340/20041223/165/2981340-100-wmv-s.11048400-141232,2981340-56-wmv-s.11048398-141232,2981340-700-wmv-s.11048399-141232,2981340-300-wmv-s.11048404-141232&lt;/a&gt;\n\nSummary\nDuring the Crusades--the world shaping 200-year collision between Europe and the East--a blacksmith named Balian has lost his family and nearly his faith. The religious wars raging in the far-off Holy Land seem remote to him, yet he is pulled into that immense drama. Amid the pageantry and intrigues of medieval Jerusalem he falls in love, grows into a leader, and ultimately uses all his courage and skill to defend the city against staggering odds. Destiny comes seeking Balian in the form of a great knight, Godfrey of Ibelin, a Crusader briefly home to France from fighting in the East. Revealing himself as Balian&amp;#039;s father, Godfrey shows him the true meaning of knighthood and takes him on a journey across continents to the fabled Holy City. In Jerusalem at that moment--between the Second and Third Crusades--a fragile peace prevails, through the efforts of its enlightened Christian king, Baldwin IV, aided by his advisor Tiberias, and the military restraint of the legendary Muslim leader Saladin. But Baldwin&amp;#039;s days are numbered, and strains of fanaticism, greed, and jealousy among the Crusaders threaten to shatter the truce. King Baldwin&amp;#039;s vision of peace--a &quot;kingdom of heaven&quot;--is shared by a handful of knights, including Godfrey of Ibelin, who swear to uphold it with their lives and honor. As Godfrey passes his sword to his son, he also passes on that sacred oath: to protect the helpless, safeguard the peace, and work toward harmony between religions and cultures, so that a kingdom of heaven can flourish on earth. Balian takes the sword and steps into history.\n\nWatch and Create High Quality Nero Digital Video with NeroVision Express\n\nNero Digital is a video format based on the same video compression technology that the TV and movie industries use to make your digital video experience better than ever. This state-of-the art codec (short for compressor-decompressor) is ideal for creating high-quality video files at a fraction of the original size so they can be enjoyed on PCs, TVs, and mobile devices.\n\nNero Digital videos are created using open standard codecs as adopted by the HD broadcasting standard as well as new HD technologies like AVCHD, Blu-ray, and HD DVD, as well as online video compression technologies adopted by the online video community.\n\nNero Digital videos can be viewed on a PC with Nero ShowTime, or on Nero Digital-certified DVD players, set-top boxes, digital TVs, and DMAs.Nero Digital files also play with basic audio and video functionality on any open standard players such as the PlayStation 3, Xbox 360, iPod, or software players such as QuickTime or Adobe Flash Player 9 (with MPEG-4 support).\nNero Digital video features include:\n\n    * Multiple languages, including subtitles\n    * Convenient video navigation through chapters\n    * Playback on many different devices, supporting screen sizes\n      from mobile phone resolutions up to HD TVs\n    * Excellent video and audio quality, using a fraction of the disc space.\n\n\nPlease be kind enough to seed my torrents\n\nThank You All.\n\n\nps. If nobody seeding please post a request and i will seed immediately !\n","torrent":{"xt":"urn:btih:05af007600460ec7502614ce44d6f5a85b5ffd7d","amp;dn":"Kingdom+Of+Heaven+-+Greek+Subtitles+%28Optional%29+-+By+Omifast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05af007600460ec7502614ce44d6f5a85b5ffd7d","infoHashBuffer":{"type":"Buffer","data":[5,175,0,118,0,70,14,199,80,38,20,206,68,214,245,168,91,95,253,125]},"announce":[],"urlList":[]}}