{"title":"Samba Toure - Albala (2013)","uid":8618837,"size":289236378,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:070d3c43397b753dc68623fd387b980ac23b3316&amp;dn=Samba+Toure+-+Albala+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pnin","files":-1,"time":1372320681,"description":"'Albala' is a dark, electrified, hypnotic meditation on the current crisis in Northern Mali and the most powerful and emotional album to date by former member of Ali Farka Toure's band, Samba Toure. When you meet Samba Toure in person, he comes off as a soft-spoken man, a man who easily charms you with his abundant smile and optimistic gait. But on his third album, Albala, which in the Songhai language means 'danger' or 'risk', a weighted and at times defiant side of his personality emerges. To call Albala his darkest album is an understatement, but it is not a self-absorbed darkness. The cause of Toure s worry is the crashing world around him, and more specifically the troubles echoing out from his beloved northern Mali homeland. The last year has brought cataclysmic change and upheaval to northern Mali. The tragic details of this have been globally reported, so there is little point in sensationalizing them here. But the cumulative effect of these events on Samba s music seems palatable. There is an added gravity to his voice and his words, an additional sting to his electric guitar; there are sharper edges and more complex undertones in his musical arrangements. On 'Fondora (Leave Our Road)' Samba sings with indignation: I say, leave our road/ All killers leave our road/ Thieves leave our road Looters, leave our road/ Rapists, leave our road/ Betrayers, leave our road And on the haunting 'Ago Djamba (Life Betrays Us)' Toure warns: We do not all have the same opportunities/ Here, nobody is born rich but we all have the same value/ Life betrays us. As a band member, and valued collaborator of the late Malian legend Ali Farka Toure, Samba established a significant reputation, and through his first two solo albums Songhai Blues and Crocodile Blues (World Music Network) his confidence and musical prowess grew proportionately. But Albala is a new flash point. There is more power, there is more grit, the mood is deeper, and aptly, given the album s title, Toure takes more musical risks.","torrent":{"xt":"urn:btih:070d3c43397b753dc68623fd387b980ac23b3316","amp;dn":"Samba+Toure+-+Albala+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"070d3c43397b753dc68623fd387b980ac23b3316","infoHashBuffer":{"type":"Buffer","data":[7,13,60,67,57,123,117,61,198,134,35,253,56,123,152,10,194,59,51,22]},"announce":[],"urlList":[]}}