{"title":"Badal (1966) MHCe DVD5_Eng Subs [DDR]","uid":9068372,"size":4676447657,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:07118ef853579bdab333fe4a6db11423bc7b5cf8&amp;dn=Badal+%281966%29+MHCe+DVD5_Eng+Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":-1,"time":1382145697,"description":"Badal (1966) MHCe DVD5_Eng Subs [DDR]\n\nCast: Sanjeev Kumar, Sheikh Mukhtar, L Vijayalakshmi, Helen, Kamal Mehra, Hiralal, Shammi\n\nProduced and Directed by Aspi Irani\nMusic Director: Usha Khanna\t\nLyricist: Indeevar, Javed Anwar, Asad Bhopali\nPlayback Singers:- Lata Mangeshkar, Asha Bhosle, Manna Dey, Bhupendra Singh\t\n\nSongs are included in MP3s\nBadal 1966 00. Title Music and Screen Credits, Usha Khanna\nBadal 1966 01. Aapko Jo Dekhega, Asha Bhosle, Bhupinder Singh, Asad Bhopali, Usha Khanna\nBadal 1966 02. Tere Kaabil Mein Dil Ko, Lata Mangeshkar, Indeevar, Usha Khanna\nBadal 1966 03. Apne Liye Jiye To Kya Jiye-1, Manna Dey, Javed Anwar, Usha Khanna\nBadal 1966 04. Apne Liye Jiye To Kya Jiye-2, Manna Dey, Javed Anwar, Usha Khanna\t\nBadal 1966 05. Nain Bedardi Chhaliya Ke Sang Ladh Gayee,  Asha Bhosle, Asad Bhopali, Usha Khanna\nBadal 1966 06. Mann Meet Jogi Ban Ke O Gori, Saiyyan Se Najre Mila Le, Manna Dey, Asad Bhopali, Usha Khanna\nBadal 1966 07. Apne Liye Jiye To Kya Jiye-3, Manna Dey, Javed Anwar, Usha Khanna\n\nSYNOPSIS:- Badal 1966\nA Simple woman in a village sends her son with an amulet to present himself before the sick king and instructs him to do as the king commands. This simple village lad, Badal, who has lived his life in poetry goes to the town and is misunderstood by everyone he meets including SHeroo, the inn owner, his daughter Bijuriya, and even the palace guards when he atempts to see the king. The puzzled youth tries to escape from the palace and witness the king being assinated by the Mahamantri. Sheroo realizes the bravery of the young lad Badal, and both of them decide to raise their voice against the Mahamantri and his despotic actions and Azad Shair, the poet of rebellion is thus born. No one knows who it this Azad Shair. Is he and Old Man? or a young man? or is this a woman?, but everyone hears the voice of Azad Shair, and a rebellion is aroused uin the hearts of the people against the tyrant Mahamantri. The rightful heir to the throne declares himself when the Mahamantri proclaims himself king. Who is this rightful heir? WHo is Azad SHair? And who becomes the king. The thrilling climax of BADAL holds the key to all of these questions\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4514 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: Hindi\nRunTime: 2:15:59\nSubtitles: English\nRipped by: Trinidad [DDR]   \nDuration: 2:15:59","torrent":{"xt":"urn:btih:07118ef853579bdab333fe4a6db11423bc7b5cf8","amp;dn":"Badal+%281966%29+MHCe+DVD5_Eng+Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07118ef853579bdab333fe4a6db11423bc7b5cf8","infoHashBuffer":{"type":"Buffer","data":[7,17,142,248,83,87,155,218,179,51,254,74,109,177,20,35,188,123,92,248]},"announce":[],"urlList":[]}}