{"title":"Pure Bodhran: the Definitive Collection","uid":4452695,"size":72601588,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:083e0d257d2f1e76158e12302ec0013d78b6c3ec&amp;dn=Pure+Bodhran%3A+the+Definitive+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shemyaza","files":-1,"time":1224341194,"description":"Pure Bodhran: the Definitive Collection\n\nThis double CD presents 19 leading exponents of the bodhrÃƒÆ’Ã‚Â¡n showing that in the right pair of hands this humble goatskin becomes a true musical instrument. Pure BodhrÃƒÆ’Ã‚Â¡n brings together a virtual who's who of top traditional musicians. What began as a celebration of the bodhrÃƒÆ’Ã‚Â¡n has actually evolved into one of the finest traditional music collections currently available.\n \nOver the last 30 years, bodhrÃƒÆ’Ã‚Â¡n playing has developed into an entirely new voice in traditional Irish music. Today the bodhrÃƒÆ’Ã‚Â¡n has become as much a symbol of Ireland as the harp, and this once humble drum is played today using highly innovative technique and tone, making it one of the most exciting instruments in Irish music. Pure BodhrÃƒÆ’Ã‚Â¡n turns the spotlight on the bodhrÃƒÆ’Ã‚Â¡n in its many roles. As a driving rhythmic accompaniment, as subtle or teasing embellishment to adorn music, lilt or song, as a tonal instrument in its own right or in a proud solo role.\n \nPure BodhrÃƒÆ’Ã‚Â¡n has a packed agenda , built around music not just beat. Robbie Harris, Ronan O Snodaigh, Tommy Hayes , John Joe Kelly, Jimmy Higgins and a gentle Cathy Jordan complete disc 1.The second disc is reserved for the trail blazers including Christy Moore, Donal Lunny, Kevin Conneff, Johnny Mc Donough and Colm Murphy. Wonderful too is the first recording of the bodhrÃƒÆ’Ã‚Â¡n by John Renolds in 1927.\n \nTrack Listing\n\nCD 1\n\n1. Simply A-Tommy Hayes,Ronan Browne, Meta Costelloe\n2. Jig Jungle-Robbie Harris, Peter Browne, Charlie Foley\n3. Feach-Ronan O Snodaigh, kila\n4. Beautiful Lake Ainslie-Jimmy Higgins, Alan Kelly, SteveCooney\n5. Cathals Favourite-Damien Quinn, Cian\n6. Humours of Tullagh-Donnacha Goff, Danu\n7. Two Island Swans- Dave Donohoe, Tony Davoren\n8. Lark on the Strand-Cathy Jordan, Dervish\n9. Phis Fluich- Brian Flemming, Sean Whelan, Paul Kelly\n10. Calico- John Joe Kelly, Flook\n\nCD 2\n\n1. Cottage in the Grove-Christy Moore, Nollaig Casey, Arty Mc Glynn\n2. Estonian Waltz-Kevin Conneff, Paul Mc Grattan, Maire Ni Chaoimh\n3. Dunmore Lassies-John Reynolds, Tom Morrison\n4. The Lonesome Polkas-Colm Murphy, Jackie Daly, Seamus Creagh\n5. Sean Reids-Johnny Mc Donnagh, Mary Bergin\n6. Momninsko Horo-Donal Lunny, Arty Mc Glynn, Nollaig Casey\n7. The Bodhran Song- Gino Lupari, Ron Kavana\n8. The Legacy Jig-Glen Velez, Joanie Madden, Jerry O Sullivan\n9. Whirily-Reel-1-James Mc Nally,AfroCeltSoundsystem","torrent":{"xt":"urn:btih:083e0d257d2f1e76158e12302ec0013d78b6c3ec","amp;dn":"Pure+Bodhran%3A+the+Definitive+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"083e0d257d2f1e76158e12302ec0013d78b6c3ec","infoHashBuffer":{"type":"Buffer","data":[8,62,13,37,125,47,30,118,21,142,18,48,46,192,1,61,120,182,195,236]},"announce":[],"urlList":[]}}