{"title":"R.R. George Martin - Het Lied van IJs en Vuur - Eerste Boek - He","uid":6789718,"size":914774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08dd7fe1bc1c43d883f3762f4a03b8478af92ad2&amp;dn=R.R.+George+Martin+-+Het+Lied+van+IJs+en+Vuur+-+Eerste+Boek+-+He&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":-1,"time":1320226342,"description":"\nHet Spel der Tronen: een indrukwekkende inleiding\nHet spel der Tronen is het eerste boek uit George R.R. Martin's indrukwekkende reeks Het Lied van ijs en vuur. De engelstalige versie, A Game of Thrones, werd voor het eerst uitgegeven in 1997. In 1999 werd het boek vertaald naar het Nederlands.\n\nHet Spel der Tronen zet als het eerste boek uit de reeks meteen de toon voor de rest van de boeken. Het is vanaf de eerste paar pagina's duidelijk dat de atmosfeer in Het Lied van Ijs en Vuur sterk verschilt dan die van de meeste andere fantasyboeken. Het boek is namelijk erg donker en volwassen van aard.\n\nHet verhaal vertelt afwisselend passages uit het leven van enkele van de hoofdpersonen van het boek. Erg aanwezig in dit boek is Eddard Stark en zijn familie, afkomstig uit het Hoge Noorden en enkele van de enigsten die nog aanhangers zijn van de oude leer, en op hun hoede zijn voor De Winter. \n\nIn het begin van het boek komt Robert Baratheon, de huidige koning, op bezoek bij zijn oude vriend Eddard Stark. Robert vraagt Stark om de taak van de Hand van de koning te vervullen, aangezien de oude recent vermoord is. De koning vermoedt dat er meer gaande is dan initieel vermoed werd, en vraagt hulp aan Eddard, de enige die hij nog kan vertrouwen.\n\n\nNLT-RELEASE IS TERUG KOM SNEL NAAR DE SITE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\n\nBy Linday","torrent":{"xt":"urn:btih:08dd7fe1bc1c43d883f3762f4a03b8478af92ad2","amp;dn":"R.R.+George+Martin+-+Het+Lied+van+IJs+en+Vuur+-+Eerste+Boek+-+He","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08dd7fe1bc1c43d883f3762f4a03b8478af92ad2","infoHashBuffer":{"type":"Buffer","data":[8,221,127,225,188,28,67,216,131,243,118,47,74,3,184,71,138,249,42,210]},"announce":[],"urlList":[]}}