{"title":"The Fugitive S02E12 Detour on a Road Going Nowhere DVDRip DivX","uid":4307800,"size":419708421,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:08f289227cbfb8dc386442478da1ba30096a39eb&amp;dn=The+Fugitive+S02E12+Detour+on+a+Road+Going+Nowhere+DVDRip+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":3,"time":1216654596,"description":"The Fugitive Season 2 (1964)\nS02E12 Detour on a Road Going Nowhere\nFirst aired: 12/8/1964 \n\nWhile working as a hotel steward in Wyoming, Kimble is forced to run after learning that another hotel employee has stolen hotel funds, and Kimble becomes the suspect. Kimble escapes on a tour bus containing a bickering couple called the Langners, a visiting spinster named Louanne, a local guy named Sandy Baird, and the bus driver. But Kimble becomes trapped when the bus breaks down on a back road, and all the passengers discover his secret when his identity is revealed over the radio. Held at gunpoint, Kimble must find a way to escape by emotionally getting between his various captors before the bus driver returns with the police.\n\nCast: David Janssen as Dr. Richard Kimble, Barry Morse as Lt. Philip Gerard, Bill Raisch as Fred Johnson (The One-Armed Man), Diane Brewster (flashbacks) as Helen Kimble, J.D.Cannon as Lloyd Chandler, William Conrad as Narrator (voice)\n\nGuest cast: Lee Bowman (Tod Langner), Elizabeth Allen (Louanne), Phyllis Thaxter (Enid Langner), Don Quine (Sandy Baird), Frank Marth (Hornbeck), Warren Vanders (Andy), Barry Cahill (Bus Driver), Walter Brooke (Jess Platt), Steven Bell (Bob Street), Lana Wood (The Doll)\nDVD&gt;DivX/640x480/b&amp;w/970kbps/23.976fps/mp3/48KHz/stereo/102Kbps/51min/400Mb","torrent":{"xt":"urn:btih:08f289227cbfb8dc386442478da1ba30096a39eb","amp;dn":"The+Fugitive+S02E12+Detour+on+a+Road+Going+Nowhere+DVDRip+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08f289227cbfb8dc386442478da1ba30096a39eb","infoHashBuffer":{"type":"Buffer","data":[8,242,137,34,124,191,184,220,56,100,66,71,141,161,186,48,9,106,57,235]},"announce":[],"urlList":[]}}