{"title":"[DC] World Series Baseball 2K1 [Self-Boot] [NTSC] [CDI]","uid":4717400,"size":281049933,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:0a3cbb53330bd4bad2c26e8489735af29cf21ae5&amp;dn=%5BDC%5D+World+Series+Baseball+2K1+%5BSelf-Boot%5D+%5BNTSC%5D+%5BCDI%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Big_dude","files":-1,"time":1234351460,"description":"World Series Baseball 2K1 for Sega Dreamcast                       Rel. in 2000\n\n\nFormat:           CD-R NTSC (Self-Boot)\nLang.:            English\nDiscs:            1\nImage:            CDI\nRequirements:     DC Emulator or Sega Dreamcast Console.\n\nNote: (Try to use a DC console that was manufactured before october 2000 to be on the safe side, Because a bios change was made to the console after this date that supposedly disallows utopia or selfboot games, Not sure if this is true or not but don't be surprised if this doesn't work on the later versions of dreamcast. So make sure you check the date on the bottom of the console you should be able to find the manfacture date, in fine print if you still have the sticker attached).\n\nGenre:            Sports/Baseball\n\nCompressed with WinRaR.  Game was tested &amp; works.\n\nNote: you can extract winrar formats with 7-Zip, 7-Zip is free.\n\nAny DC Games that you burn make sure you allow overburning option in Alcohol or discjuggler, if your burner supports it.\n\nWorld Series Baseball 2K1 is already well around the internet but every version seemed to be the non-selfboot. And I wanted to upload the selfboot version so you don't have to mess around getting out that utopia disc every time you want to play this game.\n\nGame Description:\n\nWorld Series Baseball 2K1 features the actual players, teams, and stadiums of the 2000 baseball season.  You can play an exhibition game or a season of 13-162 games, including an All-Star game and play-offs.\n\nGameplay is the standard behind-the-catcher viewpoint for batting and pitching, switching to different views after the ball is hit. The famous limitation of World Series Baseball 2K1 is that you cannot control the fielders until after the ball is fielded! For this reason the game was almost universally panned by reviewers upon its release.  This flaw was fixed in subsequent releases of the World Series Baseball franchise.\n\nGame Pics included.\n\n\nDon't forget to seed this.\n\n\nIf you come across problems or have questions, please post a comment.\n\n\nBurn with Alcohol 120% (Included in download) or Discjuggler. \n\nBurn at slowest speed possible for compatibility.\n\n\nBest recommended CD Discs to burn this DC game are Tayio Yuden, or Verbatim.\n\n\nVerbatim is properly your best bet and should work just fine. \n\n\nEnjoy!\n\nYou guys need to seed this don't just leech, I can't seed all the time.","torrent":{"xt":"urn:btih:0a3cbb53330bd4bad2c26e8489735af29cf21ae5","amp;dn":"%5BDC%5D+World+Series+Baseball+2K1+%5BSelf-Boot%5D+%5BNTSC%5D+%5BCDI%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a3cbb53330bd4bad2c26e8489735af29cf21ae5","infoHashBuffer":{"type":"Buffer","data":[10,60,187,83,51,11,212,186,210,194,110,132,137,115,90,242,156,242,26,229]},"announce":[],"urlList":[]}}