{"title":"Salad - Ice Cream [1997]","uid":9419095,"size":332903242,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0af6711446dec7a3e97721db7d178799cd78ed35&amp;dn=Salad+-+Ice+Cream+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1388522674,"description":"Salad, like the food they're named after, previously had been best in small doses. Ice Cream is thankfully more consistent and shows improvement in the playing over their first LP, Drink Me, even if stylistically they haven't progressed much. They're still best described as beating Elastica, Echobelly, and the early Sleeper (who have progressed a great deal) at their own games, good as those bands are, since Salad have more honest drive and unmistakable energy, and when moved, the most killer tunes of all of them by far. And gorgeous Marijne Van Der Vlugt (a TV presenter in England, no surprise there) can really sing. Here's what's odd: on Drink Me, half the songs were head and shoulders above the other half. On Ice Cream every song is better developed, the takes are better, and veteran Donald Ross Skinner ('80s guitarist for Edwyn Collins and Julian Cope) proves to be a valuable producer. That's the good news. The bad news: nothing here quite matches the special craft of Drink Me's &quot;Motorbike to Heaven&quot; or the kiss-ass excitement of &quot;Drink the Elixir.&quot; Quite a few tracks approach the tuneful pleasure of that LP's &quot;Granite Statue&quot; -- &quot;Terrible Day&quot; and the single &quot;Cardboy King,&quot; especially (why isn't the smashing &quot;I Want You&quot; single included here?). And again, the U.S. branch of the Island label passes on releasing the valuable, fun Salad, while one mediocre, garden-variety (couldn't resist that) limey band after another gets their product out in the wake of Oasis. But if you have the dough, this Ice Cream is surely worth the lick. (3/5)","torrent":{"xt":"urn:btih:0af6711446dec7a3e97721db7d178799cd78ed35","amp;dn":"Salad+-+Ice+Cream+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0af6711446dec7a3e97721db7d178799cd78ed35","infoHashBuffer":{"type":"Buffer","data":[10,246,113,20,70,222,199,163,233,119,33,219,125,23,135,153,205,120,237,53]},"announce":[],"urlList":[]}}