{"title":"WWE Hell In A Cell 2010 DSR XviD-XWT","uid":5868119,"size":1432319392,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b7d7c443b3415e383ea0499036ada8d955bd32d&amp;dn=WWE+Hell+In+A+Cell+2010+DSR+XviD-XWT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"HeroMaster","files":-1,"time":1286278937,"description":"The main rivalry from the Raw brand features the new champion Randy Orton against former champion Sheamus in a Hell in a Cell for the WWE Championship. At Night of Champions, Randy Orton had survived against Chris Jericho, Edge, John Cena, Wade Barrett and Sheamus in a 6 Pack Challenge for the title following a massive winning streak leading up to Night of Champions. The next day on Raw, Sheamus invoked his rematch clause for the title. The Raw General Manager approved of this match allowing it to be contested under Hell in a Cell.\n\nThe main rivalry from the Smackdown brand features champion Kane against The Undertaker in a Hell in a Cell for the World Heavyweight Championship. After putting The Undertaker in a (kayfabe) vegetative state and stealing his powers, Kane had been dominating his brother for weeks. At Night of Champions, Kane put his title on the line to face The Undertaker in a No Holds Barred match in which he came out victorious. In an attempt to end The Undertaker for good, Kane challenged his brother again inside Hell in a Cell, a match type originally concieved by The Undertaker. However, a returning Paul Bearer reunited with The Undertaker and has restored his powers.\n\nAnother rivalry from Raw involves John Cena against Wade Barrett, the leader of a group of former NXT rookies known as the Nexus. Since their creation, The Nexus has assaulted many wrestlers on Raw, but mainly focusing on John Cena. The has caused him to lose many championship matches due to their involvement, more recently in Night of Champions where The Nexus attacked Cena allowing Barrett to eliminate him from the 6-Pack Challenge match. The next day on Raw, both Cena and Barrett agreed to a match where if Barrett wins, then Cena must join The Nexus but if Cena wins, then The Nexus must disband. The General Manager of Raw also stated that if any member of The Nexus interferes, then the win automatically goes to Cena.\n\n\nMatches:\n\nUnited States Championship:\n(Submissions Count Anywhere)\n-Daniel Bryan vs. The Miz vs. John Morrison\n\n\nWWE Championship:\n(Hell In A Cell)\n-Randy Orton vs. Sheamus\n\n\nEdge vs. Jack Swagger\n\n\nJohn Cena vs. Wade Barrett\n\n\nUnified Divas Title:\n-Michelle McCool vs. Natalya\n\n\nWorld Heavyweight Championship:\n(Hell In A Cell)\n-Kane vs. The Undertaker\n\n\nENJOY!","torrent":{"xt":"urn:btih:0b7d7c443b3415e383ea0499036ada8d955bd32d","amp;dn":"WWE+Hell+In+A+Cell+2010+DSR+XviD-XWT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b7d7c443b3415e383ea0499036ada8d955bd32d","infoHashBuffer":{"type":"Buffer","data":[11,125,124,68,59,52,21,227,131,234,4,153,3,106,218,141,149,91,211,45]},"announce":[],"urlList":[]}}