{"title":"Instant Demo Studio v8.50.535.0","uid":7070807,"size":9939312,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0b8518f633437f558f1e85505b405e1456d108a7&amp;dn=Instant+Demo+Studio+v8.50.535.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1330649530,"description":"Instant Demo is a Windows application that provides a new quick and easy way to create demos and tutorials of your software in the popular Flash format. Instant Demo is ideal for software demonstrations, customer support and training. Instant Demo uses a simple design philosophy, providing an intuitive approach to the creation process. A single click of a button is all that is required to start recording. Instant demo automatically captures any visual changes on your desktop, including mouse appearance and movement. Voice annotation is fully supported by Instant Demo with live sound recording during capture, as well as recording or inserting sound files during editing.\nInstant Demo uses a 64-bit file structure to store your screen recording. This allows for recordings of up to 18000 Gigabytes in file size. Depending on the nature of the screen activity being recorded, this will allow for continuous recording over several weeks, months or possibly years. The maximum recording period is limited only by the amount of available storage on your computer system. A general rule of thumb for recorded video of typical Windows applications is about 1MB per minute (when exporting your recording to Flash, allow 0.1MB per minute).\n &lt;a href=&quot;\nhttp://www.instant-demo.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.instant-demo.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:0b8518f633437f558f1e85505b405e1456d108a7","amp;dn":"Instant+Demo+Studio+v8.50.535.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b8518f633437f558f1e85505b405e1456d108a7","infoHashBuffer":{"type":"Buffer","data":[11,133,24,246,51,67,127,85,143,30,133,80,91,64,94,20,86,209,8,167]},"announce":[],"urlList":[]}}