{"title":"Frontiers of Flight Vol 1,2,3","uid":3299155,"size":4757855360,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0bd2448b480d3dc957bf442279570bdd4cc777a5&amp;dn=Frontiers+of+Flight+Vol+1%2C2%2C3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"DPStudio","files":13,"time":1110203423,"description":"\nPowered Flight, Coast to Coast, Atlantic, USA/Europe non-stop.\n\nPowered Flight - Recapping the efforts of 19th Century flight engineers, Power Flight reviews the work of many pioneers of flight.\n\nCoast to Coast - Coast to Coast follows the attempts of Cat Rodgers, Oakley Kelley and John McReady in their attempts to cross the American continent by air.\n\nAtlantic &amp;amp; the World - In 1919, one of four Navy Curtiss crafts successfully completes the first cross-Atlantic flight.\n\nUSA/Europe Non-Stop - Charles Lindbergh's famous non-stop crossing of the Atlantic is relived in USA/Europe Non-Stop.\n \nAir Transport for All - This episode traces the developments in passenger air travel that set new standards for comfort and safety.\n\nGolden Age Frontiers - Some of the more glamorous and adventurous moments in early aviation are examined.\n\nRocket Power - WWII sparks an unofficial &amp;quot;rocket race&amp;quot; between Germany and U.S.\n\nJet Power - Germans compete with England to design the best jet fighter.\n \nSound Barrier - Charles &amp;quot;Chuck&amp;quot; Yeager is chosen to fly the X-1 past the speed of sound.\n\nJet Airliner - This episode looks at the Boeing Company's efforts on the cutting edge of developing jet-powered aircraft in the mid-1950's.\n\nThreshold of Space - A 1954 joint project between NASA, the U.S. Air Force, Navy and private industry resulted in the successful creation of the X-15 program that sets the stage for America's space program.\n\nSpace &amp;amp; Back - The Boeing Company is awarded a contract in the late 1950's to develop a vehicle capable of going to space and landing back on Earth.\n\nLast Great World Record - Around the world, non-stop, and un-refuelled.\n\nhttp://www.gumboot.co.nz/product.asp?p=1&amp;amp;i=3298\n","torrent":{"xt":"urn:btih:0bd2448b480d3dc957bf442279570bdd4cc777a5","amp;dn":"Frontiers+of+Flight+Vol+1%2C2%2C3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bd2448b480d3dc957bf442279570bdd4cc777a5","infoHashBuffer":{"type":"Buffer","data":[11,210,68,139,72,13,61,201,87,191,68,34,121,87,11,221,76,199,119,165]},"announce":[],"urlList":[]}}