{"title":"Gary Brooker Ensemble - Within Our House (Procol Harum)","uid":4985684,"size":400879469,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0c7d1fcaeff9d56d84ebaffe776ce221e0e48375&amp;dn=Gary+Brooker+Ensemble+-+Within+Our+House+%28Procol+Harum%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sowingmyseed","files":17,"time":1246665247,"description":"Review\tby William Ruhlmann\n\nProcol Harum singer and pianist Gary Brooker organized a benefit concert at and for his local church, St. Mary's and All Saints, in Surrey, England, on September 28, 1996, and released a recorded version on his own mail-order label Gazza Records. Picked up by the German Repertoire label, the album presents the unplugged, five-piece Gary Brooker Ensemble, whose members include former Pretenders guitarist Robbie McIntosh and Big Country drummer Mark Brzezicki, accompanied by a chorus and a string quartet, playing a combination of classical pieces, gospel adaptations, and songs from Procol Harum's catalog. (The title song is newly written by Brooker and his lyric collaborator Keith Reid.) The result is a charming chamber work with wonderfully detailed sound that illuminates the roots of Procol Harum's music in its classical antecedents. Neatly marking the 25th anniversary of the group's popular album Procol Harum Live in Concert with the Edmonton Symphony Orchestra, it manages to define the inevitable closing song, &quot;A Whiter Shade of Pale,&quot; as part of a tradition including Vaughan Williams and even that noted composer, Henry VIII.","torrent":{"xt":"urn:btih:0c7d1fcaeff9d56d84ebaffe776ce221e0e48375","amp;dn":"Gary+Brooker+Ensemble+-+Within+Our+House+%28Procol+Harum%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c7d1fcaeff9d56d84ebaffe776ce221e0e48375","infoHashBuffer":{"type":"Buffer","data":[12,125,31,202,239,249,213,109,132,235,175,254,119,108,226,33,224,228,131,117]},"announce":[],"urlList":[]}}