{"title":"Amar Bhoopali (1951) Marathi_1cd_Indian Cinema_Golden Years_V.Sh","uid":8858964,"size":883994217,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0dc63f5b9e720a8fc56a7f1db5cc31b44bedf2d0&amp;dn=Amar+Bhoopali+%281951%29+Marathi_1cd_Indian+Cinema_Golden+Years_V.Sh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"SaM","files":-1,"time":1377729828,"description":"Amar Bhoopali (1951) Marathi_1cd_Indian Cinema_Golden Years_V.Shantaram Classic DDR\n\nThe film entered the International film festival held at kans in the year 1952.\nIt bagged the Centre National De La Cenemotographic, Paris award for the best sound recording , Dubbed in Bengali, the film was released in West Bengal. &quot;Amar Bhupali&quot; in rela means brought into theaters, rural audience to watch Marathi film.\n\nCast:- \nPANDITRAO NAGARKAR\nSANDHYA\nLALITA PAWAR\nBHALCHANDRA PENDHARKAR\nISHWAS\nGULAB\nJAYARAMPANT\nNIMBALKAR\nAMEENA\nBANDOPANT SOHONI\n \nDirector - V. SHANTARAM\nComposer - VASANT DESAI\nLyrics - Shahir Honaji Bala\n\nSongs are included in MP3s\nAmar Bhopali (1951) 00. Title Music and Screen Credits, Vasant Desai\nAmar Bhopali (1951) 01. Verse Recital\nAmar Bhopali (1951) 02. Saanga Mukund Kuni Ha Paahila, Panditrao Nagarkar, Lata Mangeshkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 03. Sayankali.. Arunodaya-2, Panditrao Nagarkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 04. Sayankali Arunodaya -1, Panditrao Nagarkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 05. Kesar Bol, Lata, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 06. Ananda Kanda-1, Panditrao Nagarkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 07. Ananda Kanda-2, Panditrao Nagarkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 08. Sayankali.. Arunodaya-2, Panditrao Nagarkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 09. Sayankali.. Arunodaya &amp; Aanda Kanda2, Panditrao Nagarkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 10. Ghadi ghadi Arey Manmohana, Panditrao Nagarkar, Lata, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 11. Tujya Pritiche Dukhh Mala Daau Nako Re, Lata, Panditrao Nagarkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 12. Latpat Latpat Tujha Chaalan Ga, Lata Mangeshkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 13. Sundara Mhane, Panditrao Nagarkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 14. Gora Rang, Panditrao Nagarkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 15. Sajna..Nako door deshi jaau sajana, Lata Mangeshkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 16. Tujhe Majhi Preet, Lata Mangeshkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 17. Phad Phad Phadakato Bhagwa Zhenda Gaganaat, Lata, Panditrao Nagarkar, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 18. Ananda Kanda-1, Panditrao Nagarkar, Lata, Honaji Bala, Vasant Desai\nAmar Bhopali (1951) 19. Ghanshyam sundara shridhara arunoday_Lata_Panditrao ( Popular Duet )\n\nThe 1930s and 1940 witnessed the rise of film personalities such as Debaki Bose, Chetan Anand, S.S Vasan, V. Shantaram and others. Their contribution helped  the Indian cinema much further. By this time, apart from Bombay, the film industry was well being shaped up in the South of India. The Tamil, Telugu and Kannada film industries were making indigenous films also. By the late 1940s, films in India were made in various languages, but the religious influence was predominant. With the struggle for Independence, the entire senario was altered. Indian cinema saw films based on the then contemporary social issues. Movies were no longer limited to the periphery of entertainment. they were now potent instruments to educate the masses as well.\n\n'The Golden Years'  period in the history of 'Indian Cinema' is attributed to the 1950s. This post Independence period of Indian Cinema was filled with melodious socials and melodramas, which made Actors/Actresses a household name. \n\nGuru Dutt, Mehboob Khan, Raj Kapoor, Bimal Roy, Nargis, Meena Kumari, Madhubala, Dilip Kumar and Shammi Kapoor and others, graced the screens. Raj Kapoor (RK films) was one example. He made 'Awara which set the agenda for popular cinema and was a hit in India as well as overseas.\n\nIn South India, actors like RajKumar, Gemini Ganesan, N.T. Rama Rao and several other actors and Actresses entertained audiences . Besides the actors/actresses, numerous singers, composers, scriptwriters lend a helping hand in making some of the most outstanding films that carved their own niches in the History of Indian Cinema.\n\nWhile the magic of the Guru Dutts, Bimal Roy and Shantaram etc, were stamped in Indian Cinema's Golden Years, Indian Cinema moved one step further with the release of K. Asif's 'Mughal-e-Azam' in 1960. A trail of romantic movies followed all over India. While the Indian commercial cinema enjoyed popularity amidst movie goers. Indian Cinema dis not go unnoticed. Adoor GopalaKrishnan, Ritwik Ghatak, Satyajit Ray, Aravindan and several other film directors were making movies that took India to International fame and glory.  By the 1970s Indian Cinema enjoyed the histronics of superstars like Rajesh Khanna, Waheeda Rehman, Asha Parekh Tanuja and others. This was truly the red letter year for Indian Cinema as Ramesh Sippy's ''Sholay' proved to be an inconclast and gave Indian Cinema it's new superstar Amitabh Bachchan...Hardly anyone took notice that the Bachchan era was here to stay for long enough..\n\n\nMOVIE REVIEW:- Amar Bhoopali (1951)\nAmar Bhoopali 1951 - The Musical Biopic of Honaji Bala, popularized the musical dance form of the 'Lavani'. The film and it's classic song 'Ghanashyam Sundara Shirdara' became a cult classic in Marathi Cinema\n\nThey say that any Maharashtrian has to know this song or else he is considered unfit to be a Maharashtrian! The famous movie-maker V.Shantaram's Marathi film &quot;AMAR BHOOPALI&quot; (1951) was a popular one and its viewership spread into up North and even South India. This song &quot;Ghanashyam Sundara&quot; became an immediate and immense hit all over the country. The lyrics were by Shahir Honaji Bala and music was by Vasant Desai. The song was a duet sung by Panditrao Nagarkar and Lata Mangeshkar. This movie is actually a bio-pic on Honaji Bala himself! AMAR BHOOPALI means &quot;Long live raag Bhoopali&quot;. This raag is also known asBhoop in the Hindustani system and is called Mohanam in the Carnatic system\n\nVeteran director V. Shantaram spins this bio-pic about poet and musician Honaji Bala -- best know for popularizing the lavani dance form and for writing the classic raga Ghanashyam sundara shirdhara -- who reached the zenith of his creative powers just as the Maratha empire was collapsing to British invasion forces. The film shows not only Bala's passionate interest in lavani, but also his passionate interest in prostitutes -- particularly a beautiful dancer named Tamasha (Sandhya). As the Pune court bestows Bala an award for his talents, the film shows the Maratha army getting routed by the British onslaught               \n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 609 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: 112kb/s VBR 48000 Hz\nAudio Streams: 2\nAudio Languages: Marathi\nRunTime: 2:04:32\nSubtitles: English\nRipped by: Trinidad [DDR] \nDuration: 2:04:32\n","torrent":{"xt":"urn:btih:0dc63f5b9e720a8fc56a7f1db5cc31b44bedf2d0","amp;dn":"Amar+Bhoopali+%281951%29+Marathi_1cd_Indian+Cinema_Golden+Years_V.Sh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dc63f5b9e720a8fc56a7f1db5cc31b44bedf2d0","infoHashBuffer":{"type":"Buffer","data":[13,198,63,91,158,114,10,143,197,106,127,29,181,204,49,180,75,237,242,208]},"announce":[],"urlList":[]}}