{"title":"Malibu - Ultraverse","uid":4410448,"size":5933562992,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0e179d8104994d9841a220646d819c6eb32dd38d&amp;dn=Malibu+-+Ultraverse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"citaltras","files":441,"time":1222214013,"description":"\n\nThe Ultraverse line was launched by Malibu Comics during the &quot;boom&quot; of the early 1990&amp;#039;s. Following the success of Image (a studio of comics&amp;#039; top artists each publishing their own book contained in its own mini-universe) and Valiant Comics (a cohesive universe shared by all the Valiant characters - the model the Ultraverse line aimed to imitate), a number of new universes were launched including Milestone from DC and Comics Greatest World from Dark Horse. While it was not as successful as Image or Valiant Comics, Ultraverse was successful relative to the other universes. They boasted improved production values over traditional comics (especially digital coloring and higher-quality paper), and a roster of respected and/or talented new writers and artists. Following the Valiant Comics formula closely, Ultraverse emphasized tight continuity between the various series in their line, Malibu made extensive use of crossovers, in which a story that began in one series would be continued in the next-shipping issue of another series. Various promotions for special editions or limited-print stories also encouraged readers to sample issues of the entire line. Many fans loved the scope of storytelling this approach allowed; others complained of the effort and cost of buying the issues necessary to keep track of it all. Regardless, the Ultraverse line came to dominate Malibu&amp;#039;s catalog.\n\nAs sales declined industry-wide in the mid-1990s, Malibu cancelled lower-selling series. The company was purchased by Marvel Comics in 1994. Reportedly Marvel made the purchase to acquire Malibu&amp;#039;s then-groundbreaking in-house coloring studio, and/or its catalog of movie-licensable properties. Others believe that Marvel simply wanted to put a significant competitor out of business. Marvel cancelled the entire Ultraverse line, but (during the controversial Black September event) re-launched a handful of the more popular titles as well as a number of crossovers with Marvel characters. The &quot;volume 2&quot; series each started with &quot;# \u001e (infinity)&quot; issues and were cancelled a short time later. Within the Marvel Comics multiverse, the Malibu Universe is designated as Earth-93060.\n\n(from wikipedia)\n\nEnjoy and seed","torrent":{"xt":"urn:btih:0e179d8104994d9841a220646d819c6eb32dd38d","amp;dn":"Malibu+-+Ultraverse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e179d8104994d9841a220646d819c6eb32dd38d","infoHashBuffer":{"type":"Buffer","data":[14,23,157,129,4,153,77,152,65,162,32,100,109,129,156,110,179,45,211,141]},"announce":[],"urlList":[]}}