{"title":"[ExploitedCollegeGirls] Julie From Palomar Community College","uid":8625232,"size":638589095,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0e1955764d87cd0a7f07184960d6e32708d57f23&amp;dn=%5BExploitedCollegeGirls%5D+Julie+From+Palomar+Community+College&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"chkm8te","files":1,"time":1372487301,"description":"[ExploitedCollegeGirls] Julie From Palomar Community College\n\nSo you ask: how does a sweet, young, naive girl, that has done only mainstream modeling before, end up in a hotel room in Santa Monica having sex with an older man? That's for me to know and for you to find out. If it were easy, everyone would be doing this, right? Well, 19 year old Julie is not the sharpest tool in the toolbox. Her life goal is to be a dancer of some kind, and I don't think it includes a pole, LOL! But after all her friends and teachers see her slutting around on the Internet I bet that is the only type of work she will be able to do!\n\nIf wanting to be a dancer was all, and she was going to a prestigious Dance academy, that would be something. But she is studying ballet at a Community College in San Diego (!!!) and we all know how hard it is to get accepted into a community college, LOL! Another interesting tidbit for all you guys that think a girl like this is out of your league, I have news for you! When I asked her what type of guy she likes she replied, &quot;I kinda like nerdy guys. There is just something about them I really like&quot;.\n\nOn the outside, Julie is a hottie, but she is a brainy one also that likes to read and is in love with the classic arts. Well, any girl that has sex for money on camera definitely has a wild or slutty side to them also. When I told her that all her guy friends would want to have sex with her after they see her on ECG she said, They all do already!!! Now, that's what I like, a sweet librarian type that is a raging nymphomaniac behind closed doors. A girl that can be classy and a lady in public, but will satisfy all sexual demands without being too slutty about it is a girl worth having as a friend, a friend with benefits that is! Well, look for sweet and innocent looking Julie at your local town theater production... or your local strip club after everyone finds out what a slut she is, LOL! Either way, Enjoy!!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=aa9cxb8ju89psosx2f3b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=aa9cxb8ju89psosx2f3b.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=2d8zxxwjxay0tqnxg8ap.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=2d8zxxwjxay0tqnxg8ap.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:0e1955764d87cd0a7f07184960d6e32708d57f23","amp;dn":"%5BExploitedCollegeGirls%5D+Julie+From+Palomar+Community+College","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e1955764d87cd0a7f07184960d6e32708d57f23","infoHashBuffer":{"type":"Buffer","data":[14,25,85,118,77,135,205,10,127,7,24,73,96,214,227,39,8,213,127,35]},"announce":[],"urlList":[]}}