{"title":"HISTORY OF POP AND ROCK MUSIC - part 394","uid":7371601,"size":691014128,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0e821e2499f73b0af59a337091a983d7cabd6306&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+394&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1340245773,"description":"                \n\n                         PART  394\n\n\n\n           JIMI HENDRIX  -   Are You  Experienced  (1967)\n           JIMI HENDRIX  -   Crosstown Traffic  (1969)\n           JIMI HENDRIX  -   Dolly Dagger  (1971) \n           JIMI HENDRIX  -   Bleeding Heart  Valleys Of Neptune \n                          \n\n\n    &quot;Are You Experienced?&quot; is a song written by Jimi Hendrix and recorded by The Jimi Hendrix Experience for their 1967 debut album &quot;Are You Experienced&quot;. The song was recorded on April 3, 1967 at Olympic Sound Studios in London, England; the songs &quot;May This Be Love&quot; and &quot;Highway Chile&quot; were recorded on the same day. Described as a &quot;psychedelic symphony&quot;, the recording combines backwards and forward recorded guitars and drums. The album reached #2 in the UK, behind The Beatles' Sgt. Pepper's Lonely Hearts Club Band. The US version of the album contains some of Hendrix's best known songs, including &quot;Purple Haze&quot;, &quot;Hey Joe&quot;, &quot;The Wind Cries Mary&quot; and &quot;Fire&quot;. In 1987, as part of their 20th anniversary, Rolling Stone magazine ranked it #5 on &quot;The 100 Best Albums of the Last Twenty Years.&quot; In 2003, Rolling Stone magazine ranked it #15 on Rolling Stone's 500 Greatest Albums of All Time. The album was an instant success and was a best-selling album in the United States in 1968, and critics subsequently regarded it as one of the best rock albums of all time.\n   &quot;Crosstown Traffic&quot; is a song written by Jimi Hendrix. It was the second single released from the album Electric Ladyland by The Jimi Hendrix Experience. It peaked at #52 on the Billboard Hot 100, and at #37 on the pop singles chart in the United Kingdom.\n   &quot;Dolly Dagger&quot; is the name of a song written and recorded by Jimi Hendrix. It was first released on 9 October 1971 on the posthumous LP Rainbow Bridge, and on 23 October it was released on a single to promote the LP, backed with a solo rendition of the Star Spangled Banner. It peaked at no. 74 on the Billboard Hot 100 and was the last Hendrix single to break the charts.\n   &quot;Valleys of Neptune&quot; is a song by Jimi Hendrix, featured on his 2010 posthumous studio album &quot;Valleys of Neptune&quot;. Written and produced by Hendrix, the song was originally recorded between 1969 and 1970, and was released on March 8, 2010.Hendrix wanted to play the song as the encore at Woodstock but could not remember the words. This can be heard just before the band go into &quot;Hey Joe&quot; on the album &quot;Live at Woodstock&quot;.","torrent":{"xt":"urn:btih:0e821e2499f73b0af59a337091a983d7cabd6306","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+394","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e821e2499f73b0af59a337091a983d7cabd6306","infoHashBuffer":{"type":"Buffer","data":[14,130,30,36,153,247,59,10,245,154,51,112,145,169,131,215,202,189,99,6]},"announce":[],"urlList":[]}}