{"title":"Ambient Metal Construction's Bundle Vol.1-3 (Requested)","uid":9272404,"size":1771897894,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0ed54c0f816b6a5f6ef329084ff70279eab8bff8&amp;dn=Ambient+Metal+Construction%27s+Bundle+Vol.1-3+%28Requested%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AngelDiMaria","files":762,"time":1385806668,"description":"Content\n'Ambient Metal Constructions Bundle' contains volumes 1 to 3 of this unique and inspiring series to bring you the complete experience. Includes A Massive amount of Guitar, Bass, Drum and Synth Loops That Will Take you on an epic journey from hard edged tech Metal subdued to Ambience. \nThe first Three Volumes of Ambient Metal Constructions Were Only the sample packs to Combine the sounds of Modern tech and Progressive Rock, with the smooth, liquid vibes of Trance Chillout and to create an Entirely Unique Product That WAS at once Bold and Experimental, while Also Extremely versatile. \nNow, 'Ambient Metal Constructions' Combines All Three Volumes into one pack for A Lower price, Containing A Massive selection of construction kits in A Choice of ACID, Apple Loops, REX (drums Only). \nEach kit contains Real Bass and Guitar Loops (rhythm, clean, Atmospheric and Lead), multi sampled Drum Patterns / fills, and synth phrases (arpeggios, pads, lead lines and FX). MIDI data is also included for Ambient Metal Construction 2 and 3 for Producers like WHO to Get into the Nuts and Bolts of Their projects and use Their own Synth sounds. \nThemselves The Guitars Were Recorded using High end processors Modelling Guitar AMP, and Played on Ibanez Prestige instruments, including their monstrous 8 string Guitar - you will not have this sampled Heard Anywhere else. \nAll Synth sounds Were Created from scratch for the Purposes of this pack, with each sound specifically designed for the Theme at Hand. The result is that each kit is set to its own individual soundscape to give it character, cohesion and to inspire the creativity and imagination of the producer seeking a modern edge in their projects.\n\n\nManufacturer : Producerloops \nWebsite : Wav.Rex2. Midi \nQuality : 24-16 bit \nFrequency 44.1 kHz stereo channels \nDescription : Collection of samples for music production in the style of Techno-Metal-Simfo-Rosk-Ambient. ","torrent":{"xt":"urn:btih:0ed54c0f816b6a5f6ef329084ff70279eab8bff8","amp;dn":"Ambient+Metal+Construction%27s+Bundle+Vol.1-3+%28Requested%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ed54c0f816b6a5f6ef329084ff70279eab8bff8","infoHashBuffer":{"type":"Buffer","data":[14,213,76,15,129,107,106,95,110,243,41,8,79,247,2,121,234,184,191,248]},"announce":[],"urlList":[]}}