{"title":"Sakura Wars 5 So Long My Love [PS2] [NTSC] [MULTI2] 2xDVD9","uid":5483860,"size":9183828083,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0f070beefafd97e11f000c383b240b0d9099c049&amp;dn=Sakura+Wars+5+So+Long+My+Love+%5BPS2%5D+%5BNTSC%5D+%5BMULTI2%5D+2xDVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"thenoobish","files":-1,"time":1270588950,"description":"Disc 1 includes the game with Japanese Audio and English subtitles.\n\nDisc 2 includes the game with English Audio.\n\n\nThe first Sakura Wars game to reach North America, Sakura Wars: So Long, My Love takes the franchise to America with the franchise's first story set in America, following a new hero who joins the US version of the Hanagumi. Demons have appeared in New York, and its up to Shinjirou, Gemini Sunrise and a new cast of characters to take them out. The cast serves as performers during the day and warriors when called upon, continuing series tradition.\n\nSakura Wars is a strategy RPG that features a unique sim-based story system. Character interaction plays a major role in a storyline that never follows a set course, and your responses to the various characters in the game can ultimately change the story content and even the final outcome. The battle system is divided into two main parts; ground combat and air combat. Ground combat takes place using two-legged mechanized suits, which transform into jet fighters to take the fight to the sky. Every mech unit in the game can transform from battle mech mode to jet fighter mode during combat.\n\n\nDo you missing a game? Write a comment with the game you want and I will try to upload that game.","torrent":{"xt":"urn:btih:0f070beefafd97e11f000c383b240b0d9099c049","amp;dn":"Sakura+Wars+5+So+Long+My+Love+%5BPS2%5D+%5BNTSC%5D+%5BMULTI2%5D+2xDVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f070beefafd97e11f000c383b240b0d9099c049","infoHashBuffer":{"type":"Buffer","data":[15,7,11,238,250,253,151,225,31,0,12,56,59,36,11,13,144,153,192,73]},"announce":[],"urlList":[]}}