{"title":"WW2 Battles DVD 10 Nordic War NL Subs","uid":9066320,"size":4203937792,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0ff025993e95e4053d7929ab7e803d22a04778e5&amp;dn=WW2+Battles+DVD+10+Nordic+War+NL+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mpkeuter","files":1,"time":1382116507,"description":"WWII\n\nA terrible nightmare called World War II ended 50 years ago. The Nordic countries reacted in five different ways that are debated to this day. Here is some of the background that we tend\nnot to remember and a few of the pictures that are very hard to forget.\n\nIN THE NORDIC COUNTRIES\n\nAlthough Iceland was occupied throughout WWII it probably fared better than the other Nordic countries.\n\nWhen the Germans took Denmark in 1940, British troops moved in to forestall the rumored German plans of turning Iceland into a base for the purpose of harassing the vital seaborne trade between Britain and the US.\n\nIceland with a population of 130 000 did not have an army, nor did it have any compulsory military service.\n\nIceland had been an independent state since 1918 in a union with Denmark. England guaranteed Iceland's independence, but the Danish king could no longer function as Iceland's head of state. The Allting Icelandic Parliament took over and in 1944 Iceland left the union with Denmark.\nIn July 1941, a US Marine brigade of 4 000 men took over the occupation of Iceland from the British so that the 20 000 Brits could help the war-effort elsewhere. Eventually there were almost as many Americans as there were Icelanders on the island.\n\nAlthough the German Luftwaffe did bomb Iceland, it was spared any heavy fighting. Iceland did make big news when a German weather ship was seized off its coast in 1941 and documents about the German &quot;Enigma&quot; master coding machine were found on board, giving the Allied forces a major break.\n\nIceland declared its independence formally in June 1944 and the US withdrew its troops in 1947.\nThe country received some Marshall help after the war and the US remained on the island managing the gigantic Keflavik airport until 1956.\n\nAugust 1939 the Soviet Union and Germany concluded a nonaggression pact with a secret protocol that assigned Finland, the Baltic countries and the eastern parts of Poland to the Soviet Union.\n\nThe Soviets began their assault by demanding a naval base on Finnish territory and other land concessions. The Finns were united in their resistance against Soviet border demands and were already mobilized when the Soviet Union invaded their country on November 30, 1939 with a nasty air attack on Helsinki.\n\nMarshall C.G.E. Mannerheim was appointed Commander-in-Chief of the Finnish defense forces that utilized the severe weather, rugged terrain and a tactic of encirclement of the Soviet troops to halt their offensive. Initially the Finns were able to destroy several division-sized Soviet units and capture large quantities of weapons and ammunition.\n\n\n\nAudio - English\nSubs - NL","torrent":{"xt":"urn:btih:0ff025993e95e4053d7929ab7e803d22a04778e5","amp;dn":"WW2+Battles+DVD+10+Nordic+War+NL+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ff025993e95e4053d7929ab7e803d22a04778e5","infoHashBuffer":{"type":"Buffer","data":[15,240,37,153,62,149,228,5,61,121,41,171,126,128,61,34,160,71,120,229]},"announce":[],"urlList":[]}}