{"title":"Cradle To Grave","uid":13415504,"size":1578658443,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:121707197b6274bcfef64a64f465d394535f8725&amp;dn=Cradle+To+Grave&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7436746","files":9,"time":1454489185,"description":"http://www.imdb.com/title/tt4658612/\r\n\r\nA TV show showing the ups and downs of the well known Danny baker and his friends during childhood.\r\n \nhttp://www.wikiwand.com/en/Cradle_to_Grave\r\n\r\nCradle to Grave is a 2015 British sitcom set around the life of Danny Baker. The show has since been commissioned for a second series following its end in October 2015.\r\n\r\nPlot\r\nIt's 1974 and fifteen year old Danny is our guide through the ups and downs of life with the Baker family. Dad Fred, known to all and sundry as 'Spud' is a proud south London docker with a penchant for rackets, fiddles and schemes, hopefully 'nice and tasty' ones. Wife Bet loves him deeply but longs for the family to go 'straight', and do daft things like pay taxes and put money in the electricity meter instead of always trying to scam it. With eldest daughter Sharon's Wedding looming and the docks facing closure and a switch to the dreaded 'containerisation', putting thousands of dockers out of work, times are challenging. So too are Danny's attempts to get closer to the opposite sex. Full of humour, warmth and drama with an accompanying soundtrack combining songs from the era with material from Squeeze's Chris Difford and Glenn Tilbrook, Cradle To Grave is based on actual events and characters","torrent":{"xt":"urn:btih:121707197b6274bcfef64a64f465d394535f8725","amp;dn":"Cradle+To+Grave","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"121707197b6274bcfef64a64f465d394535f8725","infoHashBuffer":{"type":"Buffer","data":[18,23,7,25,123,98,116,188,254,246,74,100,244,101,211,148,83,95,135,37]},"announce":[],"urlList":[]}}