{"title":"Carnival - A Novel by Rawi Hage","uid":15498324,"size":202904162,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:131663f3e7b7c062bce78018579458d0b371d8f5&amp;dn=Carnival+-+A+Novel+by+Rawi+Hage&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"usparc56","files":6,"time":1470462305,"description":"Carnival\r\nWritten by: Rawi Hage\r\nNarrated by: Wyntner Woody\r\nLength: 8 hrs and 11 mins \r\nUnabridged Audiobook\r\nRelease Date:11-05-13\r\nPublisher: Audible Studios\r\n\r\nA stirring new masterpiece from the IMPAC Dublin Literary Award-winning author of Cockroach and De Niro's Game.\r\nIn Carnival, internationally acclaimed author Rawi Hage takes us into the world of Fly, a taxi driver in a crime-ridden apocalyptic metropolis. Raised in the circus, the son of a golden-haired trapeze artist and a flying-carpet man, Fly sees everything, taking in all of the city's carnivalesque beauty and ugliness as he roves through its dizzying streets in his taxi. Fly is a reader, too, and when he's not in his taxi he is at home in the equally dizzying labyrinth of books that fills his tiny apartment. His best friend is Otto, a political activist who's in and out of jails and asylums, mourning his dead wife and lost foster son.\r\nOn one otherwise tawdry night Fly meets Mary, a book-loving passenger with a domineering husband. So begins a romance that is, for Fly, a brief glimmer of light amid the shadows and grit of the Carnival city. Along with Otto and Mary, Fly introduces us to madmen and revolutionaries, magicians and prostitutes as he picks them up and drops them off, traveling through a nightmarish town that is - we can't help but notice - a parable for our own debauched, unjust world. Wildly imaginative and darkly ironic, Carnival is a magnificent achievement","torrent":{"xt":"urn:btih:131663f3e7b7c062bce78018579458d0b371d8f5","amp;dn":"Carnival+-+A+Novel+by+Rawi+Hage","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"131663f3e7b7c062bce78018579458d0b371d8f5","infoHashBuffer":{"type":"Buffer","data":[19,22,99,243,231,183,192,98,188,231,128,24,87,148,88,208,179,113,216,245]},"announce":[],"urlList":[]}}