{"title":"ChordWizard Software SongTrix Gold v3.01d with Key [iahq76]","uid":7785812,"size":8994303,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1320f20ac7f5750c489031699f2da363e2293cf6&amp;dn=ChordWizard+Software+SongTrix+Gold+v3.01d+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":3,"time":1351889983,"description":"ChordWizard Songtrix Gold\n\nChordWizard Songtrix - a revolutionary platform for musical creativity without looking back. Songtrix support musicians and composers such as flexible and open way, like a word processor supports writers.\n\nAutomatic Styles\n\nWith styles, Songtrix can turn a simple chord sequence into professional arrangements for backing tracks, improvisation practice or rapid composition.\n\nA diverse set of musical styles is supplied, and these can be mixed across tracks for literally millions of style combinations!\n\nYou can use substyles with Intro, Fill-In and Ending patterns to create rich and seamless performances of the finished work.\n\nThe process is flexible and transparent, so you can choose which parts of the song will use styles, and see the musical events that Songtrix generates.\n\nYou can progressively override and customize style events to get exactly the sound you are looking for.\n\nCompose Yourself\n\nSongtrix is also a blank canvas for developing your own musical themes. Use the rich palette of musical events to produce your original compositions or arrangements from scratch.\n\nAudition and select chords from the menu, then design your own rhythms to play them with.\n\nTracks can split into repeating segments to automatically propagate your drum and rhythm patterns throughout the song.\n\nTake full control of the creative process by adding and editing musical events within Songtrix, or with an attached Midi keyboard (or other instrument).\n\nYou can easily apply playing techniques - such as sustain, slide, pitch bend and vibrato - to achieve a stunningly realistic performance.\n\nStaff Notation\n\nSongtrix generates and displays staff notation automatically, continuously and accurately as you work. You can instantly switch between the different views of your song, even during playback.\n\nThis improves your sight-reading skills, and ensures that you can effectively communicate your work to others, regardless of your scoring ability.\n\nSongtrix provides many options for compilation and placement of staff symbols, so your song contains the visual layout of the music as well as the precise performance.\n\nStaff notation can be printed for complete musical scores or for individual parts separately. Other printed formats are also available, such as lyric sheets or lead sheets with lyrics and chords.\n\nSystem Minimum Requirements\n\nWindows\tXP, Vista or 7\nProcessor: Pentium 4 @ 1.5 GHz\nMemory: 512 MB\nDisk Space: 50 MB free\nScreen: 16-bit color, 800x600 resolution\nSound Card: All supported\n\nHomepage: http://www.chordwizard.com/songtrix.aspx\n\nInstallation Instructions:\n\n1. Temporarily disconnect internet.\n2. Install Program, use given key during installation.\n3. Run application, Block program thru firewall to access internet.\n4. Done, Enjoy.","torrent":{"xt":"urn:btih:1320f20ac7f5750c489031699f2da363e2293cf6","amp;dn":"ChordWizard+Software+SongTrix+Gold+v3.01d+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1320f20ac7f5750c489031699f2da363e2293cf6","infoHashBuffer":{"type":"Buffer","data":[19,32,242,10,199,245,117,12,72,144,49,105,159,45,163,99,226,41,60,246]},"announce":[],"urlList":[]}}