{"title":"Eg and Alice - 24 Years of Hunger [1991][EAC,log,cue. FLAC]","uid":8145240,"size":307600599,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1441f4bf56cab507e8f287d08b6b961daf4414f6&amp;dn=Eg+and+Alice+-+24+Years+of+Hunger+%5B1991%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":24,"time":1360901036,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: Release: 24 Years of Hunger\nMusicBrainz: 459290bf-1d22-4a3b-b124-580d13befd24\nReleased: 1991\n\nTracklisting:\n\n01. Rockets (05:36)\n02. In a Cold Way (04:30)\n03. Mystery Man (03:46)\n04. And I Have Seen Myself (03:47)\n05. So High, So Low (04:55)\n06. New Year's Eve (06:21)\n07. Indian (03:48)\n08. Doesn't Mean That Much to Me (06:07)\n09. Crosstown (04:47)\n10. IOU (03:51)\n11. I Wish (04:30)\n\n24 Years of Hunger is an atypical effort from an almost frustratingly enigmatic duo. Recorded by the pair when they were mere twentysomethings, and predominantly in Eg White's home, it is nevertheless about as grown-up and elegant as pop music gets.\n\nA decade after the recording had all but vanished from circulation, rainsound.net had taken to calling it &quot;one of the classic albums of the '90s,&quot; while Q magazine went a step further when it placed the record on its list of best albums of the 20th century, describing it as having &quot;the class of Steely Dan and the intriguing detachment of the Blue Nile.&quot; One could also cite Tears for Fears and the pop/jazz hybrids of Breathe (&quot;Hands to Heaven,&quot; &quot;How Can I Fall&quot;) and Johnny Hates Jazz (&quot;Shattered Dreams&quot;) here, but the valid Steely Dan remark already attests to the esteem in which it is held in critical circles. It is praise richly deserved.\n\nThe music is so fusion-smooth and genteel (almost to the point of somnolence) that it probably could even soothe the savage Muzak fan or tame the more tempestuous of Quiet Storms, yet it shares few things with those ignominious genres aside from some of the superficial features (sleekness, polish, urbanity, effortlessness), and it entirely avoids the blandness. In fact, 24 Years of Hunger churns and roils on a much deeper emotional level. Once the songs seduce you with their surface sensualities, they begin to work in ways that are often viscerally, unexpectedly jarring.\n\nAs far as the comparison to Steely Dan goes, it works in two directions. Both artists borrowed liberally from the jazz idiom, and like Becker &amp; Fagen, Eg &amp; Alice's music has bite, but the bite has nothing whatsoever to do with resentment or cynicism and everything to do with the sting of love. The duo's sound, also in contrast, draws significantly from urban soul. Instead of settling into cheekiness or exposing what could be an off-putting cleverness, their songs throb with passion and romantic tension, always understated but nevertheless present.\n\n24 Years of Hunger works just as much on the heart as it does on the brain, and it stands poised to become one of the classic lost albums of the decade.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:1441f4bf56cab507e8f287d08b6b961daf4414f6","amp;dn":"Eg+and+Alice+-+24+Years+of+Hunger+%5B1991%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1441f4bf56cab507e8f287d08b6b961daf4414f6","infoHashBuffer":{"type":"Buffer","data":[20,65,244,191,86,202,181,7,232,242,135,208,139,107,150,29,175,68,20,246]},"announce":[],"urlList":[]}}