{"title":"Paolo Rossi - Canzonacce TQMP","uid":4894034,"size":394277235,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:168621210e3e0b2475e005e0194a0e6fae109cad&amp;dn=Paolo+Rossi+-+Canzonacce+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":25,"time":1242174487,"description":"Ok, let's take a break from all that jazz don't you jazzers worry, there's still a lot to up here\n\nWarning\nHere is one for the Italians only. Not for the reasons of the language only. Paolo Rossi is an actor, song author and a satirist, so one have to know a great deal about Italian daily life, politics and sports and the connection between to understand all the &quot;subtones&quot; in his lyrics. This one is from 1993, so I guess it might not be even for all Italians...\nAnd yes, my grandparents were from Italy, so I was spending a lot of time there during the summer vacations every year...Italian became my second mother language...and Paolo Rossi one of my favourite performers!\n\nPaolo Rossi (Monfalcone, 22 giugno 1953) ÃƒÂ¨ un attore, cantautore e comico italiano.\nSi trasferisce a Ferrara dove vive l'adolescenza e si diploma in perito chimico, ÃƒÂ¨ Milanese d'adozione, Paolo Rossi spazia da trent'anni dai club ai grandi palcoscenici, dal teatro tradizionale al cabaret, dalla televisione al tendone da circo: ÃƒÂ¨ caratterizzato dal suo personale modo di &quot;fare spettacolo&quot; che, pur immergendosi appieno nelle tematiche dell'oggi, non prescinde mai dall'insegnamento dei classici antichi e moderni, da Shakespeare a MoliÃƒÂ¨re a Bertolt Brecht, alla amatissima commedia dell'Arte.\n\nCanzonacce e fatto nel suo stile, ironico, allegro e divertentissimo !\nBuon ascolto!\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n :-)\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health","torrent":{"xt":"urn:btih:168621210e3e0b2475e005e0194a0e6fae109cad","amp;dn":"Paolo+Rossi+-+Canzonacce+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"168621210e3e0b2475e005e0194a0e6fae109cad","infoHashBuffer":{"type":"Buffer","data":[22,134,33,33,14,62,11,36,117,224,5,224,25,74,14,111,174,16,156,173]},"announce":[],"urlList":[]}}