{"title":"Paul Horn","uid":3642198,"size":707287680,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1761bb60452f3f7bacd6615f9f1bb25c5ebb0192&amp;dn=Paul+Horn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2012","files":197,"time":1174282076,"description":"Paul Horn has recorded over forty albums during an illustrious career that has spanned four decades. Horn earned his Bachelor of Music degree at the prestigious Oberlin Conservatory of Music in Ohio, followed by his Master&amp;#039;s degree at the Manhattan School of Music in New York. After a stint in the Army, he briefly played in the Sauter-Finegan big band in New York, then toured and recorded with the famed Chico Hamilton Quintet. \n\nBy the early sixties Horn had moved to Los Angeles and formed his own band, the Paul Horn Quintet. In addition to fame as a jazz musician, he was in demand as a session musician and recorded with such legendary figures as Duke Ellington, Frank Sinatra, Nat King Cole, Chick Corea, Buddy Rich, Quincy Jones, Joni Mitchell and Ravi Shankar. \n\nIn 1965 he earned two GrammyÂ® Awards with Lalo Shifrin for Jazz Suite on the Mass Texts and was nominated again in 1988 for Traveler in the New Age Music category. \n\nIn 1966 Horn began a seach for spiritual fulfillment and became involved with Transcendental Meditation, studying with Maharishi Mahesh Yogi. He travelled several times to India as part of this journey. In 1968 he made a solo flute recording at night in the Taj Mahal and released an album called Inside (The Taj Mahal). This recording would sell more than 1,000,000 copies and became the seminal album for the musical genre known as new age music. \n\nThe Taj Mahal experience led to a series of recordings in extraordinary places: Inside the Great Pyramid (Giza, Egypt), China (two tracks in the Temple of Heaven, Beijing), Inside the Cathedral (Kazamieras Cathedral, Lithuania) and this recording Inside Canyon de Chelly. \n\nHorn&amp;#039;s music, especially in more recent years, reflects his personal and spiritual quests and goes beyond entertainment or aesthetics. In his autobiography, Inside Paul Horn: The Spiritual Odyssey of a Universal Traveler, Horn writes, &quot;Music creates positive bonds among peoples and nations and cultures...music is the universal language precisely because it touches us at that deep essential, universal level. It has a unifying and healing power.&quot; \n","torrent":{"xt":"urn:btih:1761bb60452f3f7bacd6615f9f1bb25c5ebb0192","amp;dn":"Paul+Horn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1761bb60452f3f7bacd6615f9f1bb25c5ebb0192","infoHashBuffer":{"type":"Buffer","data":[23,97,187,96,69,47,63,123,172,214,97,95,159,27,178,92,94,187,1,146]},"announce":[],"urlList":[]}}