{"title":"The Wire By: Sherryl Vint","uid":8973650,"size":3526869,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18a1dbe7d7b0a472f680afa2df92d77bb6b2b364&amp;dn=The+Wire+By%3A+Sherryl+Vint&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"livhre","files":-1,"time":1380386249,"description":"Frequently described by creator David Simon as a novel for television, The Wire redefined the police serial format by unfolding its narrative across many episodes, constructing themes for each of its seasons, and refusing to portray individual crimes outside of their social context. While it never achieved spectacular ratings or won an Emmy during its 2002-2008 run on HBO, the show was honored with several awards and has been described by critics as the best show on television. In this volume, author Sherryl Vint takes a close look at several episodes of The Wire to argue that the series challenges our understanding of the relationship between entertainment and social critique. Informed by recent work on race, poverty, and the transformation of the American inner city through neoliberalism, Vint provides a compelling analysis of The Wire in four chapters. First, she examines the season 1 episode &quot;The Buys&quot; as an example of the ways in which The Wire diverges from the police procedural format. She continues by considering season 2's &quot;All's Prologue&quot; and season 3's &quot;Middle Ground&quot; to explore in more detail The Wire's critique of the exclusions of the capitalist economy. In the final two chapters, she looks at &quot;Final Grades,&quot; the fourth season finale, to highlight the problems with institutional inertia and show both the need for and barriers to reform, and uses the season 5 episode &quot;Clarifications&quot; to consider the failure of the media to adequately reflect the social issues depicted in The Wire. One of the landmark series of recent television history, The Wire is ripe for research and discussion. Fans of the series and those interested in social commentary and the media will appreciate Vint's new analysis in this volume.","torrent":{"xt":"urn:btih:18a1dbe7d7b0a472f680afa2df92d77bb6b2b364","amp;dn":"The+Wire+By%3A+Sherryl+Vint","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18a1dbe7d7b0a472f680afa2df92d77bb6b2b364","infoHashBuffer":{"type":"Buffer","data":[24,161,219,231,215,176,164,114,246,128,175,162,223,146,215,123,182,178,179,100]},"announce":[],"urlList":[]}}