{"title":"Neil Innes / The Innes Book of Records / Series 3 Disc 2","uid":8943697,"size":3545373370,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:18e22ae30f6bdfde2274a0dc85c4c746faf596a2&amp;dn=Neil+Innes+%2F+The+Innes+Book+of+Records+%2F+Series+3+Disc+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":63,"time":1379724021,"description":"&quot;Songs and pictures about people and things&quot;\n\nNeil Innes is a semi-legendary British singer/songwriter known for his work with Monty Python, The Rutles, The Bonzo Dog (Doo Dah) Band, and on Rutland Weekend Television. He appears with the Bonzo Dog Band in the Beatles film Magical Mystery Tour, and in various Monty Python films, albums and projects. He composed and performed new songs in the style of the Beatles for Eric Idle's film &quot;The Rutles: All You Need is Cash,&quot; and played Ron Nasty. The Rutles reunited in 1997 for the &quot;Archaeology&quot; album.\n\nThe Innes Book of Records was Neil Innes' BBC2 TV series from 1979 to 1981, lasting eighteen episodes over three series. It was originally shown in the UK and Australia and then rerun occasionally over the next 20 years on UK Gold (with several songs always cut out and episode contents in the wrong order.)\n\nNeil Innes' music is comedic and serious, wistful and nostalgic, old-fashioned yet spanning many different musical genres. Neil has a particular gift for pastiche, mimicking the style of another musical artist, which served him well on Eric Idle's post-Monty Python comedy series, Rutland Weekend Television. &quot;Concrete Jungle Boy&quot; was written in the style of The Who, and &quot;Godfrey Daniel&quot; in the style of Elton John. His own style of music is equally fascinating, and his lyrics consistently witty and original.\n\nHis own television series is a work of art, quite unlike anything you'd normally see on television.\n\n&quot;The Innes Book of Records is not intended to be up-front comedy. It's not anarchic in any way, nor is it particularly satirical. It's literally trying to compose pictures with sound, taking both elements and making them work together.&quot; - Neil Innes, 1979\n\n&quot;The trend at the time was to have two tall stools and a guest and thousands of light bulbs and you'd sing a duet or something. Horrible. And I said what I really miss is the interlude. They used to have an interlude on BBC Television where you'd watch swans going up and down for about ten minutes. Because they had no programming. Or the potter's wheel; the potter would throw a pot, you know, and it would just be some music. We're missing that, I said. Let's have a program that does that, and we'll make it a show about, um ... songs and pictures about people and things.&quot; - Neil Innes, 2011.\n\n\nThis DVD contains three episodes from the third series of The Innes Book of Records.\n\nAdditional clips from Youtube are included in the DVD_ROM folder.\n\nThese episodes are edited together and restored from various sources, mostly high-quality Youtube uploads from the master tapes.\n\nA further disc of Innes Book of Records clips can be purchased as part of a CD box set at Neil Innes' website.\n\n\n\n\n--\n\n\nEpisode 14  \nOriginal air date: 5 October, 1981\n\nNow She's Left You, Cat Meat Conga, John Cooper-Clarke (Evidently Chickentown), One Thing On Your Mind, Spaghetti Western, Godfrey Daniel\n\nPerformed, Written and Composed by:\nNeil Innes\n\nProducer/Director: Ian Keill\n\nMusical Director &amp; Arrangements: John Altman\n\nGuests: John Cooper-Clarke, Bobby George, The St. Ives Operatic Society, Julie Legrand, Nicola Brooks, David Shaw\n\n\n--\n\nEpisode 16  \nOriginal air date: 19 October, 1981\n\nLibido, Lady Mine, 9 to 5 Pollution Blues, Stoned on Rock, Mother\n\nPerformed, Written and Composed by: Neil Innes\n\nDirected by Andrew Gosling\n\nProducer: Ian Keill\n\nMusical Director and Arrangements: John Altman \n\nGuests: Lorien Stoyell, Ros Cocks, John Oakden, Teddy Cocks, Phil Rowley, Dennis Dowrick, &amp; Andrew Reynold\n\n\n\n--\n\nEpisode 18  \nOriginal air date: 9 November, 1981\n\nConcrete Jungle Boy, Time to Kill, Stanley Unwin (Mastermind), Frontloader, D.I.S.C.O. (by Ottawan, danced by the Newlyn Rugby Football Club), Mississippi Moon, Tinsel and String\n\nPerformed, Written and Composed by: Neil Innes\n\nDirected by Andrew Gosling\n\nProducer: Ian Keill\n\nMusical Director &amp; Arrangements: John Altman\n\nGuests: Stanley Unwin, The Penzance and Newlyn Pirates Rugby Football Club, Karen Foley, David Shaw, Joan Beaghen, Magda Sumray\n","torrent":{"xt":"urn:btih:18e22ae30f6bdfde2274a0dc85c4c746faf596a2","amp;dn":"Neil+Innes+%2F+The+Innes+Book+of+Records+%2F+Series+3+Disc+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18e22ae30f6bdfde2274a0dc85c4c746faf596a2","infoHashBuffer":{"type":"Buffer","data":[24,226,42,227,15,107,223,222,34,116,160,220,133,196,199,70,250,245,150,162]},"announce":[],"urlList":[]}}