{"title":"12 Angry men (widescreen edition) multisubs","uid":5152593,"size":685599342,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1a819f8ec94c062573fd538813a6665603feb114&amp;dn=12+Angry+men+%28widescreen+edition%29+multisubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrizzo2","files":-1,"time":1257644863,"description":"Note: Our modem will be undergoing an upgrade sometime tommorrow in the evening (UK time). We'll be down for about an hour during the changeover. merci\n\nIn English, subtitles are included in German, French, English (for the\nhearing impaired) Spanish, Portuguese, Dutch and Swedish. The first two\nmentioned above are also DivX embedded, while all have srt subtitle files\nseparately available in the subtitles folder included on this torrent.\n\nReal lovely picture quality and great sound too.\n\n12 Angry men is one of the most important courtroom/juryroom dramas\never to come out of the United states. The question presented to us\nin this great movie offerings is this: Is there justice in the level\nof discourse that is being offered. Is the articulation on the issues\nin fact valid or is it semantic like argument on feigns of dubious\nvalidity. If a case appears as it should: &quot;open and shut&quot; - is that\nreason enough to start to discount it? Should you decide that everything\nthat could go the other way hypothetically, no matter how remote the\npossibility, that should be the order of the day of a particular brand\nof &quot;more pure&quot; justice? Should the prejudices carried by members of the\njury or testifying witnesses be reason enough to negate and retard their\ntestimony? should they be required as jury members to vote the other side\ninstead? The OJ Simpson criminal trial contained all of these elements\nin the minds of those who assembled not too long ago on a PBS panel inquiry\nheaded by talkshow host Mr. Charlie Rose. The ownership of property in and of\nitself should never be sufficient qualification to sit on a jury to decide\nthe fate of members of the community. Instead, a sound grounding in values\nthat are humanistically pure and demonstrably so, combined with sound reasoning\nskills and experience in the proper and right application of legal principles\nthat come from this sound philosophical basis should rule, and be the\nrequirement.\n\nSo a panel of judges perhaps, appointed on more than their connections within\nlegal circles as it presently is comprised, rather on an open contest in which\nreal votes for merit may be clearly exercised in the protection of all.\n\nOtherwise, we could someday die for no other reason than a lack of restraint in\nthe environment caused by a complete breakdown in the expectation of justice\nbased on jury members that are nothing more than proxies for those that would\ninflict their own brand of justice instead. The OJ Simspon affair should raise\njust such alarm bells as the second trial rightly pointed out, however it came\ntoo late to impose penalties to fit the crime - financial constraints that were\nimposed subsequently on the defendant could hardly be deemed sane enough for\nanyone that was looking in at the situation in objective fashion unable to do\nnothing but &quot;shake their heads&quot; in amazement that this could go on without a\npublic scream that should never end until the righter outcome is seen through\ninstead.\n\nMichael Rizzo Chessman\nPlease see my movie reviews at moviesbyrizzo.info","torrent":{"xt":"urn:btih:1a819f8ec94c062573fd538813a6665603feb114","amp;dn":"12+Angry+men+%28widescreen+edition%29+multisubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a819f8ec94c062573fd538813a6665603feb114","infoHashBuffer":{"type":"Buffer","data":[26,129,159,142,201,76,6,37,115,253,83,136,19,166,102,86,3,254,177,20]},"announce":[],"urlList":[]}}