{"title":"The Real Lincoln (by Thomas J. DiLorenzo)","uid":7484499,"size":8744241,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1aa5c7ef7298c5de25f3087f3a1fb6781e89a5ff&amp;dn=The+Real+Lincoln+%28by+Thomas+J.+DiLorenzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Leobons8","files":1,"time":1343537638,"description":"&quot;I am not, nor ever have been, in favor of bringing about in any way the social and political equality of the white and black races, that I am not nor ever have been in favor of making voters or jurors of negroes, nor of qualifying them to hold office, nor to intermarry with white people; and I will say in addition to this that there is a physical difference between the white and black races which I believe will forever forbid the two races living together on terms of social and political equality. And in as much as they cannot so live, while they do remain together there must be the position of superior and inferior, and I as much as any other man am in favor of having the superior position assigned to the white race&quot; (1958 Lincoln Douglas debates)\n\n&quot;I have no purpose, directly or indirectly, to interfere with the institution of slavery where it exists. I believe I have no lawful right to do so, and I have no inclination to do so.&quot; (1st Inaugural Address, March 4, 1861)\n\n&quot;If I could save the Union without freeing any slave I would do it, and if I could save it by freeing all the slaves I would do it; and if I could save it by freeing some and leaving others alone I would also do that. What I do about slavery, and the colored race, I do because I believe it helps to save the Union; and what I forbear, I forbear because I do not believe it would help to save the Union.&quot; (Letter to Horace Greeley, August 22, 1862)\n\nSmashing the Lincoln myth by his own words. This book is vital to unlearn all the propaganda your 7th grade teacher told you.\n\nEND THE FED\n\n-by Tom L.","torrent":{"xt":"urn:btih:1aa5c7ef7298c5de25f3087f3a1fb6781e89a5ff","amp;dn":"The+Real+Lincoln+%28by+Thomas+J.+DiLorenzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aa5c7ef7298c5de25f3087f3a1fb6781e89a5ff","infoHashBuffer":{"type":"Buffer","data":[26,165,199,239,114,152,197,222,37,243,8,127,58,31,182,120,30,137,165,255]},"announce":[],"urlList":[]}}