{"title":"Sadma 1983 Hindi DvDRip H.264@fairlove","uid":6708820,"size":748407837,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1bdd95ff27a2fb4cf5d44448eee7b13daf3199f0&amp;dn=Sadma+1983+Hindi+DvDRip+H.264%40fairlove&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fairlove","files":2,"time":1317278386,"description":"Sadma (1983) hindi movie is the story of an idealistic young man Somu (Kamal Haasan) who rescues an amnesiac young girl, Reshmi (Sridevi), from a brothel and takes charge of her life. She has the mental age of a five year old and her parents are looking all over for her. Reshmi gets in and out of trouble. Somu has to deal with her pranks and misdemeanors. He is pursued by the very sexy young wife (Silk Smitha) of his boss. Eventually the amnesia will go away - we have been told that it is just a matter of time.\n\nBut when memory returns will the memories of Somu fade from Reshmi's mind? What can one say about Kamal? The man wrote the book on acting. Here he is young, very good looking and absolutely perfect as the idealistic school teacher who decides to rescue a girl in trouble. Stalked by Silk Smitha, he also get ample opportunity to flex his dancing skills in a fantasy item number! Sridevi is very good as the five year old trapped in a young woman's body. \n\nShe has the expressions and gestures down pat. Maybe there is exaggeration in the acting, but I can see her as a hyperactive 5 year old. Then she provides a perfect contrast as the young woman who wakes up from this nightmare. Silk Smitha has ooomph in ample measure and there is also an ampleness to her. One wonders how good some of today's anorexic leading ladies would look with those curves! The ultimate tragedy of the film leaves one in shock and mourning for what could have been while at the same time Reshmi's return to normalcy is celebrated.\n\nThe film is well directed and the camera work is extremely beautiful. Kamal still has traces of his South Indian Hindi accent, but is miles ahead of his Ek Duje ke Liye days. All in all this is a very satisfying cinema experience. Yes you will be saddened by the story but the beauty of the film is a joy that must be experienced.","torrent":{"xt":"urn:btih:1bdd95ff27a2fb4cf5d44448eee7b13daf3199f0","amp;dn":"Sadma+1983+Hindi+DvDRip+H.264%40fairlove","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bdd95ff27a2fb4cf5d44448eee7b13daf3199f0","infoHashBuffer":{"type":"Buffer","data":[27,221,149,255,39,162,251,76,245,212,68,72,238,231,177,61,175,49,153,240]},"announce":[],"urlList":[]}}