{"title":"Connectix Virtual PC 5 for OS2 &amp; eCS","uid":4002898,"size":10490944,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:1c57734f3f50168fd49a38ded3499675286c0c51&amp;dn=Connectix+Virtual+PC+5+for+OS2+%26+eCS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blandreth","files":2,"time":1201656318,"description":"\n              Connectix Virtual PC 5 for OS/2\n              ===============================\n\n(C) 2001-2002 InnoTek Systemberatung GmbH\n(C) 1988-2002 Connectix Inc.\n\n\n!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n!!!                I M P O R T A N T\n!!!\n!!! Virtual PC 5 contains significant enhancements which\n!!! possibly require user interaction when migrating guest\n!!! images from a previous version. Please read the\n!!! following information very carefully.\n!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n\n1. Overview\n-----------\n\nVirtual PC for OS/2 allows you to run additional operating\nsystems on top of your OS/2 system. It is based on\nVirtual PC by Connectix Corporation, delivering the most\nadvanced virtualization technology available.\n\nFor general information about how to install, configure\nand use the product, please refer to the documentation on\nthe CDROM. This document will provide technical\ninformation that is not mentioned in the manual and\ntypically more up to date. It also lists the currently\nknown problems with the product and possible solutions.\n\n\n2. Prerequisites\n----------------\n\n2.1 Hardware\n------------\n\n2.1.1 CPU\n---------\n\nVirtual PC supports Athlon, Duron, Celeron, Pentium II,\nPentium III and Pentium 4 CPUs with at least 400MHz\n(600MHz recommended).\n\nDue to the plethora of problems with OS/2 on SMP and\nvery different hardware behavior, we officially do not\nsupport SMP. We have tried our best to make the software\nwork well on SMP but it is impossible to guarantee\nsmooth operation on SMP systems.\n\n2.1.2 Memory\n------------\n\nVirtual PC allocates memory for the guest operating system\nthat will not be available to the host system and\napplications while the guest system is running. The amount\nof memory can be assigned by the user and is usually\ndetermined by the type of guest operating system. In a\ntypical configuration with a Windows 2000 guest, one would\nassign 96MB of RAM to the guest and therefore require to\nhave 96MB in addition to what is needed for sufficient\nperformance for the host OS/2 and its applications. Note\nthat the memory assigned to a guest is physically\nallocated and cannot reside in the swapper file.\n\n\n2.2 Software\n------------\n\n2.2.1 Base Operating System\n---------------------------\n\nVirtual PC for OS/2 is only supported on a Convenience\nPack level of OS/2 (MCP1, MCP2, ACP1, ACP2) and\nWorkSpace On-Demand 2.0 with Fixpack 16. It has been\ntested with earlier versions of OS/2 (Warp 4 FP8 and\nhigher) and no problems could be identified. However,\nsuch configurations are not officially supported by\nInnoTek.\neComStation by Serenity Systems is also supported.\nWarp 3 is not supported at this time.\n\n2.2.2 Graphics Driver\n---------------------\n\nVirtual PC for OS/2 is very graphics intensive and\nsensitive to graphics driver issues. InnoTek recommends\nusing Scitech Display Doctor - either the retail version\nfrom Scitech or the OEM version SDD/se from IBM. Using any\nother driver can cause severe problems.\nVirtual PC for OS/2 is optimized for GRADD based display\ndrivers. However, InnoTek is very interested in getting\nfeedback on user experiences with other display drivers.\nThis allows us to selectively look at supporting Virtual\nPC with other display drivers based on user demand.\n\nUnless your graphics driver supports hardware color\ncursors (the vast majority of OS/2 graphics drivers\nincluding Scitech don&amp;#039;t), make sure you only use\nmonochrome (black &amp; white) mouse cursors. Using non\nmonochrome mouse cursors will lead to display\ncorruptions inside the Virtual PC window.\n\n2.2.3 TCP/IP\n------------\n\nVirtual PC for OS/2 requires a 32bit level of the TCP/IP\nstack. This means that the command &quot;inetver&quot; needs to\nreturn a level of 6.x. OS/2 versions past Warp 4 come with\na 32bit IP stack. For Warp 4, you need to update your MPTS\nto level WR8620 or later.\nRefer to the usual IBM fixpak sites to download these\nupdates.\n\n\n3. Installation\n---------------\n\n3.1 Update Installation\n-----------------------\n\nThe installer can update an existing installation of\nVirtual PC for OS/2. All your settings and virtual\nmachines will be preserved. However, you have to shut\ndown all virtual machines prior to installing the\nupdate. If there are virtual machines in the saved\nstate mode (i.e. they have been suspended), the saved\nstates will be lost after the update. This will\ncorrespond to pulling the power plug of a desktop PC\nwhile it is running and the same risks apply.\n\n3.2 Unattended Installation (CID)\n---------------------------------\n\nVirtual PC for OS/2 fully supported unattended\ninstallations based on the CID method. For detailed\ninformation about how to do an unattended installation of\nVirtual PC, please refer to the manual.\n\n3.3 Workspace on Demand\n-----------------------\n\nVirtual PC for OS/2 bas been certified on IBM\nWorkSpace On-Demand. Note that the hardware and software\nrequirements also apply for WSOD clients.\nTo obtain more information for how to perform an\ninstallation in a WSOD environment, please contact\nInnoTek Support.\n\n3.4 Virtual PC keyboard monitor\n-------------------------------\n\nVirtual PC comes with a keyboard monitor driver\n(vpckbmon.exe) that can be installed to CONFIG.SYS to\nallow Virtual PC to intercept certain OS/2 system key\ncombinations (Ctrl-Esc, Alt-Esc, Alt-Tab, C-A-D). It\ncan be selected during installation. The keyboard\nmonitor will be active when a virtual machine receives\ninput focus and can be configured through the Virtual\nPC preferences.\n\nNote that the Virtual PC keyboard monitor might not\nbe compatible with certain other keyboard monitors.\nMost often, you find keyboard monitors in remote\ncontrol applications like PolyPM/RSM, NetOp, Tivoli,\netc. In case you experience system hangs starting\nVirtual machines or using your remote control\napplication, it is recommended to remove either the\nremote control application or the Virtual PC\nkeyboard monitor. This can be achieved through the\nVirtual PC Setup application.\n\n3.5 Full Screen Mode\n--------------------\n\nLimited support for running guest operating systems in\nfull screen mode has been added to Virtual PC for OS/2.\nThe full screen mode will always run at the current OS/2\nresolution and color depth. If the guest operating\nsystems supports automatic resolution changing and the\nVirtual PC Additions have been installed (most versions\nof Windows), the guest will either be centered or\nresized to the OS/2 resolution when switching to\nfull screen mode. This depends on the File-Preferences-\nFull Screen Mode setting (Adjust guest to match host\nwill resize the guest).\nFull support for full screen including changing the\ncolor depth and resolution on the fly is not\navailable right now due to missing OS/2 functionality.\n\n3.6 Guest Image Migration from Virtual PC 4.x\n---------------------------------------------\n\nVirtual PC 5 contains significant enhancements since\nversion 4.x. Using several patent-pending technologies,\nVirtual PC 5 is able to reduce the performance penalty\nof a virtual machine compared to a physical machine\nto less than 5% in most situations.\nThese enhancements come along with several changes in\nthe virtual hardware. For Windows guests, this means\nthat a hardware redetection will be performed\n(Windows 9x, Me, 2000, XP).\nFor Windows 2000 and XP guests, it is possible that\nafter the update, they will boot in VGA resolution\nand the keyboard and mouse will not function. This\ncan be solved by resetting the VM and before Windows\nis booting, selecting &quot;PC - Install/Update Additions&quot;.\nIt is also possible to use F8 to boot the Windows\nsafe mode.\nTo experience the significant performance enhancements\nthat have been made for Windows NT, 2000 and XP, it is\nrequired to update the guest Additions to the level\nprovided with Virtual PC 5 (10.x).\nFor Windows NT guests, it is required to remove the\nDEC 21041 network card and install the driver for the\nDEC 21140 card. This requires access to the Windows\nNT installation media.\n\n\n4. List of Changes\n------------------\n\n2002-09-26: Version 5.0 Build 350\n\n- based on the latest Connectix Virtual PC 5.0 with\n  significant performance enhancements and fixes:\n\n  - substantial improvements in performance and speed\n  - CPU resource control allows user command of CPU\n    usage\n  - ACPI support increases compatibility with imported\n    or exported PC disk images using technologies such\n    as Norton Ghost or PowerQuest Drive Image\n  - increased RAM support - user can assign up to 1 GB\n    RAM per virtual machine\n\n- implemented limited fullscreen support\n\n- improved virtual machine scheduling by making the OS/2\n  kernel schedule in 8ms instead of 32ms (temporary\n  time critical thread)\n\n- fixed installer to always update Virtual Switch to the\n  current level\n\n- enhanced installer to be fully CID compliant with\n  CID return codes\n\n- display warning in installer if DIVE subsystem is not\n  present (DIVE.DLL and SSMDD.SYS)\n\n- added bldlevel information to all binaries\n\n- added vpcsetup.exe /tweakvpc to access undocumented\n  configuration options (use at your own risk!)\n\n- disable use of OS2CDROM.DMD ASPI pass-through by\n  default to workaround issues with Adaptec SCSI drivers\n\n- fixed startup delay when HOSTNAME was not set and\n  DNS could not be contacted\n\n- fixed system hang after crashes of VPC (which\n  hopefully never happen in the first place!)\n\n- fixed various synchronization issues with RAM\n  semaphores\n\n- fixed synchronization issues for SMP systems\n\n- improved latencies in sound support (still disabled\n  by default and unsupported)\n\n- fixed potential system hang when minimizing VPC\n\n- fixed mouse handling without mouse pointer integration\n\n- increased directory listing performance with\n  Shared Folders\n\n- fixed handling of files and directories containing\n  special characters (e.g. umlauts) with Shared Folders\n\n- improved reliability of COM port handling\n\n- fixed traps in vpcapp.sys when assigning large amounts\n  of RAM to a virtual machine\n\n- added tweak to autohide mouse cursor when painting in\n  the guest screen to work around screen corruption\n  with software mouse cursors (will cause flicker)\n\n- added support for German, French, Japanese, Italian\n  and Spanish as user interface languages\n\n- fixed codepage translation issues with Shared Folders\n\n- fixed PMMERGE resource leak\n\n- several other minor bug fixes...\n\n2002-07-12: Version 4.3.2\n\n- based on the latest Connectix Virtual PC 4.3.2\n  version with numerous enhancements and fixes\n\n- added keyboard monitor component to allow OS/2 hotkey\n  handling in guest window (Ctrl-Esc, Alt-Esc, Alt-Tab,\n  C-A-D)\n\n- vpcapp.sys no longer requires KEE, making it possible\n  to install Virtual PC on OS/2 Warp 4 FP8 or higher\n  (note that this is not supported by InnoTek)\n\n- fixed several traps in vpcapp.sys when assigning more\n  than 160MB RAM to a virtual machine\n\n- added support for SMP systems. Virtual PC no longer\n  binds to the second CPU.\n\n- moved user specific settings to the HKCU registry tree\n  (automatic conversion to preserve configuration)\n\n- fixed excessive DLL lookup (uxtheme.dll)\n\n- fixed CDROM handling\n\n- fixed audio CD playback\n\n- fixed slowdown on systems without CDROM\n\n- file dialog now remembers last directory\n\n- fixed window deactivation on minimize\n\n- fixed drop down combobox handling\n\n- fixed VM listbox flickering when running more than\n  one VM\n\n- fixed creation time off by 1h issue for Shared Folders\n\n- fixed infinite loops with certain dialog accelerators\n\n- fixed keyboard accelerators for dialog controls (pressing\n  a push button with the space bar did not work)\n\n- set maximum container file size to 2GB by default (used\n  to be unrestricted for JFS and UDF)\n\n- fixed parallel port handling. VPC now queries OS/2\n  Resource Manager for parallel port settings to support\n  non standard LPT IO ports.\n\n- implemented full support for DVD media. This requires\n  the May 2001 level of IDEDASD (included with Virtual PC)\n  Note that SCSI drives are not supported.\n\n- improved COM port handling\n\n- fixed several problems with the Shared Folders file\n  dialog\n\n- implemented performance improvements due to better\n  multithreading\n\n- fixed Novell Netware small Ethernet frame handling\n\n- fixed wave playback and recording\n\n- prevent Virtual PC from growing virtual hard drives\n  beyond 2GB - even on JFS and UDFS. Instead, split files\n  will be created.\n\n2002-03-31: Version 4.2 General Availability\n\n- initial public version\n\n\n5. Known Problems\n-----------------\n\n- due to problems with several sound chips, sound support\n  has been disabled in this version of the product. It\n  might be reenabled in a future release. Note that this\n  is not a problem with Virtual PC but rather a problem\n  with many OS/2 sound drivers not being able to handle\n  small buffers. Especially the current Crystal sound\n  drivers are very problematic. The ESS PCI sound drivers\n  lead to constant system hangs after running VPC for\n  about 30-45 minutes.\n  Note that there is an undocumented way of enabling sound\n  support in this version of Virtual PC. For more\n  information, refer to the product support site.\n\n- Virtual Hard Disks (VHD) that map a physical partition\n  or drive are not supported in version. This might be\n  available in a future version of the product.\n\n- when using a OS2CDROM.DMD lever earlier than May 2001,\n  reading multi-session CDROMs and DVDs is not possible.\n\n- when using the Additions software with mouse pointer\n  integration and using colored mouse pointers, the mouse\n  cursors will automatically be converted to black &amp;\n  white. This is due to the vast majority of OS/2 display\n  drives (including SDD) not supporting hardware color\n  cursors. This is not an OS/2 or Virtual PC limitation.\n  You should urge your display driver manufacturer to add\n  support for hardware color cursors. If SDD supports\n  colored cursors, we will allow using colored cursors\n  in a future version of the product.\n\n- when using the Styler/2 desktop enhancer, the system\n  might hang with mouse pointer integration. The\n  solution is to uninstall or disable Styler/2.\n\n- when using Shared Networking, TCPBEUI (NETBIOS over\n  TCP/IP) is not supported. This will be fixed in a future\n  version of the product.\n\n- using VHD files that are larger than 2GB will not work\n  with this version. This is due to a change preventing\n  VHD files growing over 2GB. The change was made\n  because OS/2&amp;#039;s handling of files &gt; 2GB is very limited\n  and often causes problems. In order to continue to use\n  VHD files larger than 2GB, the old behavior needs to\n  be restored. This can be done with the tweaker.\n\n- when using SOCKS and the SOCKS server is not available\n  (e.g. the network connection is not present), there\n  might be a delay when Virtual PC is starting up.\n  To fix this, make sure you disable SOCKS when there is\n  no connection to the SOCKS server.\n\n6. Support\n----------\n\nSupport is available for registered Virtual PC for OS/2\ncustomers. This includes online support through our\nsupport site at http://www.innotek.de/products/virtualpc/.\nUpdates to the product will also be available from this\nweb site.\n\n\n7. Acknowledgements\n-------------------\n\nInnoTek would like to thank the following people (in\nalphabetical order) for their contribution to the project:\n\nDavid Atlas\nBenjamin Armstrong\nElizabeth Ciapala\nParag Chakraborty\nPaul Craton\nDaniela Engert\nRainer Feuerstein\nAaron Giles\nRandy Hagin\nBob John\nDonald Kaye\nJan Lauer\nOliver Mark\nMaryann McGregor\nWillibald Meyer\nUlrich Moeller\nRyan Molyneaux\nEirik Oeverby\nEd Reed\nAlain Rykaert\nKarlheinz Schmidthaus\nBruce Schroeder\nGreg Shah\nRichard Spurlock\nKlaus Staedtler\nSteffi Stein\nSerge Sterck\nEric Traut\n\n\n8. Copyrights\n-------------\n\n(C) 2001-2002 InnoTek(R) Systemberatung GmbH &lt;a href=&quot;\nhttp://www.innotek.de&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.innotek.de&lt;/a&gt;\n\n(C) 1988-2002 Connectix Inc.\n\n\n2002-09-26","torrent":{"xt":"urn:btih:1c57734f3f50168fd49a38ded3499675286c0c51","amp;dn":"Connectix+Virtual+PC+5+for+OS2+%26+eCS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c57734f3f50168fd49a38ded3499675286c0c51","infoHashBuffer":{"type":"Buffer","data":[28,87,115,79,63,80,22,143,212,154,56,222,211,73,150,117,40,108,12,81]},"announce":[],"urlList":[]}}