{"title":"Randi Rhodes Show - January 06 2014","uid":9444695,"size":52090228,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1cbdc791558bf98ae5eef1fc83b2a76e78d32e53&amp;dn=Randi+Rhodes+Show+-+January+06+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"480v","files":3,"time":1389067949,"description":"January 06, 2014\nThe Randi Rhodes Show \n\n\nMuch of the country is experiencing the coldest weather in many decades. When the high for the day is below zero, is it really a high? Weather forecasters should just call it the &quot;least low&quot; of the day.\n\nClimate change deniers have jumped on the cold snap to spread their lies that global warming is a hoax. It's a cold snap, people-a cold snap in the middle of huge hot stretch. If you get on the scale one day and you've dropped from being 40 pounds overweight to being 38 pounds overweight that day, that doesn't mean that your general fatness is a hoax. By next weekend, you'll have put those pounds back on and then some... and by next January, the year 2014 will be another year with record-breaking average high temperatures around the globe.\n\nSeen any good movies lately? In &quot;The Wolf of Wall Street,&quot; Leonardo DiCaprio plays a character so slimy that you find yourself being more attracted to co-star Jonah Hill. Most people think of Leo DiCaprio as Jack, the guy who sinks in the movie Titanic. In The Wolf of Wall Street, he plays a character named Jordan Belfort, who sinks other people. Some people claim that characters like Belfort and Gordon Gecko are bad role models who encourage stockbrokers to do bad things... as though stockbrokers needed role models for bad behavior. Gecko and Belfort weren't dreamed up from scratch by Oliver Stone and Martin Scorsese. They're based on real people. If Wall Street has bad role models it's because Wall Street supplies bad role models. Blaming the behavior of people on Wall Street on movie characters like Jordan Belfort is like blaming vapid journalism on the Ron Burgundy movies. The Wolf of Wall Street shows a world that is ruled by greed and ruthlessness ... or what Rand Paul would call &quot;a feel good family movie.&quot;\n\nToday the Supreme Court put a temporary hold on gay marriage in Utah while the case is being reviewed. Not to worry-gay marriage is coming... even to Utah. This is just a temporary reversal of the overarching trend-kind of like how we have record cold temperatures in the middle of a global warming trend.","torrent":{"xt":"urn:btih:1cbdc791558bf98ae5eef1fc83b2a76e78d32e53","amp;dn":"Randi+Rhodes+Show+-+January+06+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cbdc791558bf98ae5eef1fc83b2a76e78d32e53","infoHashBuffer":{"type":"Buffer","data":[28,189,199,145,85,139,249,138,229,238,241,252,131,178,167,110,120,211,46,83]},"announce":[],"urlList":[]}}