{"title":"Superman Funeral For a Friend  (hybrid) (OkC.O.M.P.U.T.O.-Novus","uid":10644823,"size":429640443,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1da5a7e3ca5c205be23265ae404c5c572397f704&amp;dn=%5CSuperman+Funeral+For+a+Friend++%28hybrid%29+%28OkC.O.M.P.U.T.O.-Novus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1406527774,"description":"A Novus Release\n\n\n\n\nThis torrent includes the HD versions.\n  \n \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\nThe funeral that followed &quot;Doomsday&quot; featured many of Superman's fellow heroes and friends, including most of the Justice League of America, and a mausoleum was built in Metropolis in honor of the Man of Steel. During this time, every hero in the DC Universe (even Guy Gardner and Green Arrow, neither of whom had ever personally gotten along with him) sported a black arm band featuring the S-Shield logo. Some time later, Project Cadmus stole Superman's body from his mausoleum, which had been ironically provided by his longtime foe Lex Luthor, who said that if he couldn't kill Superman, then he at least wanted to bury him. It was hypothesized that they were attempting to clone him. The body was recovered by Lois Lane and Supergirl.\n\n\n\nThe stories after the funeral often dealt with the emotions felt by the general public as well as specific characters entwined within Superman's world, including Lois Lane, Clark Kent's parents, and even a number of supervillains. The contemporary real-life President of the United States and First Lady, Bill and Hillary Clinton, were also included in a scene during the funeral. With Superman gone, crime rises up again and the costumed heroes of Metropolis rise to fill in as protectors. Supergirl, Gangbuster, Thorn, and even Team Luthor, a Lexcorp-sponsored team, all tried but were not sufficient. Meanwhile, Jonathan Kent took the death of his adoptive son the hardest and as a result suffered a heart attack. At this point, all Superman comic titles went on a three-month hiatus.\n\n\n\nThe story was also collected into trade paperback form. Rather than using the banner title Funeral for a Friend, the title used for the collection was World Without a Superman.\n\n\n\n\n\n\nThanks goes to the OkC.O.M.P.U.T.O this release.\n\n","torrent":{"xt":"urn:btih:1da5a7e3ca5c205be23265ae404c5c572397f704","amp;dn":"%5CSuperman+Funeral+For+a+Friend++%28hybrid%29+%28OkC.O.M.P.U.T.O.-Novus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1da5a7e3ca5c205be23265ae404c5c572397f704","infoHashBuffer":{"type":"Buffer","data":[29,165,167,227,202,92,32,91,226,50,101,174,64,76,92,87,35,151,247,4]},"announce":[],"urlList":[]}}