{"title":"Tin Men (1987) 2GB 720p subs Dreyfuss-Devito (moviesbyrizzo)","uid":6487631,"size":2284880676,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:1dbd3b0a2458c9744e34c3d0a53212f6f1fb18cc&amp;dn=Tin+Men+%281987%29+2GB+720p+subs+Dreyfuss-Devito+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1308759240,"description":"Note: This is a convert of the previously solstars uploaded\nmkv format version, which we bring you instead in DivX avi format\nto ensure broader HD disc player compatibility no doubt. We also\ninclude English subtitles templaye so you can easily use google\ntranslate to instantly generate working subs for whatever language\nof your choice, and furthermore French subs are included additionally. \nThank you to uploader solstars for this source file as we couldnt find\nit anywhere else in any other size or format to convert from in order\nto suit our needs here for you all to enjoy equally.\n\n\nA special thanks to the comrades who participated in the launch of our\n4GB 1080p HD version of Der Pianist (The Pianist in German - multisubs\nas we managed a good number of completions with just 10GB invested\nin precious bandwidth - as all were willing to share their download - \nThe Rumpole Series (by contrast) cost us several hundreds of gigs and barely\ngenerated any seeds even after all that effort - oh well - we try to serve \nas best we are able to do as the community allows for with co-operation to \nadvance world views that are meant to improve our lot in Europe - in the main! \ndanke ,merci grazie and thanks indeed too!\n\n\n1280 X 720p video 2540k video bitrate 128k audio bitrate\n\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0094155/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0094155/&lt;/a&gt;\n\n\nThis is another movie that ranks among my personal most favourites.\n\nTin Men is an excellent human story that comes to us from\nHollywood to describe the life of the door to door salesman\nwho's looking to make a quick killing as it were, throughout\nhis working hours.\n\nI know something of this business as I sold vaccum cleaners\nmyself while in high school for some pocket money as it were\nas my parents had no ability to come up with anything in this\nregard given their high mortgage and other expenses.\n\nAlthough I didn't use the door to door approach (I was\ngiven pre-arranged appointments to show off the \n&quot;Filter Queen&quot; products (by the way, they are the\nbest in the business, even these several decades \nlater I find when I shop for a vaccum personally -\nthere are deals to be found in older used ones\nin shops around town in any event), I have a lot\nof understanding for the business and characters\nthat are depicted in the movie.\n\nIt's sad when a culture evolves in such a manner\nthat people simply don't feel that they are always\ndealing with their own kin, in a way as to make\nfor a conscionable existence by comparison for\nexample to what you will find in most communities\nin Europe. Even in Russia with the mob now operating\nthere, there is a sense of community that endures\nand that will never be destroyed to the extent of seeing\neach person in your midst as only a means to an end.\n\nThat unfortunately is the message of this movie \nand others like &quot;Death of a salesman&quot; and many\nother such examples in fact.\n\nIf folks are to you just a prospect for a sale\nand you don't care how its done, then I'm afraid\nyou lack a good enough existence to teach any\nof your wisdom, in this regard. I think we should\nlearn from Europe instead. Better still for America,\nthere's Jessica Lange there who could set it all up \nfor good Christians to show the world a better way.\n\nIt shows in all that people say and do and feel towards\none another, and the madness you see displayed in this\nmovie in what is insensitive or unfair is an example\nin all of this, I think - quite clearly!\n\nNonetheless, its a great comedy for those that enjoy this \ngenre, and I always will feel close to the characters \ngiven my own background even though I'm 100% the \nopposite in being concerned with integrity, while the \nscripted characters in the movie are clearly not. As such, \nthe feeling is superficial, however it is there and quite \nemphatically so.\n\nGreat movies such as this and others that\nwe show off here are either not well enough\nadvertised or promoted, or they are simply\nwritten off by the industry to the point where\nthey refuse to make them even available - at any\nprice - go figure!\n\nI hope to see the industry make a fortune with our\nefforts here, provided they put the DVDs (4GB 720p or better)\non the shelves at just five bucks each. That's fair for\nall and its a richer scheme than what they've got going now.\nAnd more sensible too. (For the community minded).\n\n\nIncludes nice songs from the sountrack (for your ipod or \nhome stereo - or even at the local cafe jukebox collection perhaps)\n\nMichael Rizzo Chessman\t\nmoviesbyrizzo\t","torrent":{"xt":"urn:btih:1dbd3b0a2458c9744e34c3d0a53212f6f1fb18cc","amp;dn":"Tin+Men+%281987%29+2GB+720p+subs+Dreyfuss-Devito+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dbd3b0a2458c9744e34c3d0a53212f6f1fb18cc","infoHashBuffer":{"type":"Buffer","data":[29,189,59,10,36,88,201,116,78,52,195,208,165,50,18,246,241,251,24,204]},"announce":[],"urlList":[]}}