{"title":"James Otto - Groovy Little Summer Song (2nafish)","uid":5820498,"size":130293764,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1dc82e02f91822a7b0b2c39760eb09d6b56ff4a5&amp;dn=James+Otto+-+Groovy+Little+Summer+Song+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1284030281,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Groovy Little Summer Song&quot; is the title of a country music song written by Al Anderson, Carson Chamberlain, and James Otto, and recorded by Otto as the second single from an upcoming album entitled &quot;Shake What God Gave Ya&quot;.\n\nKarlie Justus of The 9513 gave the song a thumbs-up rating. She said in her review that the song &quot;breaks through the pack and delivers a self-aware, laid-back tune just as enjoyable as an SPF-covered day at the beach.&quot; Tara Seetharam of Country Universe gave &quot;Groovy Little Summer Song&quot; a B rating. Her review described the song as &quot;an incredibly refreshing re-introduction to an artist who can deliver both rich, distinctive vocals and pure, raw sentiment.&quot;\n\n&quot;Groovy Little Summer Song&quot; debuted at #54 on the Hot Country Songs chart dated March 27, 2010. It entered the Top 40 at #39 on the country chart dated May 1, 2010, giving Otto his sixth Top 40 country hit, as well as his fifth consecutive. It is also his biggest hit since 2008's #1 hit, &quot;Just Got Started Lovin' You.&quot; The song peaked at #26 in August 2010.\n\nJames Allen Otto (born July 29, 1973 at Fort Lewis in Washington) is an American country music artist who is a member of the MuzikMafia, a group of country musicians known for their &quot;country music without prejudice&quot;. Otto began his career on Mercury Nashville Records in 2002, charting three minor singles on the Billboard Hot Country Songs charts and recording his debut album Days of Our Lives for the label before being dropped in 2004.\n\nIn late 2007, he signed to Warner Bros. Records. His second album, Sunset Man, was released in April 2008. It was produced by John Rich (of Big &amp; Rich) and Jay DeMarcus (of Rascal Flatts), the latter of whom is Otto's brother-in-law. The lead-off single to Sunset Man, &quot;Just Got Started Lovin' You&quot;, became Otto's first Number One hit, as well as the Number One country single of 2008 according to Billboard.\n\nIn 2002, Otto met Scott Parker of Mercury Nashville Records, who signed him to a record deal that year. His first single, &quot;The Ball&quot;, peaked at #45 on the Billboard  country charts, while a second single, &quot;Long Way Down&quot;, failed to chart at all. Due to the poor chart performance of these singles, Otto's debut album was delayed. &quot;Days of Our Lives&quot;, his third release for the label, was released in late 2003, peaking at #33 on the country charts. Shortly after the song peaked, his debut album (also entitled Days of Our Lives) was released on Mercury, and in 2004, Otto was signed as an opening act for Shania Twain on her Up! Tour. His fourth single for Mercury, &quot;Sunday Morning and Saturday Night&quot;, peaked at #58. After the song fell from the charts, Otto exited Mercury's roster. From there, he began working with the MuzikMafia, a gathering of singer-songwriters founded by Big &amp; Rich, Gretchen Wilson and Cowboy Troy. Otto co-wrote songs and sang background vocals on two of Cowboy Troy's albums: Loco Motive and Black in the Saddle, released in 2005 and early 2007, respectively.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1dc82e02f91822a7b0b2c39760eb09d6b56ff4a5","amp;dn":"James+Otto+-+Groovy+Little+Summer+Song+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dc82e02f91822a7b0b2c39760eb09d6b56ff4a5","infoHashBuffer":{"type":"Buffer","data":[29,200,46,2,249,24,34,167,176,178,195,151,96,235,9,214,181,111,244,165]},"announce":[],"urlList":[]}}