{"title":"20121206-Stossel-[Good Intentions Gone Wrong].Fox.Business.CF","uid":9629522,"size":201984000,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1deb8314074c4c4bd78feb8bf8e9fd2e5827e193&amp;dn=20121206-Stossel-%5BGood+Intentions+Gone+Wrong%5D.Fox.Business.CF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WillKane","files":1,"time":1392652785,"description":"Seems to be a missing episode.\n\n----------\n\nSTOSSEL - [Good Intentions Gone Wrong] - Fox Business Network\n2012, December 06, Thursday\n\nXvid/MP3 AVI - encoded from Youtube stream with Aimsoft\n\n----------\n\n[excerpted from John Stossel's blog:]\nPoliticians claim they make our lives better by passing laws. But usually the laws go wrong. Examples:\n\nWork rules protect employees from greedy companies.\n\nWall Street Journal Reporter Anne Jolis says work rules destroyed jobs in Europe. Workers there get &quot;vacation do-overs&quot;- if they are sick on vacation, they get additional paid time off to make up for it. In Spain, employers must give 24 months of severance pay after they fire someone. No wonder companies don't hire.\n\nAmerica doesn't have mandatory vacation time, but we still have 170,000 pages of rules. Dan Mitchell from the CATO Institute says those rules are a reason this economic recovery is slower than all the others.\n\nThe federal Emergency Alert System (EAS) is necessary to warn people of danger.\n\nDespite spending millions on the EAS, it has never been activated nationwide or tested successfully. Jamie Barnett, former FCC Safety &amp; Homeland Security Bureau Chief, called for the 2011 test of the system. Even though the alert didn't work in many areas, he still says it was &quot;a success&quot;. In the private sector, that's what we'd call a failure.\n\nPublic charter schools with fewer regulations will solve our problems.\n\nI was excited when the charter movement began- but now it's gone wrong too. Tracey Williams tried to open a charter school in New Jersey. She submitted six applications, and all were denied. Jeanne Allen of the Center for Education Reform says this is typical. The government is in charge and government doesn't want competition.\n\nGovernment will investigate and tell us what to worry about.\n\nPaul Alexander, author of Panic! The Story of Germs VS People, points out that the EPA and FDA have studied the ingredients in anti-bacterial soap, toothpaste, and deodorant for 40 years. They still can't decide whether they are safe or effective. You will pay for the continued studies.\n\nThe Dodd-Frank law protects us from evil banks.\n\nLouise Bennets from the CATO Institute shows how Dodd-Frank stifles commerce, and instead of ending &quot;too big to fail&quot;, it enables it.","torrent":{"xt":"urn:btih:1deb8314074c4c4bd78feb8bf8e9fd2e5827e193","amp;dn":"20121206-Stossel-%5BGood+Intentions+Gone+Wrong%5D.Fox.Business.CF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1deb8314074c4c4bd78feb8bf8e9fd2e5827e193","infoHashBuffer":{"type":"Buffer","data":[29,235,131,20,7,76,76,75,215,143,235,139,248,233,253,46,88,39,225,147]},"announce":[],"urlList":[]}}