{"title":"Thurston Harris - Little Bitty Pretty One Complete Early Recordi","uid":9465940,"size":153012165,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1fc14548a0efa4fd848644655dac6836ef4f7f01&amp;dn=Thurston+Harris+-+Little+Bitty+Pretty+One+Complete+Early+Recordi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1389458266,"description":"mp3 256\n\nThurston Harris managed to break out of the doo wop groups the Sharps and the Lamplighters to establish a viable solo career for a while, but substance abuse and a reckless streak helped drag him down. Two of his three hits were covers of Bobby Day songs -- &quot;Little Bitty Pretty One&quot; and &quot;Over and Over&quot; -- but the third, &quot;Do What You Did,&quot; was one of his own compositions. Little Bitty Pretty One: Complete Early Recordings covers the years 1957-1964 and has all of Harris' commercially released Aladdin recordings, plus most of his later sides for Dot, Cub and Reprise, in no particular order. Many of the early Aladdin recordings feature prominent electric bass and rock rhythms, but Harris could sing sensitive ballads, too, as he does on &quot;I'm Asking Forgiveness&quot; and a cover of Glenn Miller's &quot;Moonlight Cocktail,&quot; a melodically sophisticated song that became a favorite of doo wop groups. Harris didn't record many novelties, but had a hand in writing the ones he did: &quot;Purple Stew&quot; is yet another installment in the &quot;Purple People Eater&quot; saga that also references &quot;Witch Doctor&quot; and &quot;Stranded in the Jungle,&quot; and &quot;(I Got Loaded At) Smokey Joe's&quot; recalls the Coasters' &quot;Smokey Joe's Cafe.&quot; Some of Harris' later repertoire, while enjoyable, seems unlikely to have produced any hits. His rockin' cover of Amos Milburn's &quot;One Scotch, One Bourbon, One Beer&quot; is good but hardly teen-oriented (unlike most contemporaneous popular music), and &quot;Dance on Little Girl&quot; mimics &quot;Little Bitty Pretty One&quot; while lifting the melody from &quot;Mary Had a Little Lamb&quot; -- not exactly a winning combination for the Anglophile year of 1964. Boasting good sound quality and an incredible 35 tracks (four of which appear in stereo), Little Bitty Pretty One: Complete Early Recordings is a the most exhaustive anthology of Thurston Harris' solo recordings that could fit onto one disc. ","torrent":{"xt":"urn:btih:1fc14548a0efa4fd848644655dac6836ef4f7f01","amp;dn":"Thurston+Harris+-+Little+Bitty+Pretty+One+Complete+Early+Recordi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fc14548a0efa4fd848644655dac6836ef4f7f01","infoHashBuffer":{"type":"Buffer","data":[31,193,69,72,160,239,164,253,132,134,68,101,93,172,104,54,239,79,127,1]},"announce":[],"urlList":[]}}