{"title":"[GirlsWay] - Cassidy Klein, Jelena Jensen - (My Virgin Daughter","uid":14998098,"size":327866674,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:2111daa841c5cce26b3ab5d9a0b520db07efe45d&amp;dn=+%5BGirlsWay%5D+-+Cassidy+Klein%2C+Jelena+Jensen+-+%28My+Virgin+Daughter&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LucasCar","files":1,"time":1466362132,"description":"[GirlsWay] - Cassidy Klein, Jelena Jensen - (My Virgin Daughter Part One) [NEW June 18, 2016] \r\n\r\n As the new mother figure in the home, Jelena Jensen informs her husband that it’s been hard bonding with his daughter Cassidy Klein. One minute, her step daughter is sweet and caring then the next, rambunctious and miserable. Jelena doesn’t know what to do in order for them to have a stable relationship if Cassidy can’t tell her why she is so upset. Jelena’s husband thinks they should have a good talk, considering Jelena’s first marriage ended because she had a sexual relationship with her ex husband’s pornstar daughter. Jelena decides that, first thing tomorrow morning, she will approach the young christian girl and make amends in hopes they can flourish into a loving mother-daughter relationship. Jelana wakes up alone on her bed, hearing screams from a not so distant Cassidy. Jelena calls out to Cassidy as the voices become louder. Louder and louder she hears her daughter wailing for help until a seemingly sublime power confounds her. Cassidy faces Jelena, crying out to be devirginized. Jelena doesn’t understand what has gotten into her daughter, and begs her to go back to sleep, but Cassidy insists that feeling the warmth of her mother’s pussy on her mouth will fulfill her fantasy. Jelena resists as much as possible, but the adamant virgin is too fast for her to react, and is already engaging in her lesbian fantasy. Cassidy fills her mouth with her mother’s warm and tasty pussy, making Jelena moan in euphoria. When Cassidy places herself over Jelena’s mouth, she grinds her hips in pleasure, unable to control her lesbian sexual excitement. There is no turning back as Jelena takes charge fully, pleasing her daughter by tribbing vigorously until she realizes that all of a sudden, she is alone with Cassidy no where to be found. Waking up in the morning, she realizes it was just a dream, knowing fully well what she must do to subdue her lesbian subconscious! To be continued...\r\n \nhttp://imgteen.org/img-5766cd08c3e38.html\r\n\r\n\r\n★ ★ ★  For more Exclusive Porn please visit ★ ★ ★\r\n \nhttps://thepiratebay.org/user/LucasCar","torrent":{"xt":"urn:btih:2111daa841c5cce26b3ab5d9a0b520db07efe45d","amp;dn":"+%5BGirlsWay%5D+-+Cassidy+Klein%2C+Jelena+Jensen+-+%28My+Virgin+Daughter","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2111daa841c5cce26b3ab5d9a0b520db07efe45d","infoHashBuffer":{"type":"Buffer","data":[33,17,218,168,65,197,204,226,107,58,181,217,160,181,32,219,7,239,228,93]},"announce":[],"urlList":[]}}