{"title":"Sally Oldfield...Femme(1987)[FLAC]","uid":5795670,"size":219850488,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:214e5d6ab07cc5eb99cd0fb42df3c4e327650300&amp;dn=Sally+Oldfield...Femme%281987%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1283030796,"description":"FEMME is the 1987 European release from Sally Oldfield.\n\n\nSally Oldfield's musical career started in 1968 when she founded the folk music duo The Sallyangie together with brother Mike, then aged 15. The duo recorded their first and only album at the recommendation of Pentangle band guitarist, John Renbourn whom Sally had met at the Troubadour Folk Club in Bristol.The album happened almost by accident when Sally walked into the offices of Transatlantic Records in Marylebone Lane in July 1968, announcing that she wanted to make a record and that she had a younger brother who played great guitar. She brought Mike in and they were signed as a duo for an advance of Ã‚Â£25 each. The sound of the album Children of the Sun recorded in just 48 hours in August 1968, was a fairy-tale blend of English folk and pop. They are mainly Sally's songs and the first that she had ever written in her life. The duo spent the week beforehand arranging the songs on guitars at their home in Harold Wood Essex and the album contains some of her brother's early, gifted guitar playing. Guesting were Terry Cox on drums and Ray Warlweigh on flute. The duo split up soon after the release and went their separate ways for a time.\n\nThere followed several years of musical experimentation, until Oldfield's debut solo album &quot;Water Bearer&quot; released in 1978, which is a continuous song-cycle, written, arranged, played and produced by herself.It has many classical, mythical and poetic influences and has become a cult classic with its multi-layered vocal harmonies and atmospheric, symphonic arrangements. Her track titled &quot;Mirrors&quot; scored a chart hit around the world at this time. Since then, she has released over 12 more successful solo albums as well as appearing on several albums of her siblings Mike and Terry. She was one of the singers performing the girlie chorus in a couple of sections on Tubular Bells in the climax on side one and just before the Scottish tune on side two.Oldfield also reprised her role for the 2003 re-recording, Tubular Bells 2003.\n\nIn the late 1970s Sally, and her brothers Mike and Terry all completed the Exegesis Programme Large Group Awareness Training course.\n\nOn the demise of her record label Bronze Records in 1984, Oldfield re-located to Germany where her musical career was based from that time onwards. She became a household name in Europe and many other countries of the world, but most of her albums from 1983 onwards were not released in the UK. She worked with many German co-producers and musicians including Gunter Mende and Candy de Rouge, the writers/producers of the original hit single &quot;The Power of Love&quot;, originally released in 1985 by Jennifer Rush. Oldfield regularly appeared on national television and radio and did several European concert tours, the last being in Germany in 2003. She always continued her passion for the mystical and all aspects of spirituality\n \n\n1. Silver Dagger \n 2. This Is My Song \n 3. Marlene \n 4. Strangers in the Dawn \n 5. I'm Leaving \n 6. Andromeda Rising \n 7. Sometimes I'm a Woman \n 8. Two Different Drummers \n 9. Giving All My Love\n\ncd ripped by dBpoweramp\n\nplease seed \n","torrent":{"xt":"urn:btih:214e5d6ab07cc5eb99cd0fb42df3c4e327650300","amp;dn":"Sally+Oldfield...Femme%281987%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"214e5d6ab07cc5eb99cd0fb42df3c4e327650300","infoHashBuffer":{"type":"Buffer","data":[33,78,93,106,176,124,197,235,153,205,15,180,45,243,196,227,39,101,3,0]},"announce":[],"urlList":[]}}