{"title":"The Fire Witrhin (Criterion) DVD-R R1 NTSC SteelerJ17 (REQUEST)","uid":8404568,"size":4681486336,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:21d337720f898d0e64037f2c0b1a19f6540bcacb&amp;dn=The+Fire+Witrhin+%28Criterion%29+DVD-R+R1+NTSC+SteelerJ17+%28REQUEST%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SteelerJ17","files":-1,"time":1366774325,"description":"The Fire Within (Criterion) DVD-R R1 NTSC SteelerJ17 (REQUEST)\n\nThis is a iso file. You can easily burn it through using Nero or IMGBurn\n\nRunning Time 1hr 48mins     Rated-NR\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0057058/?ref_=sr_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0057058/?ref_=sr_1&lt;/a&gt;\n\nAfter rising to international stardom with such seminal crowd-pleasers as The Lovers and Zazie dans le metro, Louis Malle gave his fans a shock with The Fire Within (Le feu follet), a penetrating study of individual and social inertia. Maurice Ronet (Elevator To The Gallows), in an implosive, haunted performance, plays Alain Leroy, a self-destructive writer who resolves to kill himself and spends the next twenty-four hours trying to reconnect with a host of wayward friends. Unsparing in its portrait of Alain's inner turmoil and shot with remarkable clarity, The Fire Within is one of Malle's darkest and most personal films.\n\nMenus-Yes\nExtras-Yes\n\nSpecial Features including\nArchival interviews with director Louis Malle and actor Maurice Ronet\nMalle's Fire Within, a new video program featuring interviews with actor Alexandra Stewart and filmmakers Philippe Collin and Volker Schlondorff\nJusqu'au 23 Juillet, a 2005 documentary short about Pierre Drieu la Rochelle's novel Le feu follet and dadaist writer Jacques Rigaut (the inspiration for the main character), featuring actor Mathieu Amalric, writer Didier Daeninckx, and Cannes festival curator Pierre-Henri Deleau\nNew and improved English subtitle translation\n\nLet's get this SEEDED people!! Remember it's nice to share. Don't Be A Hit and Run!! (Note: I will seed for 1 week only!!!!)\n\nIf you have any requests. Please comment below. It has to be on DVD!!\n\nBookmark me on your favorites!!! You'll never know what I will upload!\n\nPlease enjoy and SEED your TORRENTS!! Seed IT!!\t","torrent":{"xt":"urn:btih:21d337720f898d0e64037f2c0b1a19f6540bcacb","amp;dn":"The+Fire+Witrhin+%28Criterion%29+DVD-R+R1+NTSC+SteelerJ17+%28REQUEST%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21d337720f898d0e64037f2c0b1a19f6540bcacb","infoHashBuffer":{"type":"Buffer","data":[33,211,55,114,15,137,141,14,100,3,127,44,11,26,25,246,84,11,202,203]},"announce":[],"urlList":[]}}