{"title":"You Can't Take It With You (1938) - AVI","uid":6062419,"size":1611958432,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2253e06bce58c2cda6859a825e0f90d4db1ec454&amp;dn=You+Can%5C%27t+Take+It+With+You+%281938%29+-+AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"timelyone","files":-1,"time":1293187857,"description":"You Can't Take It With You (1938) is a comedy film directed by Frank Capra adapted from the Pulitzer Prize-winning play of the same name by George S. Kaufman and Moss Hart.The cast includes James Stewart, Jean Arthur, Lionel Barrymore and Edward Arnold.\n\nThe movie won two Academy Awards from seven nominations: Best Picture and Best Director for Frank Capra. This was Capra's third Oscar for Best Director in just five years, following It Happened One Night in 1934 and Mr. Deeds Goes to Town in 1936. It was also the highest-grossing picture of the year.\n\n\n\nBrief Synopsis \t\nA girl from a family of freethinkers falls for the son of a conservative banker.\n\nSynopsis\n\nAnthony P. Kirby, a ruthless banker, is establishing a government-sanctioned munitions monopoly by buying all the land surrounding a competitor's factory, thereby forcing him out of business. His only obstacle is Grandpa Martin Vanderhof, an eccentric who refuses to sell his home. Grandpa's spirited family consists of his daughter, Penny Sycamore, a playwright; her husband Paul, who constructs fireworks; their daughter, Essie Carmichael; Essie's husband Ed, who delivers Essie's homemade candies; and their other daughter, Alice, stenographer to Kirby's son Tony. Tony and Alice are in love, much to the dismay of Tony's mother, whose snobbishness dampens Alice's enthusiasm when Tony proposes to her. That night, Tony meets Alice's family for the first time and is charmed by them. Alice asks Tony to bring his parents to her house for dinner, but Tony, fearing that her family will put on a false front, comes a night early. Chaos ensues, as neither family is quite prepared for the other. Just as the Kirbys are leaving, the police arrive to arrest Ed for flyers he put in Essie's candy boxes, which advertise Paul's fireworks but which the police mistake for Communist propaganda. Just then the fireworks in the cellar are inadvertently set off, and everyone runs out of the house. They are all taken to jail, where Kirby insults the other prisoners and Grandpa loses his temper, telling Kirby he is a failure because he has no friends. Kirby is affected but remains silent, even when Grandpa gives him a harmonica as an apology. They are brought before the night judge, who dismisses the disturbing the peace charge against Grandpa, but fines him $100 for possession of fireworks. Kirby's lawyers offer to pay the fine, but Grandpa's friends pay it instead. The judge will not dismiss the disturbing the peace charge against the Kirbys, however, unless they explain why they were there. Because Mrs. Kirby forbids her husband to reveal the truth, Grandpa covers for them by saying it involved buying the house. Alice then tells the judge the truth and tells Tony to forget their romance, while reporters push in and cause a small riot. Soon after, Alice disappears and not even her family knows where she is. When Alice writes to tell them that she is in the country and that she will never return, Grandpa sells the house so that the family can be together. Kirby's plans progress because of the sale, and just before the board meeting where he will announce the final settlements, he is visited by Ramsey, the competitor he ousted, and Tony. Ramsey warns Kirby that he will die friendless, while Tony tells him that he is quitting the firm and leaving home. Shaken by news of Ramsey's death from heart failure moments later, Kirby is unable to attend the board meeting. Back at Grandpa's house, everyone is packing when Tony arrives. Alice arrives also, and although she is distraught that Grandpa sold the house, she locks herself in her room rather than talk to Tony. When Kirby shows up, seeking Grandpa's advice on how to win back Tony, Grandpa suggests they play a duet of &quot;Polly-Wolly-Doodle&quot; on their harmonicas, and their music cheers everyone up. The dancing and singing begin again, and when Tony and Alice appear, astonished at what they see, Kirby nods his approval at them. Later, at dinner, Grandpa says grace, thankful that the house has been sold back to him and harmony has been restored.\n\nCast &amp; Crew\nFrank Capra Director\nJean Arthur as Alice Sycamore\nLionel Barrymore as [Grandpa] Martin Vanderhof\nJames Stewart as Tony Kirby\nEdward Arnold as Anthony P. Kirby\nMischa Auer as [Boris] Kolenkhov\nAnn Miller as Essie Carmichael\nSpring Byington as Penny Sycamore\nSamuel S. Hinds as Paul Sycamore\nDonald Meek as Poppins\nH. B. Warner as Ramsey\nHalliwell Hobbes as DePinna\nRelease Date 29 Sep 1938\n\nColor/BW Black and White\n\nSound Mono (RCA High Fidelity Recording)\n\nProduction Dates 25 Apr--29 Jun 1938\nDuration (in mins) 126-127\nDuration (in feet) 11,571\nDuration (in reels) 13\n\nPremiere Information New York opening: week of 1 Sep 1938\n25 Apr--29 Jun 1938\nDistribution Company Columbia Pictures Corp. of California, Ltd.\nProduction Company Columbia Pictures Corp. of California, Ltd.\nCountry United States\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6003960/The_American_Religion_Defined_In_The_Declaration_of_Independence&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6003960/The_American_Religion_Defined_In_The_Declaration_of_Independence&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2253e06bce58c2cda6859a825e0f90d4db1ec454","amp;dn":"You+Can%5C%27t+Take+It+With+You+%281938%29+-+AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2253e06bce58c2cda6859a825e0f90d4db1ec454","infoHashBuffer":{"type":"Buffer","data":[34,83,224,107,206,88,194,205,166,133,154,130,94,15,144,212,219,30,196,84]},"announce":[],"urlList":[]}}