{"title":"Theoretical Aspects of Heterogeneous Catalysis","uid":15532117,"size":9994056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22df5d98db4af418abb941cc699c0a684977005b&amp;dn=Theoretical+Aspects+of+Heterogeneous+Catalysis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470842739,"description":"Theoretical Aspects of Heterogeneous Catalysis - M.A.C. Nascimento (Kluwer, 2002).pdf\r\n\r\nHeterogeneous catalysis is a fascinating and complex subject of utmost importance in the present day. Its immense technological and economical importance and the inherent complexity of the catalytic phenomena have stimulated theoretical and experimental studies by a broad spectrum of scientists, including chemists, physicists, chemical engineers, and material scientists. Computational and theoretical techniques are now having a major impact in this field. This book aims to illustrate and discuss the subject of heterogeneous catalysis and to show the current capabilities of the theoretical and computational methods for studying the various steps (diffusion, adsorption, chemical reaction) of heterogeneous catalytic process involving zeolites, metal oxides, and transition metal surfaces. The book covers:\r\nthe use of techniques of computational chemistry to simulate zeolites, metallic and bimetallic surfaces, and oxide-supported metals;\r\nthe impact of simulation methods on the understanding of the diffusion and adsorption of molecules and cations within the pores of zeolites, and also on the adsorption of molecules on metal and metal-oxide surfaces; and\r\nthe applications of quantum-mechanical methods to the study of the reaction mechanism and pathways of the adsorbed molecules.\r\nThis book is recommended primarily to scientists and graduate students conducting research in the fields of heterogeneous catalysis and surface science. It will also be valuable to advanced undergraduate students wishing to become acquainted with the latest developments in these exciting fields of research, and to experimentalists seeking theoretical support for interpreting their results","torrent":{"xt":"urn:btih:22df5d98db4af418abb941cc699c0a684977005b","amp;dn":"Theoretical+Aspects+of+Heterogeneous+Catalysis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22df5d98db4af418abb941cc699c0a684977005b","infoHashBuffer":{"type":"Buffer","data":[34,223,93,152,219,74,244,24,171,185,65,204,105,156,10,104,73,119,0,91]},"announce":[],"urlList":[]}}