{"title":"Carlos Mencia - New Territory (2011) Comedy Central Edited Versi","uid":6886482,"size":883317957,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2370e66460ebeffd703a9e4803966442a77febe3&amp;dn=Carlos+Mencia+-+New+Territory+%282011%29+Comedy+Central+Edited+Versi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1323852199,"description":"Carlos Mencia - 2011 - New Territory\n\nFormat                           : Matroska\nFile size                        : 842 MiB\nDuration                         : 41mn 29s\nOverall bit rate                 : 2 839 Kbps\n\n\nVideo\n\nCodec ID                         : V_MPEG4/ISO/AVC\nDuration                         : 41mn 29s\nBit rate                         : 2 399 Kbps\nWidth                            : 1 280 pixels\nHeight                           : 720 pixels\nDisplay aspect ratio             : 16:9\nFrame rate                       : 23.976 fps\nColor space                      : YUV\nChroma subsampling               : 4:2:0\nBit depth                        : 8 bits\nScan type                        : Progressive\nBits/(Pixel*Frame)               : 0.109\nStream size                      : 712 MiB (84%)\n\n\nAudio\nID                               : 2\nFormat                           : AC-3\nFormat/Info                      : Audio Coding 3\nMode extension                   : CM (complete main)\nCodec ID                         : A_AC3\nDuration                         : 41mn 29s\nBit rate mode                    : Constant\nBit rate                         : 384 Kbps\nChannel(s)                       : 2 channels\nChannel positions                : Front: L R\nSampling rate                    : 48.0 KHz\nBit depth                        : 16 bits\nCompression mode                 : Lossy\nStream size                      : 114 MiB (14%)\nLanguage                         : English\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2129950/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2129950/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/DaLebAAdg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/DaLebAAdg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://comedians.about.com/od/comedyspecials/fr/Carlos-Mencia-New-Territory-Dvd-Review.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://comedians.about.com/od/comedyspecials/fr/Carlos-Mencia-New-Territory-Dvd-Review.htm&lt;/a&gt;\n\n***NOTE*** - This is the 42 minute Comedy Central version. I have not yet seen a torrent of the full uncensored DVD.\n\n\nCarlos Mencia: New Territory - DVD Review\n\nBy Patrick Bromley, AboutDOTcom Guide\n\nCarlos Mencia has slimmed down significantly on his latest stand-up special, New Territory, but that's not the only thing that's different about him. Like the title suggests, Mencia is clearly trying to branch out and cover some new ground on the special, and the result is something that, while I may not have always found it as funny or edgy as some others, is certainly more focused than we've seen in the past. Mencia seems to have approached the special with an overall thesis in mind; even when the content isn't for me, I appreciate the thought that goes into constructing a special like this.\n\nAlmost the entire 80 minutes of New Territory (the DVD features the full-length &quot;extended&quot; cut, whereas the original Comedy Central broadcast was trimmed to just over 40 minutes) is spent critiquing modern America: our political system, our media, our attitudes towards immigration and our ability to take even the littlest things for granted. We're spoiled, lazy and easily manipulated, Mencia posits, and spends the duration of the special pointing out how and why that is. As political material goes, it's not all that challenging, and Mencia is in the tricky position of trying to straddle the fence. As a Latino, he attempts to approach his critique from the perspective of an &quot;outsider&quot;; at the same time, he announces right up front that he's a proud American happy to be living in the &quot;greatest country in the world.&quot; He tries to have it both ways, and each position tends to undercut the other somewhat.\n\nOf course, the rap against Mencia is that he steals jokes (those making such accusations include Louis C.K. and, most publicly, Joe Rogan), but I couldn't detect any of that on New Territory. That doesn't mean that the special doesn't feel derivative at times; much of it owes a good deal to late-era George Carlin in its critique of modern America. But Carlin certainly wasn't the first person to build an act around social and political criticism, so Mencia can hardly be accused of borrowing too liberally. And though I do feel like Mencia wavers too often on the outsider/insider line (not so as you would notice; if nothing else, Mencia has tremendous confidence on stage and delivers his set like he's the first and last comic you're ever going to hear), at least it lends the material a perspective that's clearly his own. He may not be saying much that you haven't already heard before, but it's clear that he's the one saying it. Does that make sense?\n\nWhat I like best about New Territory is that it (mostly) does away with what I've always liked least about Mencia's stand-up: his tendency to act as though he's being much more controversial and shocking than he really is (punctuating many a joke with an incredulous &quot;Whaaat?&quot; even though the audience wasn't reacting negatively to whatever had just been said). Sure, Mencia still appears to believe he's being edgy because he's &quot;telling it like it is,&quot; calling out both sides of the political aisle for their ridiculousness and hypocrisy, but I'm ok with that. He's not out to push buttons or be controversial in his latest special -- he's more interested in blunt force honesty. And even though much of that honesty feels kind of familiar, it's vastly preferable to his usual &quot;Can you believe what I'm getting away with?&quot; schtick. I hope that this is the direction in which Mencia continues to evolve, because he's finally turning into a comic with something to say. He's not quite there yet on New Territory, but even the appearance of effort suggests that he's willing to keep pushing himself. For a comic who has been around as long and has a large a following as Mencia does, that shouldn't be written off easily. I can't really recommend New Territory, but it's definitely a step in the right direction.","torrent":{"xt":"urn:btih:2370e66460ebeffd703a9e4803966442a77febe3","amp;dn":"Carlos+Mencia+-+New+Territory+%282011%29+Comedy+Central+Edited+Versi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2370e66460ebeffd703a9e4803966442a77febe3","infoHashBuffer":{"type":"Buffer","data":[35,112,230,100,96,235,239,253,112,58,158,72,3,150,100,66,167,127,235,227]},"announce":[],"urlList":[]}}