{"title":"Democracy Now - 10 jan 2012","uid":6945880,"size":456379506,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2402c06eb2a2cf35140c88d0d7e246b6a63f1c27&amp;dn=Democracy+Now+-+10+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1326225488,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 10, 2012\n\n- Mitt Romney in New Hampshire: &quot;I Like Being Able to Fire People&quot;\n- William Daley Resigns as White House Chief of Staff\n- IAEA Confirms Iran is Enriching Uranium in Underground Bunker\n- Syrian President Assad Claims Foreign Conspiracy Behind Protests\n- Nigerian Strike Enters Second Day; At Least Three Protesters Killed\n- Aung San Suu Kyi to Run for Parliament in Burma\n- U.S. Bans Uranium Mining Near Grand Canyon for 20 Years\n- Opponents of Factory Farming Claim to Set Fire at Beef Processing Plant in California\n\n\nSpecial reports\n\n- GuantÃƒÂ¡namo Detainees Launch Hunger Strike to Protest Prison's 10th Anniversary\n\nDetainees at the U.S. military base at GuantÃƒÂ¡namo Bay launched a hunger strike today marking the prison's 10th anniversary, inspired in part by U.S. activists who have called for a national day of action &quot;They will be staging a series of peaceful protests that will involve sit-ins with signs and banners in the part of the prison that has communal areas, as well as hunger strikes,&quot; says Ramzi Kassem, counsel to a number of GuantÃƒÂ¡namo prisoners. He notes his clients pay &quot;particularly close attention to any gestures of protest in the United States... And they're always very moved by the fact that Americans stand in solidarity with what they're going through and what their families are experiencing.&quot; On Wednesday, a major demonstration is planned in Washington, D.C., where organizers say they will form a human chain stretching from the White House to the Capitol, with participants wearing orange jumpsuits to represent the prisoners at GuantÃƒÂ¡namo and at the Bagram Air Base in Afghanistan who are still held without charge or trial.\n\n\n- GuantÃƒÂ¡namo Exclusive: Former Chief Prosecutor, Ex-Prisoner Call on Obama to Close Prison\n\nOn the 10th anniversary of when the United States began detaining terror suspects at its GuantÃƒÂ¡namo Bay military base in Cuba, we speak with a former prisoner and the ex-chief U.S. prosecutor, who both call for the Obama administration to close the base. &quot;People are locked up in isolation camps... People lost their hands, lost their eyes, lost their limbs,&quot; says Omar Deghayes, who was arrested in Pakistan as a terror suspect and held in U.S. custody from May 2002 until December 2007, most of that time at GuantÃƒÂ¡namo. &quot;Some people were subjected to sleep deprivation. They weren't allowed to sleep... And they had to live under those conditions for six years ... without being convicted of any crime, which is the most unacceptable thing.&quot; Asked if prisoners were tortured at GuantÃƒÂ¡namo, Air Force Colonel Morris Davis, the former chief prosecutor at the military prison, answers, &quot;I don't think there's any doubt.&quot; Davis resigned his position in 2007 in protest of what he called political interference in the military commissions of GuantÃƒÂ¡namo prisoners. &quot;In many of the cases, we had evidence independent of that [torture] that was sufficient to establish guilt. But to use torture to gain intelligence and then also to turn around and use that as evidence in an American court is just not consistent with American principles,&quot; Davis says.\n\n\n- NDAA: Obama Signs Law Restricting Transfer of GuantÃƒÂ¡namo Prisoners and Expands Indefinite Detention\n\nIt has been 10 years since the United States began detaining people at its military base in GuantÃƒÂ¡namo Bay, Cuba. We speak with someone who has worked to defend the rights of those prisoners for the last decade: Michael Ratner, president emeritus of the Center for Constitutional Rights. While dozens continue to face an unknown future at GuantÃƒÂ¡namo, we ask Ratner to comment on President Obama's recent approval of the National Defense Authorization Act (NDAA), which some legal experts say would authorize the military to indefinitely jail anyone it considers a terrorism suspect - without charge or trial. &quot;The Center represented the first people out of GuantÃƒÂ¡namo over 10 years ago. At that time, the detention of people, the military trials, was all done by a presidential order. When Obama took office, he continued the same actions. And recently, in the NDAA, those actions, the ability to detain people, the ability to use military commissions, etc., were actually put into law, and Obama, contrary to his claim that he was going to veto it, signed it, making him the first president ever in the United States to sign into law indefinite detention as part of the policy of the United States.&quot; Ratner adds that &quot;the NDAA puts very heavy restrictions on moving people out of GuantÃƒÂ¡namo... We are now in the longest period, almost a year, in which nobody has been transferred out of GuantÃƒÂ¡namo.&quot;\n\n\n- Laid-Off Steelworker: Mitt Romney and Bain Capital Profited by Shutting Down Kansas Steel Plant\n\nAs Republican presidential candidate Mitt Romney comes under fire in New Hampshire for touting his business experience, we look at how his private equity firm, Bain Capital, drove a Kansas City steel plant into bankruptcy, leading to some 750 layoffs and a federal bailout. Bain still walked away with millions of dollars in profits. We speak with Reuters reporter Andy Sullivan, who covered the story, and with Joe Soptic, a steelworker who lost his job at Kansas City's Worldwide Grinding Systems steel mill after 28 years. &quot;The first thing I noticed after the company was bought out ... they became very union non-friendly. They started looking for ways to eliminate jobs,&quot; says Soptic. &quot;In my department, they actually offered to buy our jobs out from underneath us. They cut back on safety equipment.&quot; Regarding Romney's business acumen, Soptic adds, &quot;If he runs the country the way he ran our business, I would not want him as president.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2402c06eb2a2cf35140c88d0d7e246b6a63f1c27","amp;dn":"Democracy+Now+-+10+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2402c06eb2a2cf35140c88d0d7e246b6a63f1c27","infoHashBuffer":{"type":"Buffer","data":[36,2,192,110,178,162,207,53,20,12,136,208,215,226,70,182,166,63,28,39]},"announce":[],"urlList":[]}}