{"title":"Incredible Scofield and His Book [Zionist Bible] - Canfield","uid":11674709,"size":16215349,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26567e1e7275bbfc61585bfa04068dd52f2b50ce&amp;dn=Incredible+Scofield+and+His+Book+%5BZionist+Bible%5D+-+Canfield&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":2,"time":1422808473,"description":"[Noam Chomsky:  The US 'christian zionist' lobby is up to 6 times larger (60-100 million US christian fundamentalist zealots) and more powerful than even AIPAC in driving the US Congress to support Israel's slaughter of Palestine.]\n\nThe Incredible Scofield and His Book\n\nThis powerful and fully documented study exposes the questionable background and faulty theology of the man responsible for the popular Scofield Reference Bible, which did much to promote the dispensational system. The story is disturbing in its historical account of the illusive personality canonized as a dispensational saint and calls into question the seriousness of his motives and scholarship. Back of Book: Almost everyone knows about the Scofield Bible. But no one before this has worked out a detailed account of the life of Cyrus I. Scofield. And yet there is such as amazing amount of material that should be known about this man that everytone who is at all interested in the dispensational system should read this book. This is a powerful book. The material is well documented. Anyone who gets this book and reads it will find here some amazing things about a man whose book is well known, but whose life we believe concerning many of its most features has been purposely concealed lest it be found to contradict his teachings. This is one of the most powerful books that has ever been written against the dispensational system. It is powerful because it shows how the book that has had the most to do with promotion of that system. The Scofield Reference Bible, originated. Here is a book that dispensationalists as well as others will do well to read. It is powerful, so powerful we dare say, that if dispensationalists would read it carefully, perhaps half of them would turn from that system","torrent":{"xt":"urn:btih:26567e1e7275bbfc61585bfa04068dd52f2b50ce","amp;dn":"Incredible+Scofield+and+His+Book+%5BZionist+Bible%5D+-+Canfield","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26567e1e7275bbfc61585bfa04068dd52f2b50ce","infoHashBuffer":{"type":"Buffer","data":[38,86,126,30,114,117,187,252,97,88,91,250,4,6,141,213,47,43,80,206]},"announce":[],"urlList":[]}}