{"title":"The Vampire Diaries S01E21 Isobel.avi","uid":5547864,"size":367013888,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:266719a50155fcbce7f71bbab4aee9e3dd1a4e72&amp;dn=The+Vampire+Diaries+S01E21+Isobel.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"evaislief","files":-1,"time":1273437007,"description":"De Vampire Diaries Seizoen 1 aflevering 21, Isobel met nederlandse ondertiteling. \n\n\nThe Vampire Diaries Season 1 episode 21, Isobel, dutch subbs\n\n\nformaat: divx\ntaal: engels\nondertitels: nederlands (ingebakken)\nduur: ongeveer 40 minuten per aflevering\n\nPlot:\nVier maanden nadat een tragisch auto-ongeluk een einde aan het leven van hun ouders maakte, proberen de 17-jarige Elena Gilbert (Nina Dobrev) en haar 15-jarige broer Jeremy (Steven R. McQueen) hun leven weer op te pakken. Ze wonen nu bij hun tante Jenna (Sara Canning) die er het beste van probeert te maken.\n\nAls het schooljaar begint, zijn Elena en haar vrienden gefascineerd door de nieuwe mysterieuze student Stefan Salvatore (Paul Wesley). Stefan en Elena voelen zich meteen tot elkaar aangetrokken. Wat ze niet weet is dat Stefan een vampier is.\n\nIn en rond Mystic Falls worden verschillende mensen dood aangetroffen na een aanval van een wild beest. Stefan weet dat dit niet waar is. Als hij thuis komt treft hij zijn oudere broer Damon (Ian Somerhalder) aan die hij al jaren niet heeft gezien. Ze gaan met elkaar de strijd aan om de ziel van Elena, van haar vrienden, familie en alle mensen in het kleine dorpje Mystic Falls.\n\nStefan drinkt echter geen mensenbloed , maar Damon wel. Na een poosje komt Elena te weten dat Stefan en Damon vampiers zijn. Ondertussen blijven de moorden maar doorgaan. Er worden ook andere vampiers aangetroffen.\n\nLaatste aflevering van het seizoen komt over een weekje!","torrent":{"xt":"urn:btih:266719a50155fcbce7f71bbab4aee9e3dd1a4e72","amp;dn":"The+Vampire+Diaries+S01E21+Isobel.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"266719a50155fcbce7f71bbab4aee9e3dd1a4e72","infoHashBuffer":{"type":"Buffer","data":[38,103,25,165,1,85,252,188,231,247,27,186,180,174,233,227,221,26,78,114]},"announce":[],"urlList":[]}}