{"title":"Ten Must Have Essential Classic Rock Albums [-emidius-]","uid":11621458,"size":1242691861,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:26902621cf01f800e9c71403f5a1f2ebc57d04e9&amp;dn=Ten+Must+Have+Essential+Classic+Rock+Albums+%5B-emidius-%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"emidius","files":144,"time":1417559699,"description":"The included are considered by many to be some of the top essential Classic Rock albums of all time. Regardless of any album rankings...these are truly MUST OWN albums for anyone interested in Classic Rock. I hope you enjoy this collection and I will be releasing further collections in the near future.\n\n1. 'Sticky Fingers' - Rolling Stones\nSticky Fingers is the ninth British and 11th American studio album by English rock band the Rolling Stones, released in April 1971.\n\n\n2. 'Who's Next' - The Who\nWho's Next is the fifth studio album by English rock band The Who, released in August 1971. It originated from a multi-media rock opera written by chief songwriter Pete Townshend called Lifehouse.\n\n\n3. 'Led Zeppelin IV' - Led Zeppelin\nThe untitled fourth studio album by the English rock band Led Zeppelin, commonly referred to as Led Zeppelin IV, was released on 8 November 1971 on Atlantic Records.\n\n\n4. 'Wish You Were Here' - Pink Floyd\nWish You Were Here is the ninth studio album by the English progressive rock group Pink Floyd, released in September 1975. It explores themes of absence, the music business and former band member Syd Barrett's mental decline\n\n\n5. 'Revolver' - The Beatles\nRevolver is the seventh studio album by the English rock band the Beatles. It was released on 5 August 1966 in the United Kingdom and on 8 August 1966 in the United States\n\n\n6. 'After Bathing At Baxter's' - Jefferson Airplane\nAfter Bathing at Baxter's, the third album by the San Francisco rock band Jefferson Airplane was released in 1967 as RCA Victor LSO-1511 &amp; LOP-1511.\n\n\n7. 'Eric Clapton' - Eric Clapton\nEric Clapton is the eponymous debut solo album from Eric Clapton, released in August of 1970.\n\n\n8. 'Electric Ladyland' - Jimi Hendrix\nElectric Ladyland is the third and final studio album by English-American rock band the Jimi Hendrix Experience, released in October 1968 by Reprise Records. The double album was the only record from the band produced by Jimi Hendrix.\n\n\n9. 'The Doors' - The Doors\nThe Doors is the debut album by American rock band The Doors, recorded in August 1966 and released in January 1967.\n\n\n10. 'Blonde On Blonde' - Bob Dylan\nBlonde on Blonde is the seventh studio album by American singer-songwriter Bob Dylan, released on May 16, 1966 on Columbia Records","torrent":{"xt":"urn:btih:26902621cf01f800e9c71403f5a1f2ebc57d04e9","amp;dn":"Ten+Must+Have+Essential+Classic+Rock+Albums+%5B-emidius-%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26902621cf01f800e9c71403f5a1f2ebc57d04e9","infoHashBuffer":{"type":"Buffer","data":[38,144,38,33,207,1,248,0,233,199,20,3,245,161,242,235,197,125,4,233]},"announce":[],"urlList":[]}}