{"title":"Sexual life of the child (1909) Albert Moll","uid":4609872,"size":1348580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26afa979ca9419a71ec441878d9a1fe0c5a87183&amp;dn=Sexual+life+of+the+child+%281909%29+Albert+Moll&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"mwanon","files":-1,"time":1230599978,"description":"&quot;The Sexual Life of the Child&quot;\n\nby Moll, Albert, 1862-1939\nTranslated from the German by Paul, Eden, 1865-1944\nIntroduction by Thorndike, Edward L. (Edward Lee), 1874-1949\nFirst published in German as Das Sexualleben des Kindes, 1909\nFirst published in English by Macmillan, 1912. LCCN 12-015624\nCopyright Ã‚Â© 1912 The Macmillan Company\nThis edition of October 2000 by Books Reborn\nxv, 339 p. ; 20 cm.\n155.3   HQ56.M67\n &lt;a href=&quot;\nhttp://www2.hu-berlin.de/sexology/GESUND/ARCHIV/SEN/INDEX.HTM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www2.hu-berlin.de/sexology/GESUND/ARCHIV/SEN/INDEX.HTM&lt;/a&gt;\n\nMOLL, ALBERT\n\nAlbert Moll (1862-1939) was a major rival to Magnus Hirschfeld. A Berlin neurologist, he wrote an influential book on homosexuality entitled Die KontrÃƒÂ¤re Sexualempfindug (1891), in which he distinguished between innate and acquired homosexuality. He regarded innate homosexuality as a stepchild of nature and held that the sex drive was an innate psychological function that could be injured or malformed through no fault or choice of the individual.\n\nHe further refined his theory in a general treatise on sexuality, Untersuchungen ÃƒÂ¼ber die Libido sexualis (1897), where he emphasized homosexuality as an illness, probably with an &quot;inherited taint.&quot; His major work was his Handbuch der Sexualwissenschaft (1911), where he developed association therapy, the replacement of same-sex associations with those of the opposite sex, as a curative technique.\n\nOver the years, Moll grew increasingly hostile to Hirschfeld, in part because of Hirschfeld's polemical style and because of what he regarded as the ethically dubious facets of Hirschfeld's activity. As he did so, he also changed his mind about the innate character of homosexuality and went into full opposition to Hirschfeld by organizing a rival international congress. Though never a Nazi (Moll came from a Jewish background), he mistakenly believed he could continue to be active under them, and after the Nazi takeover he was unable to practice and was more or less under house arrest until he died. His autobiography, Ein Leben als Arzt der Seek (1936), was his final attack on Hirschfeld's views. Though he still believed that there might be a few homosexuals whose orientation could be called innate, he felt that most homosexuality was acquired through improper sexual experiences and attacked those who argued for social and legal acceptance of homosexuality.\n\nHe pioneered the study of childhood sexuality in his Sexualleben des Kindes, and his handbook (mentioned above) was the first comprehensive work on sex. His theory of the sex life of the child had a profound effect on Freudian concepts, though Freud did not acknowledge it.\n\nVern L. Bullough","torrent":{"xt":"urn:btih:26afa979ca9419a71ec441878d9a1fe0c5a87183","amp;dn":"Sexual+life+of+the+child+%281909%29+Albert+Moll","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26afa979ca9419a71ec441878d9a1fe0c5a87183","infoHashBuffer":{"type":"Buffer","data":[38,175,169,121,202,148,25,167,30,196,65,135,141,154,31,224,197,168,113,131]},"announce":[],"urlList":[]}}