{"title":"HD video:  Lights In The Sky NIN video footage, Victoria","uid":4630615,"size":134430752996,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:27073a5c2c62f87b1d2a2f92b577c1925a252151&amp;dn=HD+video%3A++Lights+In+The+Sky+NIN+video+footage%2C+Victoria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"toblakai","files":17,"time":1231373142,"description":"this is the victoria one\n\n\ntrent_reznor posted:\n    Your gift...\n\n    The internet is full of surprises these days.\n    I was contacted by a mysterious, shadowy group of subversives who SOMEHOW managed to film a substantial amount (over 400 GB!) of raw, unedited HD footage from three separate complete shows of our Lights in the Sky tour. Security must have been lacking at these shows because the quality of the footage is excellent.\n\n    If any of you could find a LINK to that footage I'll bet some enterprising fans could assemble something pretty cool.\n\n    Oh yeah, you didn't hear this from me.\n\n\nThere is about 405gb of HD footage available. It was recorded with multiple consumer HDV cameras during three shows: Victoria 12.05.08, Portland 12.07.08, and Sacramento 12.12.08.\n\nThis is raw, unedited, un-color-corrected HD footage. It will be primarily of interest to advanced users, who may wish to attempt to edit it together into something. It could be really interesting to see what creative users can put together using this and other fan-recorded footage. These guys are off to a great start already.\n\nNovice users might not want to download this just yet. If you don't have a fast computer for playing back high definition video, or hundreds of gigabytes of storage available to save it to, this download will probably cause you nothing but problems. If you just want to see some live footage, you might be better off waiting until more advanced users get the footage and turn it into something more digestible for the masses. I'm sure a lot of this stuff will be turning up on YouTube as soon as people get it downloaded.\n\nThe footage is available as a free download via bitTorrent. If you don't know what bitTorrent is, please go to this link and read every word of it before you ask anyone on the forums what to do with the torrent files.\n\nAs the files are tremendously large, don't expect any instant gratification - the download may take days, even weeks. There are a handful of seeders to start things off. Until we get a large number of seeders, please only download these files right now if you intend to help seed them for a while after you're done. Certain downloaders will get much faster download rates than others, depending on your IP address. This is due to peering relationships our hosting provider has which we're utilizing to get some initial seeds out as fast as possible. If your download is going incredibly slow or not going at all, don't worry, it'll pick up within the next couple days.\n\nrecap.\n\nfound on the nin board \nhere: &lt;a href=&quot;\nhttp://forum.nin.com/bb/read.php?18,378166&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.nin.com/bb/read.php?18,378166&lt;/a&gt;\n\nalso visit http://thisoneisonus.org/\n\nbecause the third torrent is to large the Portland footage is not available... you can get it by clicking here... &lt;a href=&quot;\nhttp://download.nin.com/lightsinthesky/Nine_Inch_Nails_Live_Video_2008_12_07_Portland_OR.torrent&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://download.nin.com/lightsinthesky/Nine_Inch_Nails_Live_Video_2008_12_07_Portland_OR.torrent&lt;/a&gt;\n","torrent":{"xt":"urn:btih:27073a5c2c62f87b1d2a2f92b577c1925a252151","amp;dn":"HD+video%3A++Lights+In+The+Sky+NIN+video+footage%2C+Victoria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27073a5c2c62f87b1d2a2f92b577c1925a252151","infoHashBuffer":{"type":"Buffer","data":[39,7,58,92,44,98,248,123,29,42,47,146,181,119,193,146,90,37,33,81]},"announce":[],"urlList":[]}}