{"title":"Plan_9_from_Outer_Space-1959-Ed_Wood-VOSTFR.mp4","uid":9238355,"size":224652471,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2719a53e8cb08b8cbaaddc14f02f74cb775fe738&amp;dn=Plan_9_from_Outer_Space-1959-Ed_Wood-VOSTFR.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"countryman71","files":1,"time":1385223796,"description":"Plan 9 from Outer Space (originally titled Grave Robbers from Outer Space, or simply known as Plan 9) is a 1959 American science fiction thriller film written and directed by Edward D. Wood, Jr. and released by Distributors Corporation of America (as Valiant Pictures). The film stars Gregory Walcott, Mona McKinnon, Tor Johnson and Maila &quot;Vampira&quot; Nurmi. The film bills Bela Lugosi posthumously as a star, although silent footage of the actor had been shot by Wood for other, unfinished projects just before Lugosi's death in 1956.\n\nThe plot of the film involves extraterrestrial beings who are seeking to stop humans from creating a doomsday weapon that would destroy the universe. In the course of doing so, the aliens implement &quot;Plan 9&quot;, a scheme to resurrect Earth's dead as what modern audiences would consider zombies (called &quot;ghouls&quot; in the film itself) to get the planet's attention, causing chaos.\n\nFor years the film played on television in relative obscurity, until 1980, when authors Michael Medved and Harry Medved dubbed Plan 9 from Outer Space the &quot;worst movie ever made&quot;. Wood was posthumously awarded the Medveds' Golden Turkey Award as the worst director ever.\n\n","torrent":{"xt":"urn:btih:2719a53e8cb08b8cbaaddc14f02f74cb775fe738","amp;dn":"Plan_9_from_Outer_Space-1959-Ed_Wood-VOSTFR.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2719a53e8cb08b8cbaaddc14f02f74cb775fe738","infoHashBuffer":{"type":"Buffer","data":[39,25,165,62,140,176,139,140,186,173,220,20,240,47,116,203,119,95,231,56]},"announce":[],"urlList":[]}}