{"title":"Coast to Coast AM June 13, 2013 - Channeling &amp; Healing","uid":8586577,"size":56151171,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:274a1527885ce034678e22025be2fc8cfbde99b5&amp;dn=Coast+to+Coast+AM+June+13%2C+2013+-+Channeling+%26amp%3B+Healing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1371546489,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-13-13\nHost:\nGeorge Noory\nGuests:\nLinda  Freud,             David  Freud,                   Dr. Eric  Pearl\nIn the first half, Linda Freud, a medical intuitive who channels spirits and angels to help clients, and her husband, author and spiritual researcher David Freud spoke about her healing process. She receives specific information about a person's nutritional deficiencies and energetic imbalances, and then channels the appropriate natural remedies or detoxification protocols. The Freuds have concluded that many people suffer from the toxic effects of mercury (typically from dental amalgam or vaccines) accumulated in the body. The mercury contributes to chronic or degenerative conditions, but these effects can be lessened through chelation therapy, David remarked. \nLinda described angels as messengers of God, and said she communicates with a number of the archangels, as well as her clients' guardian angels and spirit guides. &quot;Sometimes the room can feel very crowded depending on how much consciousness a person has, and how connected they are,&quot; she said of her counseling sessions. Interestingly, Linda noted that she's also in touch with the spirit of Sigmund Freud (a distant relative of David's), who has expressed interest in trying to refashion the field of psychology for the 21st century via her channeling. Linda also channels a more modern day celebrity-- the spirit of Michael Jackson, who has informed her that his soul has not been able to ascend to the light, due to psychic damage from the propofol injections, and the fact that his body wasn't buried in a timely manner. \n----------------------------- \nIn the latter half, Dr. Eric Pearl shared his perspective on how to reconnect with the unlimited Universal energy that enables us to heal, as well as access higher states of being. His methodology of &quot;reconnective healing&quot; transcends specific energy healing techniques. &quot;Scientists are recognizing and discovering when they study reconnective healing that we are accessing levels of light and information that they say they've simply not seen on the planet prior to now,&quot; he commented, adding that the current generation is anchoring in the next level of human evolution. \nIn his new work, Pearl presents the wisdom of a multidimensional intelligence named Solomon who is channeled by Frederick Ponzlov. Solomon speaks about reconnective healing, as well as accessing deeper levels and understanding of who we are. Solomon is giving us the insight to reveal our souls to ourselves-- a discovery process of the greater self emerging, Pearl explained. &quot;The manifestation of this physical form... is an expression that we have chosen, not unlike a mask of sorts that we choose to wear in this plane. We give it a deeper inner expression as we connect our soul to the greater universe,&quot; he quoted from the Solomon channeling. \nNews segment guests: Ryan Mauro, Mitch Battros, Peter Davenport\nWebsite(s):\n thehealinggift.com\n solomonspeaks.com\n thereconnection.com\nBook(s):\n The Healing Gift\n Solomon Speaks on Reconnecting Your Life \n The Reconnection: Heal Others, Heal Yourself\n","torrent":{"xt":"urn:btih:274a1527885ce034678e22025be2fc8cfbde99b5","amp;dn":"Coast+to+Coast+AM+June+13%2C+2013+-+Channeling+%26amp%3B+Healing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"274a1527885ce034678e22025be2fc8cfbde99b5","infoHashBuffer":{"type":"Buffer","data":[39,74,21,39,136,92,224,52,103,142,34,2,91,226,252,140,251,222,153,181]},"announce":[],"urlList":[]}}