{"title":"Hans en Grietje de Musical(2Lions-Team)","uid":5771353,"size":4189614407,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2764457d3e7c3344bd197f32319d813d3da41181&amp;dn=Hans+en+Grietje+de+Musical%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"juutje","files":-1,"time":1282126357,"description":"Van Hoorne Theaterproducties presenteert Hans &amp; Grietje De musical\n\nIn seizoen 2009-2010 presenteert Van Hoorne Theaterproducties met veel trots de sprankelende familievoorstelling Hans &amp; Grietje De Musical. De rol van Snoepheks zal vertolkt worden door zangeres en musicalactrice Linda Wagenmakers. De titelrollen zijn in handen van Roy van den Akker (Hans) en Katiuscia Principato (Grietje). Beiden hebben hun sporen reeds verdiend in diverse musicalproducties. Marcel Smid zal net als bij Roodkapje De Musical de regie voor zijn rekening nemen. De castleden kennen het genre van Van Hoorne Theaterproducties als geen ander en dat staat garant voor een succesvolle, energieke en humoristische voorstelling.\n\nLinda Wagenmakers\nLinda Wagenmakers verwierf grote bekendheid met de hoofdrol in de musicalproductie Miss Saigon en haar winst op het Nationale Songfestival 2000, met het nummer No Goodbye?s. Tevens vervulde Linda de titelrol in de Nederlandse versie van de Disneyfilm Mulan I en II. Van Hoorne Theaterproducties is bijzonder trots Linda Wagenmakers te mogen presenteren in Hans &amp; Grietje De Musical. Haar muzikale- en acteerkwaliteiten, bijzonder gevoel voor humor en haar grote enthousiasme maken haar tot de ideale Snoepheks!\n\nHet verhaal\nDiep in het bos woont houthakker Jonathan. Hij neemt je mee in een bijzonder verhaal, naar een plek waar elke kinderdroom werkelijkheid wordt. Waar het gras zoeter is dan honing en kleurrijke limonadefonteinen uit de grond spuiten. Een verhaal over moed, verleiding en liefde.\n\nHans en Grietje worden op een donkere avond helemaal alleen in het bos achtergelaten door hun ouders. Na dagen lopen komen Hans en Grietje bij een bijzonder huisje, alles is van snoep, koek en lekkernij. De hongerige kinderen kunnen zich niet bedwingen en doen zich tegoed aan de chocolade raamluiken, speculazen dakpannen en marsepeinen muren. Plots klinkt er een stem vanuit het huisje, in de deuropening staat een extravagante suikertante. Ze nodigt Hans en Grietje uit binnen verder te eten, maar is haar gastvrijheid wel echt of begint voor Hans en Grietje het avontuur nu pas echt?\n\nDe Telegraaf: 'Naast het spelplezier dat er van alle kanten afstraalt, vallen verder de sterke zangkwaliteiten van vrijwel alle spelers op.'\n\nRTL Boulevard: 'Hilarisch moment in Hans &amp; Grietje De Musical!'\n\nAlgemeen Dagblad: 'De musical is bepaald peutervriendelijk, minder eng, dan het vermaarde sprookje van de gebroeders Grimm.'\n\nGenre: Familie Entertainment\nSpeelduur: CA 100 minuten\nTaal: Nederlands gesproken\nBron: Retail\nCompressie: n.v.t.\nCategorie : Beeld\nFormaat : DVD5\nBron : Retail\nBestand: ISO\n\nOndertitels : Geen\n\nGenre : Musical\nKinderfilm \n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions-site.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl/index.php&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n","torrent":{"xt":"urn:btih:2764457d3e7c3344bd197f32319d813d3da41181","amp;dn":"Hans+en+Grietje+de+Musical%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2764457d3e7c3344bd197f32319d813d3da41181","infoHashBuffer":{"type":"Buffer","data":[39,100,69,125,62,124,51,68,189,25,127,50,49,157,129,61,61,164,17,129]},"announce":[],"urlList":[]}}