{"title":"Parliament - Funkentelechy vs. the Placebo Syndrome","uid":6366545,"size":291855497,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:27de65ed5614596aacf20c9ee43ac9999bca3fa0&amp;dn=Parliament+-+Funkentelechy+vs.+the+Placebo+Syndrome&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulikes","files":10,"time":1304528995,"description":"Even though it's only 6 songs long, this LP is pure P-Funk perfection. Everything came together on this one. Ironically, it's also the first Parliament project that didn't feature all of the original Parliaments (Fuzzy, Grady, and Calvin had departed by this time). Nevertheless, George's astonishing conceptual visions came shining through with crystal clarity. This landmark album also permanently changed popular music forever, as Bernie Worrell's synthesized bass lines on 'Flash Light' led the way in popularizing that style in the next two decades to come, and the ferocious hand claps became a staple in R&amp;B music all the way down to this day (Not since Martha &amp; The Vandellas' 1967 hit 'Jimmy Mack' has hand claps been so forcefully used). Even the one non-concept song, 'Wizard Of Finance', is worth listening to over and over again. 'Placebo Syndrome' has to be one of the deepest songs that Parliament ever produced (It was good to see Billy Nelson back on the scene). George's spoken theatrics were in rare form on both 'Sir Nose D'Voidoffunk' and 'Funkentelechy', as was Bootsy's bass work. And 'Bop Gun'....In the fall of '77, I had been hearing this song on the radio, with some guy singing as a bunch of girls yelled &quot;On guard! Protect yourself!&quot; in the background, and I didn't realize that it was Parliament, because the radio DJ's never tell you who's singing the songs. The song sounded so different from what they did on the 'Dr. Funkenstein' LP that I just didn't make the connection, although I do remember thinking to myself that the guy singing was trying hard to sound like Glen Goins. Of course, when I found out, my reaction was &quot;That was PARLIAMENT???&quot;, and the quest to buy that album was on! I fully agree with the previous reviewer about this LP, bookended with 'Mothership' and 'Motor-Booty', being Parliament's masterpieces ('The Clones Of Dr. Funkenstein' was good, but it seemed to be an extension of 'Mothership Connection'). 5 stars isn't enough for this one. \n\nTrack listing:\n1. Bop Gun (Endangered Species)\t8:35\n2. Sir Nose D Voidoffunk\t10:10\n3. Wizard Of Finance\t4:24\n4. Funkentelechy\t10:59\n5. Placebo Syndrome\t4:23\n6. Flash Light\t5:46\n\nEnjoy and please seed!!!","torrent":{"xt":"urn:btih:27de65ed5614596aacf20c9ee43ac9999bca3fa0","amp;dn":"Parliament+-+Funkentelechy+vs.+the+Placebo+Syndrome","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27de65ed5614596aacf20c9ee43ac9999bca3fa0","infoHashBuffer":{"type":"Buffer","data":[39,222,101,237,86,20,89,106,172,242,12,158,228,58,201,153,155,202,63,160]},"announce":[],"urlList":[]}}