{"title":"Tomb Raider Legend: The MOVIE!!","uid":4032087,"size":781653668,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:28e1745a041b56a79e7c2efb97ce1f3cbaf550c4&amp;dn=Tomb+Raider+Legend%3A+The+MOVIE%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EmoxChick910","files":1,"time":1203220979,"description":"When Lara Croft was just nine years old, the executive airplane carrying her and her mother crashed into the Himalayas, leaving them as the only survivors. After taking shelter in the ruins of an ancient temple, Lara discovered an ornate stone dais holding a sword. Unwittingly activating the ancient artefact, Lara watched in horror as her mother vanished in front of her eyes. Devastated, she left the pink book behind, in which the directions of how to open the portal were written.\n\nYears later, Lara, with the help of Zip and Alister, travels to the ancient civilization of Tiwanaku in Bolivia, following a tip from university peer Anaya Imanu. Lara attempts to find an ornate stone dais similar to the one in Nepal. She soon runs into James Rutland and his mercenaries on the edge of Lake Titicaca, where the dais is situated. Old memories are brought back to haunt Lara as Rutland implies that her deceased friend Amanda Evert is still alive. After an intense battle, Rutland as well as most of the mercenaries escape in the helicopter. Left alone, Lara then examines the stone dais and finds that it is similar to the one in Nepal. A sword must be placed into the slot of the dais in order to activate the portal. Desperate to understand what happened to her mother, Lara decides to retrieve the sword. \n\nWill she find the sword and bring her mother back? Or will enemies get in her way?\nOnly one way to find out!\n\n(Game avaliable on PS2, XBOX, and PC)\n\n\n\nMade with: Windows Movie Maker\n\nThanks to: Window&amp;#039;s Movie Maker, jfbrittes from YouTube (Helped with the clips), and all who are watching! ","torrent":{"xt":"urn:btih:28e1745a041b56a79e7c2efb97ce1f3cbaf550c4","amp;dn":"Tomb+Raider+Legend%3A+The+MOVIE%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28e1745a041b56a79e7c2efb97ce1f3cbaf550c4","infoHashBuffer":{"type":"Buffer","data":[40,225,116,90,4,27,86,167,158,124,46,251,151,206,31,60,186,245,80,196]},"announce":[],"urlList":[]}}