{"title":"Susanne Ahlenius - Dödligt dubbelspel - Svensk","uid":14683220,"size":375005834,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2b6060e00e79e3c912d8ef0a5b9dcf2e64333ee0&amp;dn=Susanne+Ahlenius+-+D%26ouml%3Bdligt+dubbelspel+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"totomas1","files":43,"time":1464110049,"description":"Susanne Ahlenius - Dödligt dubbelspel\r\n\r\nAlice Wiklund och Tyler Rimes på Scotland Yard har precis avslutat en omfattande mordutredning. Rättegången är över, seriemördaren sitter inlåst men det räcker inte för Alice. Trots att hon höll på att bli hans sjunde offer vill hon få svar på en fråga som ständigt förföljer henne. Kan ondska gå i arv?\r\nAlice får kontakt med Ryan Kendall, seriemördarens tvillingbror. Kommer han att kunna ge henne ett svar?\r\n\r\nAlice har återkommande mardrömmar, svårt att hantera vardagen. Hon vill gå vidare, lägga utredningen bakom sig men det är lättare sagt än gjort och när hon hittar ett skelett av ett barn i familjen Kendalls herrgård, blir det början på en mordutredning som kommer att ta dem trettio år tillbaka i tiden.\r\n\r\nPå teamets bord hamnar ytterligare en mordutredning, en kvinna har hittats död i ett badkar, strypt. Fallet är identiskt med mordet på Alices väninna, Ann von Walden, men vad har de gemensamt förutom tillvägagångssättet?\r\nUtredningen tar en oväntad vändning och Alices kollega, Tyler inser att han är anledningen till att Ann blev mördad. Alice &amp; Co blir indragna i ett dödligt dubbelspel där någon sitter med en vinnande hand och väntar på nästa giv.\r\n\r\nFölj med i den spännande fortsättningen, där mord, svek och erotik blandas i en spännande och underhållande berättelse.\r\n\r\nDödligt dubbelspel är andra delen i en trilogi. Den första delen, Dödlig åtrå, utkom 2014 och den tredje delen, Dödlig hämnd, planeras till 2017.\r\n\r\n\r\nMp3-CD\r\nUppläsare: Callin Öhrvall Delmar\r\nSpeltid: Ca 9 timmar","torrent":{"xt":"urn:btih:2b6060e00e79e3c912d8ef0a5b9dcf2e64333ee0","amp;dn":"Susanne+Ahlenius+-+D%26ouml%3Bdligt+dubbelspel+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b6060e00e79e3c912d8ef0a5b9dcf2e64333ee0","infoHashBuffer":{"type":"Buffer","data":[43,96,96,224,14,121,227,201,18,216,239,10,91,157,207,46,100,51,62,224]},"announce":[],"urlList":[]}}