{"title":"True Faith (Garth Ennis) (1997)","uid":5279061,"size":21214992,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2b639bbf71324eaf64a75bea3e1a596809196710&amp;dn=True+Faith+%28Garth+Ennis%29+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"primaryrip","files":2,"time":1263485009,"description":"True Faith \nwith Warren Pleece\nDC/Vertigo, 1997 \n\nGod is not so much dead as a dead loss. Or so it seems to the young Nigel Gibson, for whom religion can offer only the torment and loneliness of no friends, no sex and no drinking. A light comes into Nigel's life, however, when he is enlisted by former true believer and toilet-product salesman, the deranged Terry Adair, to join an armed, purgative, Church-burning campaign to rid life on Earth of the holy ordure that obstructs it. \n\n&quot;Garth Ennis is perhaps the most interesting new writer to emerge in the last ten years and Warren Pleece perhaps the most interesting artist. In True Faith, their talents combine to create a fresh and original work, the power and charm of which last long after one closes its pages.&quot; \nAlan Moore \n\n&quot;I'm quite prepared to endorse this book at the top of my voice and until my throat is raw. True Faith is a thing of beauty and a joy forever. True Faith is a glorious, anarchic assault on the values that made Britain great. It's probably even a scathing indictment of something or other. Above all, it's a bloody good laugh and if you can't see the funny side of crucified alsatians, burning churches and mass murder then you're probably well enough to go home. As for me, I'll stay here and gloat over this ruthless, shameless desecration of everything that normal, decent folk hold dear.&quot; \nGrant Morrison, from the introduction \n","torrent":{"xt":"urn:btih:2b639bbf71324eaf64a75bea3e1a596809196710","amp;dn":"True+Faith+%28Garth+Ennis%29+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b639bbf71324eaf64a75bea3e1a596809196710","infoHashBuffer":{"type":"Buffer","data":[43,99,155,191,113,50,78,175,100,167,91,234,62,26,89,104,9,25,103,16]},"announce":[],"urlList":[]}}