{"title":"Piratas.del.Caribe.3.en.el.fin.del.mundo_Spanish-English_DVDRip.","uid":4336212,"size":912029536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2b9e53dea547b775e6ee99aa36697bab93405ef5&amp;dn=Piratas.del.Caribe.3.en.el.fin.del.mundo_Spanish-English_DVDRip.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fasgaroth","files":1,"time":1218326640,"description":"PIRATAS DEL CARIBE: EN EL FIN DEL MUNDO\n(Pirates of the Caribbean: At world&amp;#039;s end)\n\nDirecciÃƒÂ³n: Gore Verbinski.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2007.\nDuraciÃƒÂ³n: 168 min.\nGÃƒÂ©nero: AcciÃƒÂ³n, aventuras, fantasÃƒÂ­a.\nInterpretaciÃƒÂ³n: Johnny Depp (capitÃƒÂ¡n Jack Sparrow), Orlando Bloom (Will Turner), Keira Knightley (Elizabeth Swann), Geoffrey Rush (capitÃƒÂ¡n Barbossa), Bill Nighy (Davy Jones), Chow Yun Fat (capitÃƒÂ¡n Sao Feng), Stellan SkarsgÃƒÂ¥rd (Bill Turner), Jack Davenport (James Norrington), Naomie Harris (Tia Dalma), Tom Hollander (lord Cutler Beckett), Jonathan Pryce (gobernador Weatherby Swann).\nGuiÃƒÂ³n: Ted Elliott y Terry Rossio; basado en los personajes creados por Ted Elliott, Terry Rossio, Stuart Beattie y Jay Wolpert.\nProducciÃƒÂ³n: Jerry Bruckheimer.\nMÃƒÂºsica: Hans Zimmer.\nFotografÃƒÂ­a: Dariusz Wolski.\nMontaje: Stephen E. Rivkin y Craig Wood.\nDiseÃƒÂ±o de producciÃƒÂ³n: Rick Heinrichs.\nVestuario: Penny Rose.\nEstreno en USA: 24 Mayo 2007.\nEstreno en EspaÃƒÂ±a: 24 Mayo 2007.\n\nSINOPSIS\n\nLord Cutler Beckett (Tom Hollander), de la CompaÃƒÂ±ÃƒÂ­a de las Indias Orientales, se ha hecho con el control del aterrador barco fantasma, el HolandÃƒÂ©s Errante, y de su malvado y vengativo capitÃƒÂ¡n, Davy Jones (Bill Nighy). Ahora el HolandÃƒÂ©s surca imparable los siete mares, destruyendo sin piedad los barcos piratas a las ÃƒÂ³rdenes del almirante Norrington (Jack Davenport). Will Turner (Orlando Bloom), Elizabeth Swann (Keira Knightley) y el capitÃƒÂ¡n Barbossa (Geoffrey Rush) se embarcan en una desesperada bÃƒÂºsqueda para reunir a los Nueve Lores de la Corte de Brethren: su ÃƒÂºnica esperanza de vencer a Beckett, al HolandÃƒÂ©s Errante y a su Armada. Pero uno de los lores ha desaparecido: el capitÃƒÂ¡n Jack Sparrow (Johnny Depp), el mejor y el peor pirata de todos los tiempos que ahora estÃƒÂ¡ encerrado en la bodega de Davy Jones debido a su encuentro con el monstruoso Kraken. En una alianza cada vez mÃƒÂ¡s frÃƒÂ¡gil, nuestros hÃƒÂ©roes deberÃƒÂ¡n viajar primero al exÃƒÂ³tico y peligroso Singapur y enfrentarse al pirata chino, el capitÃƒÂ¡n Sao Feng (Chow Yun Fat), con el fin de conseguir las cartas de navegaciÃƒÂ³n y un barco que les lleve al fin del mundo para rescatar a Jack. A medida que se van sucediendo las traiciones, estÃƒÂ¡ cada vez mÃƒÂ¡s claro que Jack, Will, Elizabeth, Sao Feng y Barbossa tienen sus propios planes, y ninguno puede confiar en los demÃƒÂ¡s. Asimismo, cada uno debe elegir un bando y crear una alianza final para librar una ÃƒÂºltima batalla.","torrent":{"xt":"urn:btih:2b9e53dea547b775e6ee99aa36697bab93405ef5","amp;dn":"Piratas.del.Caribe.3.en.el.fin.del.mundo_Spanish-English_DVDRip.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b9e53dea547b775e6ee99aa36697bab93405ef5","infoHashBuffer":{"type":"Buffer","data":[43,158,83,222,165,71,183,117,230,238,153,170,54,105,123,171,147,64,94,245]},"announce":[],"urlList":[]}}