{"title":"Harmonic Magic Books 1 &amp; 2 by P. E. Padilla","uid":15519064,"size":4792798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2bb28f8cd509c0be614747d21e598f49c67321d5&amp;dn=Harmonic+Magic+Books+1+%26amp%3B+2+by+P.+E.+Padilla&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"steve-kon","files":8,"time":1470724544,"description":"Vibrations #1: Sam Sharp has never been what people would call sociable. Affected profoundly by his father’s death when Sam was very young, he developed into a solitary and self-sufficient person. When he finds himself transported to Gythe, a world that is completely different from his home, yet strangely familiar, he is forced to seek help. Sam’s nature wars with his need to rely on the strangers he meets—a warrior, a scholar, a monk, and a telepathic creature—to help him find a way back to his own world. \r\nWhen Sam finds that he has an affinity for the peculiar vibrational energy that exists in Gythe, he realizes it is his only chance for going home. But there is only one person who may have the knowledge to help him: the Gray Man, a tyrannical vibrational energy master with plans to rule the world. Can Sam trust others to aid him and to prepare him for the ultimate confrontation with the Gray Man, to learn the secrets of this mysterious adversary? If so, will he even be capable of using the vibrational energy himself to return home, or will he die in this strange new world? \r\n\r\nHarmonics #2: A fledgling government in threat of extinction. Three artifacts of power that hold the key to safety, or to doom. A powerful energy user who will stop at nothing to rule over all. \r\nSam Sharp faces the end of all he knows and loves on his adopted world of Gythe. Ayim Rasaad, mage and expert fighter, along with her army of humans and mutated creatures, searches for three items of power. If she collects them, she will be unstoppable in her plot to conquer the world. \r\nWith only the smallest seed of a plan and not nearly enough information to act with certainty, Sam and his allies must foil Rasaad’s campaign or watch as Gythe is plunged into the darkness of her tyrannical rule. The people call him the Hero of Gythe. Now he needs to prove that he deserves the title","torrent":{"xt":"urn:btih:2bb28f8cd509c0be614747d21e598f49c67321d5","amp;dn":"Harmonic+Magic+Books+1+%26amp%3B+2+by+P.+E.+Padilla","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bb28f8cd509c0be614747d21e598f49c67321d5","infoHashBuffer":{"type":"Buffer","data":[43,178,143,140,213,9,192,190,97,71,71,210,30,89,143,73,198,115,33,213]},"announce":[],"urlList":[]}}