{"title":"Pink Floyd - Time (Screen Film)","uid":5138265,"size":19546610,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2bc3435e4b709894a1929b7d284a95c89b0e1ef5&amp;dn=Pink+Floyd+-+Time+%28Screen+Film%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RosaMannen","files":1,"time":1256675418,"description":"Pink Floyd were an English rock band who, in the late 1960s, earned recognition for their psychedelic and space rock music, and in the 1970s, as they evolved, for their progressive rock music. Pink Floyd's work is marked by philosophical lyrics, sonic experimentation, innovative album cover art, and elaborate live shows. One of rock music's most critically acclaimed and commercially successful acts, the group has sold over 200 million albums worldwide including 74.5 million certified units in the United States. Pink Floyd influenced contemporary artists such as Nine Inch Nails and Dream Theater.\n\nPink Floyd were formed in 1965, soon after Syd Barrett joined The Tea Set, a group that consisted of architecture students Nick Mason, Roger Waters, Richard Wright and Bob Klose. Klose left shortly after, but the group had moderate mainstream success and were a popular fixture on London's underground music scene. The erratic behaviour of Barrett prompted his colleagues to add guitarist and singer David Gilmour to the line-up. Following Barrett's departure, bass player and singer Roger Waters became the lyricist and dominant figure in the band, which thereafter achieved worldwide critical and commercial success with the concept albums The Dark Side of the Moon, Wish You Were Here, Animals, and rock opera The Wall.\n\nWright left the band in 1979, and Waters in 1985, but Gilmour and Mason (joined by Wright) continued recording and touring under the name Pink Floyd. Waters used legal means to try to keep them from using the name, declaring Pink Floyd a spent force, but the parties reached an out-of-court settlement allowing Gilmour, Mason and Wright to continue as Pink Floyd. The band again enjoyed worldwide success with A Momentary Lapse of Reason (1987) and The Division Bell (1994), and Waters continued as a solo musician, releasing three studio albums. Although for some years relations between Waters and the remaining three members were sour, the band reformed for a one-off performance at Live 8.\n\n\n\n.ooOO ROSA MANNEN 2009 OOoo.\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     &lt;a href=&quot;\nhttp://thepiratebay.se/user/RosaMannen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RosaMannen&lt;/a&gt;\t","torrent":{"xt":"urn:btih:2bc3435e4b709894a1929b7d284a95c89b0e1ef5","amp;dn":"Pink+Floyd+-+Time+%28Screen+Film%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bc3435e4b709894a1929b7d284a95c89b0e1ef5","infoHashBuffer":{"type":"Buffer","data":[43,195,67,94,75,112,152,148,161,146,155,125,40,74,149,200,155,14,30,245]},"announce":[],"urlList":[]}}