{"title":"aquarium fish radio shows","uid":6790738,"size":115146010,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2be385aaea93309583fa03652fb235d4d2f6dce1&amp;dn=aquarium+fish+radio+shows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":23,"time":1320254299,"description":"This torrent is a compilation of radio shows from Pet Fish Talk.\n\nEnjoy.\n\nPet Fish Talk is a weekly Internet talk show about keeping pet fish in aquariums, fish bowls, and ponds. The Bailey Brothers, Tom and Nevin, two of America's most trusted aquarium experts, host each show, and they invite you to call and talk with them about your pet fish.\n\nBEST MEDIA PLAYER IN THE UNIVERSE - VLC MEDIA PLAYER - www.videolan.org/vlc\n\nLive Foods for Pet Fish 46-minutes\nIn this Special Pet Fish Talk Show Tom and Nevin talk about the many type of live foods that they have collected and raised to feed to the pet fish living in their aquariums and ponds.\n\nBuying used aquariums 14-minutes\nIn this Special Pet Fish Talk Show Tom and Nevin talk about buying used aquariums. What to look for? What to avoid? How much to pay? Nevin just bought a 125-gallon used aquarium for Tom, and that aquarium was just like new for less than one-fourth of the new price. Plus the seller threw in a very good pump and an expensive light fixture that both fit the aquarium. Yikes, Nevin got a great deal and tells you how he did it in this show.\n\nDenitrification 92-minutes\nIn this Special Pet Fish Talk Show first Tom and Robert in New Jersey talk about denitrification, then Tom and Nevin talk about denitrification of aquarium water.\n\nAquarium Photography 12-minutes\nIn this Special Pet Fish Talk Show Tom gives some useful practical tips on how to quickly improve your skills taking pictures of fish in aquariums. Farther down on this page are more details about a specific camera and about how to adjust the setting on this camera to photograph pet fish in aquariums.\n\nCyanobacteria 17-minutes\nIn this Special Pet Fish Talk Show Tom tells the story about getting Cyanobacteria in his aquarium. Everything turned dark green!\n\nBreeding Oscars 42-minutes\nTom and Nevin talk with Dave from Kansas about Breeding Oscars.\n\nAquarium Water 45-minutes\nThis Special Pet Fish Talk Show features a discussion by the Bailey Brothers, Tom and Nevin, about water for freshwater aquariums.\n\nMbuna Cichlids\nThis Special Pet Fish Talk Show features a discussion by the Bailey Brothers, Tom and Nevin, about keeping and breeding the Mbuna Cichlids from the rocky shores of Lake Malawi in East Africa.\n\nSmall Snails\nThis Special Pet Fish Talk Show features a discussion by the Bailey Brothers, Tom and Nevin, about how to get rid of small snails that sometimes infest aquariums.\n\nGuppies and Mollies\nThis Special Pet Fish Talk Show features a discussion by the Bailey Brothers, Tom and Nevin, about keeping and breeding Guppies and Mollies.\n\nFreshwater Stingrays\nThis Special Pet Fish Talk Show features a discussion by the Bailey Brothers, Tom and Nevin, about Freshwater Stingrays.\n\nBreeding Pet Fish\nThis Special Pet Fish Talk Show features a discussion by the Bailey Brothers, Tom and Nevin, with Steve Corandan, a professional fish breeder in Florence, New Jersey.\n\nThe 7 Essentials\nThis Special Pet Fish Talk Show features a discussion by the Bailey Brothers, Tom and Nevin, about the most important essential care that your fish must have to live in good health with a minimum of stress, disease, and other problems. Every responsible fish keeper should know the information on this page.\n\nYour New Aquarium\nThis Special Pet Fish Talk Show features a discussion by the Bailey Brothers, Tom and Nevin, and includes lots of tips and important details about setting up a new aquarium and how to avoid problems.\n\nChampion Koi\nThis Special Pet Fish Talk Show features audio and video from the 18th Annual Open Koi Show presented by the Koi Club of San Diego at the Del Mar Fairgrounds in San Diego, California.\n\nMoving Your Fish\nThis Special Pet Fish Talk Show features a discussion by the Bailey Brothers, Tom and Nevin, about how to move your pet fish.\n\nDiscus Fish 70-minutes\nThis Special Pet Fish Talk Interview features Robert in New Jersey talking with Tom and Nevin about his Discus Fish.\n\nVisiting a Fish Breeder 23-minutes\nThis Special Pet Fish Talk Interview features Josh from Ohio, an avid aquarist, who arranged to visit the home of a tropical fish breeder with over 100 aquariums in his basement.\n\nBreeding Angel Fish 45-minutes\nThis Special Pet Fish Talk Show features an interview with Steve Corandan, a professional fish breeder, who gives many useful tips about how to breed Freshwater Angel Fish.\n\nBreeding Ram Cichlids 32-minutes\nThis Special Pet Fish Talk Interview features Nathan from Riverside, California, who recently spawned a beautiful pair of Ram Cichlids in his planted aquarium. In this interview Nathan explains that he spent two hours on the phone calling live fish stores to find some Rams, then drove a long way to Palm Desert, California, to buy a pair that spawned the next day in his 40-gallon aquarium.\n\nBreeding Convicts Cichlids 72-minutes\nThis Special Pet Fish Talk Interview features Steve Corandan, a professional fish breeder, who talks about how he breeds freshwater Convict Cichlids.","torrent":{"xt":"urn:btih:2be385aaea93309583fa03652fb235d4d2f6dce1","amp;dn":"aquarium+fish+radio+shows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2be385aaea93309583fa03652fb235d4d2f6dce1","infoHashBuffer":{"type":"Buffer","data":[43,227,133,170,234,147,48,149,131,250,3,101,47,178,53,212,210,246,220,225]},"announce":[],"urlList":[]}}