{"title":"Tombstone - Wyatt Earp, O.K. Corral Etc. (Osprey Raid 41)","uid":8693073,"size":4214840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2cbb78bb5ba27d0bfef019cf74d64715cc9f9e04&amp;dn=Tombstone+-+Wyatt+Earp%2C+O.K.+Corral+Etc.+%28Osprey+Raid+41%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1373916691,"description":"The Gunfight at the OK Corral on 26 October 1881 is one of the most enduring stories of the Old West. It led to a series of violent incidents that culminated in the Vendetta Ride, in which Wyatt Earp, Doc Holliday, and several other gunslingers went after their rivals the Cowboys.\n\nLike most tales of the Wild West, the facts are buried under layers of myth, and the line between good guys and bad guys is blurry. Wyatt Earp, leader of the so-called &quot;good guys&quot;, was charged with stealing horses in the Indian Territory in 1870 and jumped bail. Becoming a buffalo hunter and gambler, he got into several scrapes and earned a reputation as a gunfighter. Several times he helped lawmen arrest outlaws, but usually his assistance came more because of a personal grudge against the criminal than any real respect for law and order. He even got fired from a police job in Wichita for beating up a political rival.\n\nSo it was in Tombstone. He settled there in 1879 along his three brothers and &quot;Doc&quot; Holliday. Virgil and Morgan Earp worked as lawmen. As the Earps became a power in the town, investing in some businesses and starting others, they were soon at loggerheads with the Clanton Gang, the so-called &quot;Cowboys.&quot; In that time and place, honest cowboys called themselves &quot;ranchers&quot; and the term &quot;cowboy&quot; was reserved for rustlers and other unsavory characters.\n\nThe Tombstone Cowboys had Cochise County sheriff John Behan in their pocket and the struggle between the Earps and Cowboys was partially a political rivalry. It was also because the Earps had invested in the stagecoaches and the Cowboys liked to rob them. There was an element of lingering differences over the Civil War as well, something common in Wild West feuds. The Earps and friends were mostly Republican Northerners, while the Cowboys were mostly Democrats and former Confederates. This distinction wasn't clear cut, however, as at least one Confederate veteran rode with the Earps.\n\nBrawls and threats between the two sides became more frequent and culminated in a showdown near the OK Corral. Several Cowboys were loitering around hoping to attack Doc Holliday, so the Earps and Holliday decided to arrest them on the grounds that they were carrying weapons in town. In the shootout three Cowboys were killed and Virgil and Morgan Earp wounded.\n\nThe Cowboys thirsted for revenge and shot Morgan Earp in the back five months later. Virgil was crippled in a separate shooting. Taking Morgan's body to Tucson, the surviving Earp brothers and Holliday spotted Frank Stillwell, one of the Cowboys suspected of murdering Morgan. They shot him down. A large posse under John Behan, including many Cowboys, chased after the Earps but never caught them.\n &lt;a href=&quot;\nhttp://www.amazon.com/Tombstone-Wyatt-Corral-Vendetta-1881-82/dp/1780961928/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373909428&amp;sr=1-1&amp;keywords=tombstone+osprey&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Tombstone-Wyatt-Corral-Vendetta-1881-82/dp/1780961928/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373909428&amp;sr=1-1&amp;keywords=tombstone+osprey&lt;/a&gt;","torrent":{"xt":"urn:btih:2cbb78bb5ba27d0bfef019cf74d64715cc9f9e04","amp;dn":"Tombstone+-+Wyatt+Earp%2C+O.K.+Corral+Etc.+%28Osprey+Raid+41%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cbb78bb5ba27d0bfef019cf74d64715cc9f9e04","infoHashBuffer":{"type":"Buffer","data":[44,187,120,187,91,162,125,11,254,240,25,207,116,214,71,21,204,159,158,4]},"announce":[],"urlList":[]}}