{"title":"Die Hard.1988-2007.BRRip.Collection.SWESUB-Dark_Lord","uid":6668627,"size":9799768061,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:2d21f8d15cbd525f62659784753db8c1553fd293&amp;dn=Die+Hard.1988-2007.BRRip.Collection.SWESUB-Dark_Lord&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"DarkLord2011","files":5,"time":1315793744,"description":"                              Die Hard (1988)\n\n\n\nHigh above Los Angeles has a group of terrorists has seized a building, taken hostages and declared war. But one man has managed to avoid being discovered ... a police officer who is not in service. He is alone ... tired ... and the last hope for all.\n\nBruce Willis stars as New York City Detective John McClane, newly arrived in Los Angeles to spend Christmas with his estranged wife (Bonne Bedelia).\n\nWhile McClane waits for his wife's office party to break, taking the terrorist leader, Hans Gruber (Alan Rickman) and his brutal executioner (Alexander Godunov) gathers hostages, McClane manage to escape. With only a service revolver and his cunning, McClane starts his one-man war against terrorsiterna.\n\nA great hard-boiled action from beginning to end, DIE HARD is chock full of hÃƒÂ¶gpulserande voltage.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0095016/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0095016/&lt;/a&gt;\n\n\n\n\n-----------------------------------------------------------------------------------\n                              \n                              Die Hard 2 (1990)\n\n\nOne snowy Christmas Eve night in Washington, a group of terrorists has seized an international airport, with thousands of tourists hostage. The terrorists are a bunch of renegade commandos led by a ferocious, bloodthirsty officer (William Sadler), who has come to save a knarkung from justice. They are prepared for everything, with one exception: John McClane, a vacant police officer struck by a sense of dÃƒÂ©jÃƒÂ  vu.\n\nBruce Willis returns as the heroic cop who not only fight back-terrorists, but also against an incompetent flyplatspolischef (Dennis Franz), the icy commander of the army anti-terrorist force (John Amos) and a deadly snowstorm. The runways are littered with death and destruction, and McClane battling against time. His wife (Bonnie Bedelia) is trapped in one of the plan that is circulating somewhere over the airport, desperate for fuel.\n\nWar on all fronts in a tense, JET-PROPELLED journey through excitement and terror.\nFasten your seatbelts!\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0099423/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0099423/&lt;/a&gt;\n\n-----------------------------------------------------------------------------------\n\n                       Die Hard With A Vengeance.(1995)\n\nNow, Bruce Willis returns as John McClane in the police, the third and most lavish &quot;Die-Hard&quot; movie. In their hunt for cruel revenge exposes the mad criminal Simon McClane for a deadly game with time bombs. A game that cripples the entire New York. While he is forced to run the gauntlet on and under the streets of New York. McClane getting unexpected help from Zeus, who along with McClane tries to stop Simon from carrying out the largest robbery in U.S. history\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0112864/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0112864/&lt;/a&gt;\n\n\n-----------------------------------------------------------------------------------\n                          \n\n                          Live Free or Die Hard (2007)\n\n\nFor the fourth time we will see action icon John McClane, played by Bruce Willis, put a spoke in the wheel of a bunch of crooks.\n\nAn attack on U.S. computer networks all threaten to destroy the entire nation's infrastructure. The men behind the attack have predicted all measures which the authorities can take to prevent them, but they did not forecast what might happen when John McClane gives himself into the game\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0337978/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0337978/&lt;/a&gt;\n\n\n\n              \n\n\n                Visit *-- | Tankan. com | --* for more movies and series!\n\n","torrent":{"xt":"urn:btih:2d21f8d15cbd525f62659784753db8c1553fd293","amp;dn":"Die+Hard.1988-2007.BRRip.Collection.SWESUB-Dark_Lord","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d21f8d15cbd525f62659784753db8c1553fd293","infoHashBuffer":{"type":"Buffer","data":[45,33,248,209,92,189,82,95,98,101,151,132,117,61,184,193,85,63,210,147]},"announce":[],"urlList":[]}}