{"title":"Give War and Peace A Chance - Andrew D. Kaufman","uid":12105558,"size":8909599,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fa8422176e2645328a41727f054fe0f418eeb6b&amp;dn=Give+War+and+Peace+A+Chance+-+Andrew+D.+Kaufman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1436447753,"description":"From a popular Tolstoy scholar: an entertaining, thought-provoking, and accessible argument for why War and Peace is more relevant to readers now than ever.\n\n&quot;Nothing less than inspiring.&quot;--Jay Parini, author of The Last Station\n\n&quot;Mischievously compelling....An attaboy to Kaufman for reminding us of this novel's  relevance to our anxious century.&quot; --*The Miami Herald*\n\n&quot;This lively appreciation...should persuade many hesitant readers to try scaling the heights of War and Peace sooner rather than later.--Publisher's Weekly \n\nConsidered by many critics the greatest novel ever written, War and Peace is also one of the most feared. And at 1,500 pages, it's no wonder why. Still, new editions keep appearing. In July 2009 Newsweek put War and Peace at the top of its list of 100 great novels and a 2007 edition of the AARP Bulletin, read by millions, included the novel in their list of the top four books everybody should read by the age of fifty. A New York Times survey from 2009 identified War and Peace as the world classic you're most likely to find people reading on their subway commute to work. What might all those Newsweek devotees, senior citizens, and harried commuters see in a book about the Napoleonic Wars in the early 1800s?\n\nA mirror of our times.\n\nWar and Peace is many things. It is a love story, a family saga, a war novel. But at its core it's a novel about human beings attempting to create a meaningful life for themselves in a country torn apart by social change, political divisiveness, and spiritual confusion.\n\nGive War and Peace a Chance takes readers on a journey through War and Peace that reframes their very understanding of what it means to live through troubled times and survive them. Touching on a broad range of topics, from courage to romance, parenting to death, Kaufman demonstrates how Tolstoy's wisdom can help us live fuller, more meaningful lives. The ideal companion to War and Peace, this book will also be enjoyable to those who have never read a word of Tolstoy, making that masterpiece more approachable, relevant, and fun","torrent":{"xt":"urn:btih:2fa8422176e2645328a41727f054fe0f418eeb6b","amp;dn":"Give+War+and+Peace+A+Chance+-+Andrew+D.+Kaufman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fa8422176e2645328a41727f054fe0f418eeb6b","infoHashBuffer":{"type":"Buffer","data":[47,168,66,33,118,226,100,83,40,164,23,39,240,84,254,15,65,142,235,107]},"announce":[],"urlList":[]}}