{"title":"Titanic Dublado  DVD-R","uid":10061135,"size":4687769600,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:307b0034317ec7bcf20aec2d9230f312e2f34873&amp;dn=Titanic+Dublado++DVD-R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jonassanabria2","files":1,"time":1398729970,"description":"Titanic is a 1997 American epic romantic disaster film directed, written, co-produced, co-edited and partly financed by James Cameron. A fictionalized account of the sinking of the RMS Titanic, it stars Leonardo DiCaprio and Kate Winslet as members of different social classes who fall in love aboard the ship during its ill-fated maiden voyage.\n\nCameron's inspiration for the film was predicated on his fascination with shipwrecks; he wanted to convey the emotional message of the tragedy and felt that a love story interspersed with the human loss would be essential to achieving this. Production on the film began in 1995, when Cameron shot footage of the actual Titanic wreck. The modern scenes were shot on board the Akademik Mstislav Keldysh, which Cameron had used as a base when filming the wreck. A reconstruction of the Titanic built at Playas de Rosarito in Baja California, scale models, and computer-generated imagery were used to recreate the sinking. The film was partially funded by Paramount Pictures and 20th Century Fox, and, at the time, was the most expensive film ever made, with an estimated budget of $200 million.","torrent":{"xt":"urn:btih:307b0034317ec7bcf20aec2d9230f312e2f34873","amp;dn":"Titanic+Dublado++DVD-R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"307b0034317ec7bcf20aec2d9230f312e2f34873","infoHashBuffer":{"type":"Buffer","data":[48,123,0,52,49,126,199,188,242,10,236,45,146,48,243,18,226,243,72,115]},"announce":[],"urlList":[]}}