{"title":"The Woman Chaser ISO","uid":5523283,"size":4159313920,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:30a2ccccac68e784164c9fe4214169495300eb55&amp;dn=The+Woman+Chaser+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"totallycereal","files":-1,"time":1272696954,"description":"The Woman Chaser\n\nDVD ISO 3.87GB\nVHS to DVD transfer, NTSC 4:3, Stereo\n87 minutes with chapters\nEnglish\nNo subtitles\n\n\nIndie writer-director Robinson Devor, in his feature debut, creates a retro Hollywood of cocktail lounges, gimlet glasses and finned Caddies with confident style, capturing L.A. in a crisp mix of surreal and real. The landmark Capitol Records building is a well-used part of the backdrop.\n\nBased on a pulp novel by Charles Willeford, Devor's script is a clever satire that tells the mean story of a used-car salesman (Patrick Warburton) driven by mad inspiration to become a moviemaker, a character whose pimpish savvy is powered by a hopelessly dangerous blend of ego and cluelessness.\n\nA standout scene -- maybe a classic -- features the bearish Warburton, half naked, dancing balletically with his ex-dancer mother (Lynette Bennett). 'The Woman Chaser' is funny but edgy, too. Warburton's obsessed salesman, Richard Hudson, is perversely charming. His main gig in life is self-aggrandizement. Trysts with a secretary, his virginal stepsister and a Salvation Army worker have no emotional impact on him -- he's fired up only by his quest to become an artist.\n\nThe car salesman's bravado, deadpan delivery and bordering-on-psycho emotional makeup make for a strangely compelling character. Hudson turns over his business to oddball flunkies in order to chase his dream of making a film titled 'The Man That Got Away,' about a trucker who runs over a little girl and her dog.\n\nIn a world strewn with the sort of amusing misfits who were staples of precorporate Hollywood, the salesman enlists the backing of his mother's husband -- a failed movie director -- and lands a deal with a steely studio mogul. Ultimately, there's a showdown over artistic freedom that costs 'The Woman Chaser' some of its edge. But that's a mere quibble with a film that's so much fun. -- Peter Stack, SF Chronicle\n\n\nPatrick Warburton ... Richard Hudson\nEugene Roche ... Used Car Dealer\nRon Morgan ... Bill\nEmily Newman ... Laura\nPaul Malevich ... Leo\nLynette Bennett ... Mother\nJoe Durrenberger... Chet\nErnie Vincent ... The Man\nMax Kerstein ... Ruggerio\nMel Hampton ... Flaps\nPat Crowder ... Salvation Army Woman\nMarilyn Rising ... Becky\n\n\nNY Times article: http://www.dennismcmillan.com/charleswillefo/jesseny.htm\n\nBuy the VHS at Amazon","torrent":{"xt":"urn:btih:30a2ccccac68e784164c9fe4214169495300eb55","amp;dn":"The+Woman+Chaser+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30a2ccccac68e784164c9fe4214169495300eb55","infoHashBuffer":{"type":"Buffer","data":[48,162,204,204,172,104,231,132,22,76,159,228,33,65,105,73,83,0,235,85]},"announce":[],"urlList":[]}}