{"title":"FS2004 Australian Simulations Glasair III","uid":3762001,"size":39943647,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:30cc74e4a2ff4d256bec2419c2080e198954f4a5&amp;dn=FS2004+Australian+Simulations+Glasair+III+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"borak stiller","files":1,"time":1186183603,"description":" &lt;a href=&quot;http://www.aussim.com.au/glasair/default.asp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.aussim.com.au/glasair/default.asp&lt;/a&gt;\n\nBe sure to go to the Aircraft Control Panel Software after manual installation of the RIP and set up your preferences for textures, payloads, glass, settings etc.(File: G3.acp.exe).\n\nTo use the Aircraft Control Panel software (in the Australian Simulation Folder in your Main FS9 installation), just enter any name you want and any serial based on this one : XXXX-XXXX-XXXX-XXXX (use digits only). You may wait for a few seconds (sometimes up to ~20 seconds) before the OK button highlights.\n\nlllllllllllllllllllllllllllllllllll\nAustralian Simulation (developers of the flightsim.com product of the year for 2004 ÃƒÂ¢?? GA single class) is proud to announce the release of their latest product, The Glasair III . \n\nModeled in stunning detail inside and out, this package offers virtual pilots the chance to fly one of the world\\&amp;#039;s highest performance single engine aircraft. Fast, agile and with advanced avionics and instrumentation, this aircraft will test the skills of novice and experienced aviators alike. \n\nModeled in 3D Studio max 7, the level of detail achieved for the external model and virtual cockpit is outstanding. The interior model also features new virtual head latency to really put you in the pilot\\&amp;#039;s seat! \nIt can be flown completely from Virtual Cockpit or 2D panel, day or night, and the virtual cockpit features new smooth gauge technology , gauges so smooth that you\\&amp;#039;ll wonder why every aircraft isn\\&amp;#039;t developed in this way. \n\nThe package also features a complete stereo sound set, accurate flight dynamics, and detailed documentation ÃƒÂ¢?? nothing has been left out! \n\nAlso included in this package is Australian Simulation\\&amp;#039;s renowned Aircraft Control Panel software, which allows you to customize your aircraft right down to the gender of your pilot and passenger and more!\n\nThe feature list is long, but here are the highlights:\nDetailed 3D model (interior &amp; exterior) \nAccurate flight dynamics (tested by real Glasair owners/builders) \nStereo sound set \n2 Liveries (more free skins coming...) \nComplex avionics\nIncluding twin Garmin GNS-430 GPS/COM/NAV units, Sandel SN3308 eHSI and VM1000 Engine Management System. \nVirtual Head Latency\nExperience the forces of flight with the \\&quot;VHL\\&quot; system. Completely controllable from within the simulator, or from the ACP software. \nDynamic occupants and cargo\nSet Male, Female pilots with varying hair and skin colour. Weight in baggage hold affects visibility of items within. \nSmooth Gauge Technology\nEvery analogue gauge in the VC has been animated using our unique \\&quot;keyframeless\\&quot; system to provide the smoothest gauge motion we\\&amp;#039;ve ever seen. \nAircraft Control Panel Software\nOur renowned ACP has been included with the package allowing you to customise every aspect of the Glasair III. From adjusting on board weight, to setting the gender and appearance of the occupants. Also features the \\&quot;Add textures\\&quot; options to easily add, edit and view your skins. \nFor more information, feel free to download the Operating Handbook (user manual) and Aircraft Control Panel manual from the downloads page. \n \n  \n","torrent":{"xt":"urn:btih:30cc74e4a2ff4d256bec2419c2080e198954f4a5","amp;dn":"FS2004+Australian+Simulations+Glasair+III+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30cc74e4a2ff4d256bec2419c2080e198954f4a5","infoHashBuffer":{"type":"Buffer","data":[48,204,116,228,162,255,77,37,107,236,36,25,194,8,14,25,137,84,244,165]},"announce":[],"urlList":[]}}