{"title":"Missiles of the World(amitks93)","uid":5999191,"size":103719840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:314a89aa21f198baf43f61f84f95dfde556f2c98&amp;dn=Missiles+of+the+World%28amitks93%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"amitks93","files":3,"time":1291128955,"description":"Missiles of the World By Michael John, Haddrick Taylor\nPublisher: MacMillan Publishing Company 1982 | 96 Pages | ISBN: 0684165937 | PDF | 91 MB\n\n\n\nThe first edition of this book was launched into completely unexplored skies. Companion to Helicopters of the World, Military Aircraft of the World and Civil Aircraft of the World, Missiles of the World found a ready market. Engineers, members of the armed services, the press and broadcasting, government agencies, and thousands of others had clearly been waiting for a book that would give accurate, updo-date information on every guided missile known to be in service or under development throughout the world. When the Strategic Arms Limitation Talks between America and Russia brought the first agreement (SALT I) to reduce the crippling cost of an arms race with weapons of ultimate destruction, this focused attention on the subject of the book.\nMuch more has been learned about Soviet missiles since 1972 and. indeed, since the second edition of the book appeared in 1978. The precise number of intercontinental ballistic missiles IICBMsl and submarine-launched ballistic missiles (SLBMs) deployed by the two super powers became common knowledge after the signature of the SALT I agreement. Information on new developments has been made available more freely, now that continuous surveillance by satellite is accepted as a guarantee of good faith by both sides. As a result, it has been possible to pack a truly astonishing amount of new material into this third edition of Missiles of the World, requiring a more extensive revision than is customary for even its Aircraft' companions.\nAll information is presented in a way that can be understood easily by non-technical readers. This task has been assisted by correspondents, manufacturers and official organisations in more than a dozen countries. To them all is expressed our sincere gratitude, for these terrifying weapons can serve their purpose only if their potential is fully understood. Our world will remain safe from major war only so long as the leaders of both East and West are left in no doubt of what would be the consequences of any act of major aggression.\nThis is third edition.","torrent":{"xt":"urn:btih:314a89aa21f198baf43f61f84f95dfde556f2c98","amp;dn":"Missiles+of+the+World%28amitks93%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"314a89aa21f198baf43f61f84f95dfde556f2c98","infoHashBuffer":{"type":"Buffer","data":[49,74,137,170,33,241,152,186,244,63,97,248,79,149,223,222,85,111,44,152]},"announce":[],"urlList":[]}}