{"title":"Jaunten - Honor Raconteur.azw","uid":7446610,"size":520810,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:318649d0ab3033e66ab76e36f22016171aa9ce88&amp;dn=Jaunten+-+Honor+Raconteur.azw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"488331284","files":-1,"time":1342386741,"description":"There was a time when magic was welcome in the country of Chahir, but that was nearly two centuries ago. Now, all forms of magic are strictly forbidden. Anyone caught using magic, or possessing magical abilities, are immediately imprisoned and executed. For Garth, that policy is a problem. As Garth approaches his sixteenth birthday, he realizes that he definitely has magical abilities. What's worse, he has no control over them. In order to stay alive, he only has one choice-he must leave his homeland, Chahir, and flee into the neighboring country, Hain. The journey isn't an easy one; he still has to make it out of Chahir without alerting anyone as to his abilities. What Garth doesn't know is that getting to Hain, and the Academy for All Magic, is going to be the easy part. Garth goes into Hain for one reason only; he wants training for his out-of-control magical powers. So how does he become a member of an exclusive magical clan known as the Jaunten; adopted by a magically enhanced colt; best friends with a gifted Witch; and foster brother of a four year old Mage? Let's just say he has a gift for finding trouble.","torrent":{"xt":"urn:btih:318649d0ab3033e66ab76e36f22016171aa9ce88","amp;dn":"Jaunten+-+Honor+Raconteur.azw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"318649d0ab3033e66ab76e36f22016171aa9ce88","infoHashBuffer":{"type":"Buffer","data":[49,134,73,208,171,48,51,230,106,183,110,54,242,32,22,23,26,169,206,136]},"announce":[],"urlList":[]}}