{"title":"Comprehensive Materials Processing [13 Volume Set]","uid":13393239,"size":236838522,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31edab2e0d9bd49f3dfbe398c422ad06941dc930&amp;dn=Comprehensive+Materials+Processing+%5B13+Volume+Set%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1454354142,"description":"Comprehensive Materials Processing provides students and professionals with a one-stop resource consolidating and enhancing the literature of the materials processing and manufacturing universe. It provides authoritative analysis of all processes, technologies, and techniques for converting industrial materials from a raw state into finished parts or products. Assisting scientists and engineers in the selection, design, and use of materials, whether in the lab or in industry, it matches the adaptive complexity of emergent materials and processing technologies. Extensive traditional article-level academic discussion of core theories and applications is supplemented by applied case studies and advanced multimedia features. Coverage encompasses the general categories of solidification, powder, deposition, and deformation processing, and includes discussion on plant and tool design, analysis and characterization of processing techniques, high-temperatures studies, and the influence of process scale on component characteristics and behavior.\r\nAuthored and reviewed by world-class academic and industrial specialists in each subject field\r\nPractical tools such as integrated case studies, user-defined process schemata, and multimedia modeling and functionality\r\nMaximizes research efficiency by collating the most important and established information in one place with integrated applets linking to relevant outside sources","torrent":{"xt":"urn:btih:31edab2e0d9bd49f3dfbe398c422ad06941dc930","amp;dn":"Comprehensive+Materials+Processing+%5B13+Volume+Set%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31edab2e0d9bd49f3dfbe398c422ad06941dc930","infoHashBuffer":{"type":"Buffer","data":[49,237,171,46,13,155,212,159,61,251,227,152,196,34,173,6,148,29,201,48]},"announce":[],"urlList":[]}}