{"title":"evasi0n7-mac-1.0.0-5fbc5de0c23654546ad78bd75a703a5724e15d39.dmg.","uid":9389656,"size":30536027,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:32127033b9726d6ea3def645f2a0c32e77f859cc&amp;dn=evasi0n7-mac-1.0.0-5fbc5de0c23654546ad78bd75a703a5724e15d39.dmg.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bgsudeep","files":-1,"time":1387861978,"description":"evasi0n is software package that allows the user to jailbreak and remove limitations imposed on many Apple branded devices running Apple's iOS software. This version is capable of jail-breaking the iOS devices that are compatible with all iPhone, iPod touch, iPad and iPad mini models running iOS 7.0 through 7.0.4.\n\nRequirements\n* 5 minutes of your time!\n* A computer, running Mac OS X (10.6 minimum)\n* An iPhone, iPad or iPod running iOS 7.0 through 7.0.4 (you may check in Settings / General / About =&gt; Version)\n* A USB cable to connect the device to the computer\n\n\nImportant! Read me!\n\n* Backup your device using iTunes (or iCloud) before using evasi0n. If something breaks, you'll always be able to recover your data.\n* Please disable the lock passcode of your iOS device before using evasi0n. It can cause issues.\n* Avoid all iOS and iTunes related tasks until evasi0n is complete. Why not just enjoy a brief break from the computer to stretch your legs?\n* If the process gets stuck somewhere, it's safe to restart the program, reboot the device (if necessary by holding down Power and Home until it shuts down), and rerun the process.\n* If you get an error on OS X 10.8 saying that evasi0n can't be opened, control-click (or right-click) the app and on the revealed context menu, choose 'Open.' On the ensuing dialogue box, choose 'Open' as well.\n* Warning! Over The Air updates of iOS 7 are known to create an issue and make the jailbreak fail. Some devices are then stuck on the Apple Boot Logo. Until we fix that, please restore your device to 7.0.4. with iTunes first.\n* Warning! Many Cydia tweaks are not yet compatible with iOS 7. Please always backup your phone before installing new tweaks from Cydia as your iPhone could be stuck in the boot process. The situation will improve as developers will update their software.\n\nSource: http://evasi0n.com/\n","torrent":{"xt":"urn:btih:32127033b9726d6ea3def645f2a0c32e77f859cc","amp;dn":"evasi0n7-mac-1.0.0-5fbc5de0c23654546ad78bd75a703a5724e15d39.dmg.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32127033b9726d6ea3def645f2a0c32e77f859cc","infoHashBuffer":{"type":"Buffer","data":[50,18,112,51,185,114,109,110,163,222,246,69,242,160,195,46,119,248,89,204]},"announce":[],"urlList":[]}}