{"title":"Peter Leeson - The Invisible Hook","uid":8787032,"size":201313302,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:32315136e7cf86aca665179674139bb4f40885a0&amp;dn=Peter+Leeson+-+The+Invisible+Hook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zis123","files":1,"time":1375851681,"description":"Pack your cutlass and blunderbuss - it's time to go a-pirating! The Invisible Hook takes readers inside the wily world of late 17th- and early 18th-century pirates. With swashbuckling irreverence and devilish wit, Peter Leeson uncovers the hidden economics behind pirates' notorious, entertaining, and sometimes downright shocking behavior.\nWhy did pirates fly flags of Skull &amp; Bones? Why did they create a &quot;pirate code&quot;? Were pirates really ferocious madmen? And what made them so successful? The Invisible Hook uses economics to examine these and other infamous aspects of piracy. Leeson argues that the pirate customs we know and love resulted from pirates responding rationally to prevailing economic conditions in the pursuit of profits.\nThe Invisible Hook looks at legendary pirate captains like Blackbeard, Black Bart Roberts, and Calico Jack Rackam, and shows how pirates' search for plunder led them to pioneer remarkable and forward-thinking practices. Pirates understood the advantages of constitutional democracy - a model they adopted more than 50 years before the United States did so. Pirates also initiated an early system of workers' compensation, regulated drinking and smoking, and in some cases practiced racial tolerance and equality. Leeson contends that pirates exemplified the virtues of vice - their self-seeking interests generated socially desirable effects and their greedy criminality secured social order. Pirates proved that anarchy could be organized.\nRevealing the democratic and economic forces propelling history's most colorful criminals, The Invisible Hook establishes pirates' trailblazing relevance to the contemporary world.","torrent":{"xt":"urn:btih:32315136e7cf86aca665179674139bb4f40885a0","amp;dn":"Peter+Leeson+-+The+Invisible+Hook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32315136e7cf86aca665179674139bb4f40885a0","infoHashBuffer":{"type":"Buffer","data":[50,49,81,54,231,207,134,172,166,101,23,150,116,19,155,180,244,8,133,160]},"announce":[],"urlList":[]}}