{"title":"ITVV - Virgin Atlantic 747-200 Classic HQ version!","uid":7076440,"size":1677289222,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:32c76a16a54518e636c981437a4823d648d6ebee&amp;dn=ITVV+-+Virgin+Atlantic+747-200+Classic+HQ+version%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wobblyprop","files":1,"time":1330821021,"description":"Take a seat in the cockpit with the aircrew on a Virgin Atlantic scheduled return flight from London Gatwick to Miami, Florida. This documentary-style programme will show all that happens on the flightdeck and what is required to fly this classic Jumbo jet, one of the last to still employ a Flight Engineer.\n\nThe three-man crew from Virgin Atlantic will guide you around the various systems that make this a truly &quot;Classic&quot; Jumbo aircraft. You will see and hear all key aspects of the flight and aircraft operation from the aircrew's perspective. This multi-camera shoot programme will introduce you to such systems as the INS (Inertial Navigation System), Selcal (which is a selective calling system and is part of the aircraft communications system) and many others.\n\nThere is a detailed tour and explanation of the Flight Engineers systems panel, encompassing the engine secondary instrumentation, electrics, fuel, hydraulic and air conditioning panels. Plus the aircrew will show you the many systems which make up the overhead panel and take you through topics such as TCAS (Traffic alert and Collision Avoidance System), NATS (North Atlantic Track System) and a flight progress Chart. \n\nThis programme is suitable for anyone who is interested in how these aircraft fly. A truly fascinating programme for all to enjoy on one of the world's best loved airliners.\n\n\n*************************************************************************************\nThe long awaited HQ version of the Virgin 747-200 classic, 1848kbps bitrate.  Very watchable!\n************************************************************************************","torrent":{"xt":"urn:btih:32c76a16a54518e636c981437a4823d648d6ebee","amp;dn":"ITVV+-+Virgin+Atlantic+747-200+Classic+HQ+version%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32c76a16a54518e636c981437a4823d648d6ebee","infoHashBuffer":{"type":"Buffer","data":[50,199,106,22,165,69,24,230,54,201,129,67,122,72,35,214,72,214,235,238]},"announce":[],"urlList":[]}}