{"title":"Linkin Park - Numb","uid":4726354,"size":107194372,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3318cc96aa474cef0cafeb1c66ac412c328fa362&amp;dn=Linkin+Park+-+Numb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1234780586,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Numb&quot; is the thirteenth and final song on the 2003 album Meteora by the rock band Linkin Park, and is also the album's third single. &quot;Numb&quot; topped the Modern Rock Tracks chart for 6 weeks in 2003 and 6 weeks in 2004, making it the only song in history to be the most successful song of the year on the chart for 2 years. It was later comined with Jay-Zs song Encore to create Numb/Encore, a massive hit for both artists which was featured on the album Collision Course.\n\nDirected by Joe Hahn, the indoor scenes of the video are set in a church in Los Angeles, while the outdoor scenes are set in Prague, the Czech Republic. The school interiors, the classroom, the corridor and the outside playground are set in the Johannes Kepler's Gymnasium in Prague.\n\nThe music video follows the domestic and social problems faced during a day in the life of a young (portrayed by Briana Evigan), unpopular female student. The girl apparently spends much of her time drawing pictures, revealing that she probably has dreams of becoming an artist. She is largely ignored and ridiculed at school, considering that when she is told off by the teacher for drawing in class everybody laughs at her, when she trips on the stairs nobody stops to help her up, and that when she tries to join a group of girls at a lunch table they immediately get up and leave. Also, there is a scene where her mother is ridiculing her for not being the daughter she wanted. There are also self-inflicted cut marks on her arms, which actually say &quot;NUMB&quot; - the title of the song. She is shown near the end of the video rubbing the marks after a stressful day, and then deciding to work off her stress by throwing paint instead. At the end of the video, the girl runs into the church that the band was playing in, almost as if she heard them.\n\nThroughout almost the whole video Chester Bennington has his eyes closed, they can just be seen open when he blinks as he sings the word: &quot;Tightly&quot; from the second verse starting: &quot;Can't you see that you're smothering me?&quot;\n\nMuchMusic's 100 Best Videos ranked it at #40.\n\nThe track became one of Linkin Park's most critically-acclaimed songs, as well as one of their most commercially successful, peaking at #11 on the U.S. Billboard Hot 100 on February 24, 2004 and topping Billboard's Mainstream Rock Tracks and Modern Rock Tracks charts. It was also successful in Oceania, peaking at #10 in Australia and #13 in New Zealand.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:3318cc96aa474cef0cafeb1c66ac412c328fa362","amp;dn":"Linkin+Park+-+Numb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3318cc96aa474cef0cafeb1c66ac412c328fa362","infoHashBuffer":{"type":"Buffer","data":[51,24,204,150,170,71,76,239,12,175,235,28,102,172,65,44,50,143,163,98]},"announce":[],"urlList":[]}}