{"title":"Fragments From Reimarus","uid":15238997,"size":1871928,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:370b36c18e853e8ec71d50b747a1bb3510032e2b&amp;dn=Fragments+From+Reimarus&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twp6045","files":1,"time":1467919131,"description":"I discovered this book while reading &quot;The End of Biblical Studies&quot; by Hector Avalos. I uploaded that book here: http://uj3wazyk5u4hnvtk.onion/torrent/14385622/The_End_of_Biblical_Studies_-_Hector_Avalos\r\n\r\nIn the summary to chapter 4, entitled The Unhistorical Jesus, Avalos writes: &quot;The quest for the historical Jesus is an abject failure. After hundreds of years, and probably millions of person-hours, reconstructions of Jesus are no better than the one of Reimarus in the eighteen century. Reimarus had nearly exhausted the critical search for any historicity, and he found mostly a myth. Even if we do not accept all of Reimarus's conclusions, we can say that he had a plausible scenario based on verifiable phenomena that we can see exist today (people steal bodies; people can lie; invention requires only an imagination and a pen, etc.).&quot;\r\n\r\nThis short book (128 pages) was written before 1768, published in German by 1778, and translated into English in 1879.\r\n\r\nHere is Amazon's summary:\r\n\r\nThe name of Reimarus is scarcely known in this country beyond a very select circle of English students, while his writings, so far as I know, have never been popularly known, nor frequently quoted by English commentators. The reason for this will perhaps become apparent to any one who will take the trouble, or give himself the pleasure, of reading this book. Reimarus is too thorough, too uncompromising, too faithful to his task, to suit the present attitude of mind and heart towards the central figure of the orthodox religion.\r\n\r\nThe following pages have been translated — truly as a work and labour of love — from Lessing's Fragments by the Unknown of Wolfenbiittel. The translator kindly permits me to share the honour of presenting these Fragments to the notice of English readers. With the actual work of translation I have had nothing to do; my part has been only editorial, and limited to a few modifications of expression, which have not altered the sense.\r\n\r\nThe method, of criticism adopted by Reimarus commends itself most of all by its extreme lucidity and fidelity to the Gospel records. He teaches in such a manner as to reach even the most untutored mind; and so far is he from forcing upon us his own interpretations that he habitually makes the New Testament speak for itself, and every charge which he has been compelled to bring against the founders of Christianity is sustained and proved by their own testimony. I have not yet seen in the English language a work on this subject carrying such irresistible force of argument","torrent":{"xt":"urn:btih:370b36c18e853e8ec71d50b747a1bb3510032e2b","amp;dn":"Fragments+From+Reimarus","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"370b36c18e853e8ec71d50b747a1bb3510032e2b","infoHashBuffer":{"type":"Buffer","data":[55,11,54,193,142,133,62,142,199,29,80,183,71,161,187,53,16,3,46,43]},"announce":[],"urlList":[]}}