{"title":"Dynasty Dysected","uid":3377232,"size":3171429613,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3863e4a629dfce62b8f4723662459fd10bc16021&amp;dn=Dynasty+Dysected&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"veztra","files":33,"time":1125515228,"description":"Learn to play Paintball from three-time World Champions Team Dynasty! Team Dynasty teaches the fundamentals of competition Paintball to players of all ages and all levels.\n\nMystery has always surrounded Team Dynasty?s strategies and technical abilities ever since they exploded onto the Professional Paintball circuit in 2001. But now, after the success of their world-renowned Paintball clinics, the Dynabots decided it was about time to package their curriculum into a DVD, making their knowledge available to everybody. In this DVD you will learn what it takes to become the best Paintball player you can be, and what it takes to win as a team. This video is one of the most advanced and informative Paintball videos ever made. Dynasty Dysected teaches you everything you will need to compete at any level. \n\nDynasty Dysected uses digitally enhanced diagrams to illustrate every drill that Dynasty teaches. You will be walked through every move and drill by all members of the squad. This DVD captures every Dynasty player in action in some of the highest profile tournament leagues the world has seen, including the Millennium Series in Europe, as well as the PSP in the States.\n\nPlease visit www.dynastypaintball.com to purchase Dynasty Dysected Vol 1, as well as many other products that Dynasty has to offer. In addition, you can visit to find a store near you.\n\nDynasty Dysected has an instructional run time of approximately 50 minutes.","torrent":{"xt":"urn:btih:3863e4a629dfce62b8f4723662459fd10bc16021","amp;dn":"Dynasty+Dysected","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3863e4a629dfce62b8f4723662459fd10bc16021","infoHashBuffer":{"type":"Buffer","data":[56,99,228,166,41,223,206,98,184,244,114,54,98,69,159,209,11,193,96,33]},"announce":[],"urlList":[]}}