{"title":"Quintuplets TVRip XviD","uid":6944084,"size":4114374668,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:38776fec4a4b724c2019a8804c7b3623255e6c77&amp;dn=Quintuplets+TVRip+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1326152762,"description":"Quintuplets\n\nQuintuplets is an American sitcom that aired twenty-two episodes on FOX from June 16, 2004 through January 12, 2005. The program starred Andy Richter and Rebecca Creskoff as parents of a family of quintuplets and their various adventures in parenthood.\n\nThe story is set in Nutley, New Jersey, and is on the face of it a typical family sitcom. Much of the storyline focuses on the difficulty of supporting a large family of teens, both financially and emotionally, as they grapple with the reality that, grown up, they simply aren't as cute and interesting as they were when they were born.\n\nThe house is a typical three-bedroom family home. The male quints share a room with bunk beds, the female quints share another room. The kitchen contains a double wide beer cooler as a refrigerator, and the basement contains a walk-in freezer, both to store the large amounts of food such a large family requires. The situation may be seen to parallel and parody the old sitcom The Brady Bunch, by highlighting the impracticality of the large family.\n\nThe theme song, Suk or Shine was performed by Chris and Tad.\n\nCreator: Mark Reisman\nStars: Andy Richter, Rebecca Creskoff and Ryan Pinkston \nYear: 2004 | 2005 \nEpisodes: 22\nSeason: 1","torrent":{"xt":"urn:btih:38776fec4a4b724c2019a8804c7b3623255e6c77","amp;dn":"Quintuplets+TVRip+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38776fec4a4b724c2019a8804c7b3623255e6c77","infoHashBuffer":{"type":"Buffer","data":[56,119,111,236,74,75,114,76,32,25,168,128,76,123,54,35,37,94,108,119]},"announce":[],"urlList":[]}}