{"title":"Mysterious Creatures: A Guide to Cryptozoology (2 Vols){BBS}","uid":7462996,"size":8950151,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38811efbdd91b3e1c78ddb1e83e7aab20cb7d849&amp;dn=Mysterious+Creatures%3A+A+Guide+to+Cryptozoology+%282+Vols%29%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1342889827,"description":"In this fascinating encyclopedia, author George M. Eberhart provides a comprehensive catalog of nearly 1,000 cryptids - unknown animals usually reported through eyewitness accounts and not yet described by science. Cryptids are the stuff of folklore, hoaxes, and genuine scientific breakthroughs. There are 400 now-classified cryptids once considered either extinct or pure fantasy. The cryptozoologist's job is to strip away the myth, misidentification, and mystery - and separate fact from fiction.\nMysterious Creatures covers everything from dinosaurs and the emala-ntouka, an elephant-killing dinosaur-like animal of central Africa, to searches for the Loch Ness monster, Bigfoot, and other cryptozoological hoaxes. Entries about specific animals include the derivation or meaning of each cryptid's name, its scientific name, variant names, a physical description, behavior, description of tracks, habitat, significant sightings, present status, and possible explanations. Illustrations and photographs accompany many entries. The book also includes resources and references for further information.\n\n\nABC-CLIO (December 2002)\nEnglish\n1576072835\n722 pages ","torrent":{"xt":"urn:btih:38811efbdd91b3e1c78ddb1e83e7aab20cb7d849","amp;dn":"Mysterious+Creatures%3A+A+Guide+to+Cryptozoology+%282+Vols%29%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38811efbdd91b3e1c78ddb1e83e7aab20cb7d849","infoHashBuffer":{"type":"Buffer","data":[56,129,30,251,221,145,179,225,199,141,219,30,131,231,170,178,12,183,216,73]},"announce":[],"urlList":[]}}