{"title":"Guide to Elizabethan England  (BBC 2013 - Complete Series)","uid":8621135,"size":1512019796,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3882f3147d77e7dc3e5f0cfd7513ffdd0ba44e21&amp;dn=Guide+to+Elizabethan+England++%28BBC+2013+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Robin1966","files":9,"time":1372375582,"description":"HISTORY DOCUMENTARY: The Time Traveller's Guide to Elizabethan England\nOn: BBC 2    \nDate: Friday 31st May 2013 (Already shown)\nTime: 21:00 to 22:00 (1 hour long)\n\nThe Common People.  Episode 1.\nDr. Ian Mortimer offers a unique travel guide to the world of Queen Elizabeth the First, taking us on a present-tense journey through this Golden Age of English history. This episode he reveals the life of the common people of the Elizabethan age. Whilst most people have images of courtiers, lavish palaces and fine clothes, the reality is that most of the country is extremely poor. Ian also looks at the religious controversies threatening to pull the county apart, as well as the astoundingly cruel attitudes that were common at the time.\n\n\nHISTORY DOCUMENTARY: The Time Traveller's Guide to Elizabethan England\nOn: BBC 2    \nDate: Friday 7th June 2013 (Already shown)\nTime: 21:00 to 22:00 (1 hour long)\n\nThe Rich. Episode 2.\nDr Ian Mortimer offers a unique travel guide to the world of Queen Elizabeth the First, taking us on a present-tense journey through this Golden Age of English history. This episode he introduces the world of the Elizabethan rich and privileged. Money alone is not enough to blend in with the Royal Court. A complex code of dress, greetings, behaviour and much more exists and even something as simple as an out of date outfit may result in exile from high society. It is literally a cut-throat world, where spies circle the great and good and one false word could cost everything. The wealthy also had one problem all of their own; the Queen herself - and bearing the cost of a Royal progress.\n\n\nHISTORY DOCUMENTARY: The Time Traveller's Guide to Elizabethan England\nOn: BBC 2    \nDate: Friday 14th June 2013 (Already shown)\nTime: 21:00 to 22:00 (1 hour long)\n\nBrave New World. Episode 3.\nIn the final episode of the series, Dr Ian Mortimer travels through the world of a new and upwardly mobile section of Elizabethan society - the middle class. In a groundbreaking new way of exploring history, Ian takes viewers on a present-tense journey through this golden age of English history. Along the way he visits Stratford-Upon-Avon and reveals how urbanisation improves ordinary people's lives. He drops in at Shakespeare's school to uncover how education transforms society and explores how this age of discovery helps spur a scientific revolution that creates a new world. Ian also transports viewers to the electrifying world of Elizabethan theatre at Shakespeare's Globe and tells the dramatic story of how English imperial ambitions leads to the Armada and the threat of Spanish invasion.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3882f3147d77e7dc3e5f0cfd7513ffdd0ba44e21","amp;dn":"Guide+to+Elizabethan+England++%28BBC+2013+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3882f3147d77e7dc3e5f0cfd7513ffdd0ba44e21","infoHashBuffer":{"type":"Buffer","data":[56,130,243,20,125,119,231,220,62,95,12,253,117,19,255,221,11,164,78,33]},"announce":[],"urlList":[]}}