{"title":"MainMenu v. 3.0.5 with keygen","uid":6925392,"size":3099752,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:38e28fc4ea90401289c544576c3503a917b4c3b0&amp;dn=MainMenu+v.+3.0.5+with+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1325464876,"description":"Official Web Site: &lt;a href=&quot; http://mainmenuapp.com/pro.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://mainmenuapp.com/pro.php&lt;/a&gt;\n\nMainMenu Pro is a maintenance tool to keep your Mac in shape. Free up disk space, run maintenance scripts, clean up your system, fix common disk problems, secure erase files and uncover hidden settings on your Mac.\n\nKeep your Mac in shape\n\nMainMenu helps you maintain your Mac. Run daily, weekly and monthly maintenance scripts. Fix common disk problems by repairing disk permissions and volumes.\n\nClean your system\n\nThe pro version puts you in full command of your Mac. Free up disk space by cleaning the system cache, font cache and the caches of all users on your system. Free up even more space by emptying the trash of all users.\n\nReclaim your disk\n\nAre you running out of disk space? With MainMenu you can free up disk space by cleaning the cache and browser data that's piling up on your disk. MainMenu can also find large files eating away at your precious disk space. And if your Desktop is cluttered you can let MainMenu archive it in a single sweep.\n\nOptimize\n\nBring your Mac up to speed with MainMenu. Rebuild Launch Services to fix common problems when launching applications. Tune searching by rebuilding the Spotlight index. And speed up Apple Mail by rebuilding its mail index.\n\nFine-tune your Mac\n\nMainMenu lets you dig into the Mac OS X treasure chest to fine-tune your Mac. Change the screenshot output format to PNG, TIFF or even PDF. Remove window shadows when taking screenshots. Disable the Dashboard to save memory. And let Finder show hidden files so you know what's on your system.\n\nSecure erase\n\nWhen you delete a file its data may not immediately be physically removed from your disk. Use MainMenu to securely and immediately remove files and their contents. MainMenu also offers you to securely erase all the free space on a disk, and so wipe contents from previously deleted files.\n\nCustom tasks\n\nDo you find yourself running the same set of tasks repeatedly? Save time by grouping your favorite tasks so you can run them in a single action. You can also set MainMenu to restart or shutdown your Mac automatically after completing a custom task.\n\nSystem Requirements:\n\nIntel Mac, OS X.6 or greater\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:38e28fc4ea90401289c544576c3503a917b4c3b0","amp;dn":"MainMenu+v.+3.0.5+with+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38e28fc4ea90401289c544576c3503a917b4c3b0","infoHashBuffer":{"type":"Buffer","data":[56,226,143,196,234,144,64,18,137,197,68,87,108,53,3,169,23,180,195,176]},"announce":[],"urlList":[]}}