{"title":"Moucham (1992) [VHSRip]","uid":9214039,"size":1059388683,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:38e4866233baa71bb877ec295a065919fa980af6&amp;dn=Moucham+%281992%29+%5BVHSRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"chkm8te","files":3,"time":1384836866,"description":"Moucham (1992) [VHSRip]\n\nIt's amazing how lost in the cock one can get in a full blown fuckfest orgy. Watch as everyone must cum in this fast moving film. These cock hungry Euro babes really know how to get down and dirty in all the elements. They don't really seem to mind as long as they are getting reamed from behind or there is a hard cock in their mouth!\n\nIn what is perhaps a landmark in the annals of adult video (sorry), the opening title credits disappear down a girl's freshly fucked asshole which has expanded to mammoth proportions. Too bad it's the most interesting part of an hour of Europorn.\nSemi-private cubicles in a bar are the location for a variety of average-looking girls and two swarthy French guys. After a long dialogue sequence (all in French, with no subtitles or dubbing to let us in on plot) the cast retire to their adjoining cubicles for an hour of blowjobs, with doggie and reverse cowgirls thrown in for penetrating value.\nThe only anal scene is the one shown in the credits, courtesy of a Joan Jett-type girl and a man whose ass crack sprouts such a dense jungle of black hair it'll give you nightmares for weeks. their butt bang goes on for quite some time, and doesn't end in the traditional cum shot; he pulls out and &quot;Joan&quot; spreads her cheeks as the camera zeroes in for a close-up of that silver-dollar sized bunghole (surrounded by a very attractive excess of lube and a few stray pubes). The participants constantly switch partners, the guys pop a few times on the girls' faces and interesting Ass Crack gives the camera the 'thumbs up' sign. Fin.\nBad color can be interesting; I've never seen an olive green dick before. Fans of Eurosex won't be disappointed in the plethora of penetration shots, but the sex in general is un-fascinating.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=etrm192qj8qggk2aq4ax.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=etrm192qj8qggk2aq4ax.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=xe7xcl0bwtgtjsl50tst.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=xe7xcl0bwtgtjsl50tst.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:38e4866233baa71bb877ec295a065919fa980af6","amp;dn":"Moucham+%281992%29+%5BVHSRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38e4866233baa71bb877ec295a065919fa980af6","infoHashBuffer":{"type":"Buffer","data":[56,228,134,98,51,186,167,27,184,119,236,41,90,6,89,25,250,152,10,246]},"announce":[],"urlList":[]}}