{"title":"The Yaws Handbook of Vapor Pressure - Antoine Coefficients 2nd e","uid":14511185,"size":5367297,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:390c4214a98a1fa562f34cd38be2221ec7b2c3b0&amp;dn=The+Yaws+Handbook+of+Vapor+Pressure+-+Antoine+Coefficients+2nd+e&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462277597,"description":"The Yaws Handbook of Vapor Pressure - Antoine Coefficients 2nd ed - Carl L. Yaws (Gulf, 2015).pdf\r\n\r\nIncreased to include over 25,000 organic and inorganic compounds, The Yaws Handbook of Vapor Pressure: Antoine Coefficients, 2nd Edition delivers the most comprehensive and practical database source for today's petrochemical. Understanding antoine coefficients for vapor pressure leads to numerous critical engineering applications such as pure components in storage vessels, pressure relief valve design, flammability limits at the refinery, as well as environmental emissions from exposed liquids, making data to efficiently calculate these daily challenges a fundamental need. Written by the world’s leading authority on chemical and petrochemical data, The Yaws Handbook of Vapor Pressure simplifies the guesswork for the engineer and reinforces the credibility of the engineer’s calculations with a single trust-worthy source. This data book is a must-have for the engineer’s library bookshelf.\r\n\r\nIncrease compound coverage from 8,200 to over 25,000 organic and inorganic compounds, including sulfur and hydrocarbons\r\nSolve process design questions quickly from a single reliable data source\r\nLocate answers easily for multiple petrochemical related questions such as bubble point, dew point temperatures, and vapor-liquid equilibrium","torrent":{"xt":"urn:btih:390c4214a98a1fa562f34cd38be2221ec7b2c3b0","amp;dn":"The+Yaws+Handbook+of+Vapor+Pressure+-+Antoine+Coefficients+2nd+e","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"390c4214a98a1fa562f34cd38be2221ec7b2c3b0","infoHashBuffer":{"type":"Buffer","data":[57,12,66,20,169,138,31,165,98,243,76,211,139,226,34,30,199,178,195,176]},"announce":[],"urlList":[]}}