{"title":"Catwoman Collected 1940-04 to 1987-01 All preYearOne appearances","uid":13290327,"size":1217069725,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3a6a0b547a3deabc178dc0a24afdafc64b89777b&amp;dn=Catwoman+Collected+1940-04+to+1987-01+All+preYearOne+appearances&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bsg4you","files":7,"time":1453586150,"description":"Catwoman.Collected.1940-04.to.1987-01.All.preYearOne.appearances\r\n\r\nTHIS SHARE COLLECTS ALL CATWOMAN APPEARANCES BEFORE BATMAN YEAR ONE\r\nAPPEARANCES ARE CHRONOLOGICAL BASED ON COVER DATE\r\nALL COVERS AND CREDITS PAGES ARE INCLUDED FOR EACH APPEARANCE\r\nMANY COMICS HAVE PAGES OR PANELS NOT ABOUT CATWOMAN REMOVED\r\nTHE HIGHEST QUALITY VERSIONS WERE USED: DIGITAL OR THE BEST SCANS\r\n\r\nDo you like Selina Kyle aka Catwoman but you are not familiar with her old comics?\r\n\r\nAre you a fan of the TV Catwomen like Julie Newmar, Lee Meriwether, and/or Eartha Kitt from the 60s and/or today's Camren Bicondova on Gotham?\r\n\r\nDid you enjoy Michelle Pfeiffer and/or Anne Hathaway's Catwoman performances on the big screen?\r\n\r\nDo you follow the Modern Era Catwoman comics from the 1990s-today?\r\n\r\nIf you answered YES to any of these questions and you want to get to know Catwoman's comic roots, this share is for you!\r\n\r\nEvery Catwoman comic appearance from her debut in Batman #1 1940-04 until Detective Comics #570 1987-01 are included. Some comics are complete but many only contain the Catwoman story, like in the Golden Age when each Batman had multiple ~13 page stories. Later in the Bronze Age, Selina has many brief appearances and only those pages and sometimes just the panels with Catwoman are included.\r\n\r\nOther than blanking out some pages with non-Catwoman panels, the only processing was cropping covers from TPBs so they filled the page and for Batman #382. Batman #382 1985-07 looked very washed out despite being a digital comic so +60 contrast and -60 brightness were applied to the pages (except for the cover). This made the frames look much better with more distinct colors.\r\n\r\nEach page is consistently named so it's easy to figure out the issue and date. Earth-2 is appended to the filename if it's an Earth-2 appearance after the Golden Age.\r\n[year.month] [title#] [story name] [page].jpg\r\ne.g. 1986.05 Batman395 The Film Freak p15.jpg\r\n\r\nCatwoman.Collected.1940-04.to.1954-09.GoldenAge.Earth2.cbr\r\n242pages 235,462,757bytes Earth-2 Golden Age\r\nCatwoman debuted along with the Joker in Batman #1 1940-04. She was only known as &quot;The Cat&quot; then, later she was &quot;Cat-Woman,&quot; and finally just Catwoman. Batman #3 saw Catwoman get her first costume and she and Batman kiss for the first time. And in Batman #62 we find out her real name: Selina Kyle.\r\n\r\nCatwoman.Collected.1956-10.to.1969-12.SilverAge.Earth1.cbr\r\n118pages 121,021,841bytes Earth-1 Silver Age\r\nNote that due to the introduction of the Comics Code in 1954-10, Catwoman disappeared from comics until 1965-12. Her official re-debut was in 1966-11 with Supermans Girl Friend Lois Lane #70. The Comics Code was especially clear about not allowing any criminal to get away and not face justice. Catwoman is a great thief and Batman is frequently soft on her so they stopped putting her in comics. With the success of the 60s Batman TV show, DC decided to bring her back to print.\r\n\r\nCatwoman.Collected.1970-01.to.1980-12.BronzeAge1.Earth1.cbr\r\n297pages 309,808,710bytes Earth-1 (plus 2 Earth-2) Bronze Age part1\r\nCatwoman's Bronze Age appearances were broken into 3 parts since there were a lot of them. The 2 break points for the Bronze Age are at the end of story archs during multiple month breaks. Also, her 2 Earth-2 appearances in the Bronze Age part1 are included and ordered by cover date along with all of the Earth-1 appearances.\r\n\r\nCatwoman.Collected.1981-01.to.1984-12.BronzeAge2.Earth1.cbr\r\n256pages 226,193,947bytes Earth-1 (plus 5 Earth-2) Bronze Age part2\r\n\r\nCatwoman.Collected.1985-01.to.1987-01.BronzeAge3.Earth1.cbr\r\n313pages 324,511,181bytes Earth-1 Bronze Age part3\r\n\r\nCatwoman's Bronze Age is ended with her last 2 appearances IN Detective Comics #569-#570 right before Batman #404 (aka Year one). These Detective Comics are technically Modern Era since they're post-Crisis but since they're pre-YearOne, I kept them in this collection.\r\n\r\nFYI, these are the dates for the first of Catwoman's New Earth Modern Era appearances:\r\n1987.02 to 1987.05 Batman 404-407 Year One (concurrent with Her Sister's Keeper)\r\n1988.08 to 1988.08 Action Comics Weekly 611-614 The Tin Roof Club\r\n1989.02 to 1989.05 Catwoman v1 01-04 Her Sister's Keeper (concurrent with Year One)\r\n\r\nPlease check out other releases of Gotham, MST3K, Rifftrax, Battlestar Galactica, DC Comics, documentaries, Star Trek Enterprise and more at:\r\n  https://thepiratebay.se/user/bsg4you/  \r\n  https://kat.cr/user/bsg4you/uploads/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you","torrent":{"xt":"urn:btih:3a6a0b547a3deabc178dc0a24afdafc64b89777b","amp;dn":"Catwoman+Collected+1940-04+to+1987-01+All+preYearOne+appearances","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a6a0b547a3deabc178dc0a24afdafc64b89777b","infoHashBuffer":{"type":"Buffer","data":[58,106,11,84,122,61,234,188,23,141,192,162,74,253,175,198,75,137,119,123]},"announce":[],"urlList":[]}}