{"title":"Two best mystery and suspense movies - Wait until Dark (1967) an","uid":4464217,"size":1466634211,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3b90505a944b1277327419b381e52ea3c5a251ad&amp;dn=Two+best+mystery+and+suspense+movies+-+Wait+until+Dark+%281967%29+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"funnyguy1234","files":5,"time":1224839966,"description":"Two Best Mystery and Suspense movies\n\nIt is difficult to find movies with exactly synchronized subtitles. Well here are two best mystery and suspense movies, with perfectly snynchronized English subtitles (in the form of *.srt files, which you can run in any decent media player. KM Player is the best though :)\n\n\nTwo best mystery and suspense movies in my list are:\n\n(i) Wait Until Dark which was made in 1967\n\n(ii) The Dead Girl which was made in 2006\n\n\nWait Until Dark (1967)\n\nThe famous 1967 film starred Audrey Hepburn, Alan Arkin, Richard Crenna, Efrem Zimbalist Jr. and Jack Weston.\n\nIn an effort to duplicate the suspense on screen, movie theaters dimmed their lights to their legal limits, then turned off one by one until each light on-screen was shattered, resulting in the theater being plunged into complete darkness.\n\nHepburn was nominated for both the Academy Award and Golden Globe for Best Actress, and Zimbalist was nominated for a Globe in the supporting category.\n\nThe film has ranked tenth on Bravo's 100 Scariest Movie Moments for its riveting climax.\n\n*****************************\nThe Dead Girl (2006)\n\nThe Dead Girl is a 2006 film written and directed by Karen Moncrieff starring Toni Collette, Brittany Murphy and Marcia Gay Harden. The film was nominated for several 2007 Independent Spirit Awards awards including Best Feature and Best Director.\n\nThe story revolves around the death of a young woman (played by Murphy) and the characters linked to her murder.\n\n\nEnjoy! and if you like, please do not forget to say thanks. It is the only return I get:)","torrent":{"xt":"urn:btih:3b90505a944b1277327419b381e52ea3c5a251ad","amp;dn":"Two+best+mystery+and+suspense+movies+-+Wait+until+Dark+%281967%29+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b90505a944b1277327419b381e52ea3c5a251ad","infoHashBuffer":{"type":"Buffer","data":[59,144,80,90,148,75,18,119,50,116,25,179,129,229,46,163,197,162,81,173]},"announce":[],"urlList":[]}}