{"title":"STARGATE.SG-1.S08E01-05.SWESUB. -Lindoff.ISO","uid":5835864,"size":3495053312,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3be2827daee0fa09614456a416e38c9bc5ada37a&amp;dn=STARGATE.SG-1.S08E01-05.SWESUB.+-Lindoff.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lindoff41","files":1,"time":1284721888,"description":"Season 8, Episode 1: New Order: Part 1\n\nIn a last ditch effort, O'Neill activated an Ancient weapon in the Antarctic to \n\ndefeat Anubis. With Jack still in stasis in the Ancient outpost buried in \n\nAntarctica, SG-1 tries to contact the Asgard. Meanwhile their new leader, Dr. \n\ntries to decide what to do about a request for peace talks from the Goa'uld System \n\nLords.\n\t\n\n\nSeason 8, Episode 2: New Order: Part 2\n\nThe Asgard fleet has managed to destroy the Replicator ship, with Carter aboard, \n\nbut cannot contain the debris. Talks break down with the System Lords, ending in a \n\nHa'tak being dispatched to test Earth's new defensive capabilities. The Prometheus \n\nwaits to engage the incoming enemy, but Thor arrives in the Daniel Jackson, with \n\nTeal'c aboard. They enlist the help of Daniel and Jack, still in stasis, to remove \n\nthe threat of the replicators to the new Asgard homeworld.\n\t\n\n\nSeason 8, Episode 3: Lockdown\n\nColonel Alexi Vaselov arrives at the SGC and soon becomes ill after talking with \n\nJackson. When General O'Neill tries to have him put in quarantine, Daniel starts \n\nshooting, wounding two guards. Carter and base doctor Dr. Brightman determine that \n\nwhat made Vaselov ill and made Jackson start shooting wasn't a disease: it was \n\nAnubis, attempting to return to his empire to get a new body to possess. O'Neill \n\nplaces the SGC under lock down as SG-1 and the SGC attempt to force Anubis into \n\nsome type of action. But the plan backfires and soon nobody can be trusted.\n\t\n\n\nSeason 8, Episode 4: Zero Hour\n\nAs the new head of the SGC, General O'Neill is beginning to feel the weight of his \n\nload, and he starts to have second thoughts about the whole idea, questioning his \n\nown competency.\n\t\n\n\nSeason 8, Episode 5: Icon\n\nThe discovery of the Stargate creates a war between two nations on the planet \n\nTegalus with Daniel in the middle of it.\n\n","torrent":{"xt":"urn:btih:3be2827daee0fa09614456a416e38c9bc5ada37a","amp;dn":"STARGATE.SG-1.S08E01-05.SWESUB.+-Lindoff.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3be2827daee0fa09614456a416e38c9bc5ada37a","infoHashBuffer":{"type":"Buffer","data":[59,226,130,125,174,224,250,9,97,68,86,164,22,227,140,155,197,173,163,122]},"announce":[],"urlList":[]}}