{"title":"Lifeless Planet (2-click run)","uid":10317145,"size":476736718,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3c027b02b36d2f04df3afd64a1808432e552965e&amp;dn=Lifeless+Planet+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1402262902,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nA group of volunteers astronauts went in search of planets outside the solar system, suitable for life. However, after a hard landing on a planet in the protagonist realizes that in front of him naked desert, they exist in homo sapiens can not, companions have gone missing, and from the oxygen tank leaked. Character was in a desperate situation. He decides to find his comrades and explore the wreck. During the search, he stumbles upon the old Soviet laboratories. And then neither comrades nor the meaning of life are not important to him. The protagonist is faced with an incredible mystery. And only on the decision will depend on his life.\n\nFEATURES:\n- Be comfortable and safe behind the planet Earth and to travel to distant worlds. \n- Discover the whole planet, which scientists thought of as a new, full of life world, but in fact proved to be infertile wasteland. \n- Check that you have visited here before and other researchers, many years ago. \n- Throwing aside skepticism and believe in the existence of a living person on this planet lifeless.\n\nInstallation instructions:\n1. Execute the .exe file.\n2. Follow the instructions.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:3c027b02b36d2f04df3afd64a1808432e552965e","amp;dn":"Lifeless+Planet+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c027b02b36d2f04df3afd64a1808432e552965e","infoHashBuffer":{"type":"Buffer","data":[60,2,123,2,179,109,47,4,223,58,253,100,161,128,132,50,229,82,150,94]},"announce":[],"urlList":[]}}