{"title":"Pixelmator 3.3.3 (Mac OSX)","uid":12495698,"size":48455971,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:3c8c391eda37aa4eb6c41991287e18233ddad392&amp;dn=Pixelmator+3.3.3+%28Mac+OSX%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1443263575,"description":"From MacTake.com\r\n\r\nFull-featured and powerful image editing app for the Mac. \r\n\r\nPixelmator takes full advantage of the latest Mac technologies, giving you speedy, powerful tools that let you touch up and enhance images, draw or paint, apply dazzling effects, or create advanced compositions amazingly simple. Once your images are ready, access them anywhere with iCloud, send them to iPhoto or Aperture, email, print, share, or save them to popular image formats–all right from Pixelmator. \r\n\r\nAnd, the new Pixelmator 3.3 is redesigned to cohere with OS X Yosemite’s fresh and modern look, brings new OS X Continuity features, like Handoff and iCloud Drive support, and works wonderfully together with Pixelmator for iPad.\r\n\r\nA powerful, pixel-accurate collection of selection tools\r\n• Quickly and easily select any part of an image\r\n• Edit and apply special effects to portions of your pictures\r\n• Select and remove unwanted elements of your photos\r\n• Cut out objects from one image to place in another\r\n\r\nTop-notch painting tools\r\n• Paint with Pixelmator as you would on canvas\r\n• Use different brush sizes, shapes, hardness, and blending modes\r\n• Adjust brush settings to get just the look you want\r\n• Cover any area with beautiful gradients and color fills \r\n\r\nRetouching tools\r\n• Correct wrinkles and repair scratches\r\n• Make flaws vanish from your photos, remove or re-arrange objects in a composition\r\n• Blur, sharpen, lighten, or darken specific areas\r\n• Get rid of the red eye effect with just one click\r\n• Distort or transform to subtly improve or give images a completely unexpected look.\r\n• Combine different tools and effects for an endless number of ways to refine your images\r\n\r\nDrawing tools\r\n• Easily add, create, combine, and edit shapes \r\n• Quickly add lines, circles, rectangles, polygons, and many more custom shapes\r\n• Effortlessly apply shadows, fills, and strokes for more advanced shapes\r\n• Create buttons, icons, web page elements, illustrations, and much more\r\n\r\nA real effects machine\r\n• Over 160 different breathtaking effects you can play with\r\n• Combine different effects for unique, near-effortless artistic creations\r\n• See stunning results in real-time\r\n\r\nAn elegant collection of professional-grade color correction tools\r\n• Adjust exposure, hue, saturation, shadows and highlights, brightness, contrast, and much more\r\n• Replace and remix colors\r\n• Dramatically improve less-than-perfect images with one click\r\n• Designed with friendly interface features for intuitive ease of use\r\n\r\nLayer Styles\r\n• Easily add non-destructive layer effects like shadows, outlines, color, gradient fills, or reflections\r\n• Combine a set of effects to create and save your own unique layer styles presets\r\n• Or just use any of the Pixelmator Team-designed layer styles presets\r\n• Applying any of the layer styles presets is as simple as drag and drop\r\n\r\nCompatibility\r\n• Send your images directly to iPhoto or Aperture\r\n• Open and save images using PSD, TIFF, JPEG, PNG, PDF, and many other popular formats\r\n• Open and save Photoshop images with layers\r\n• Open and save 16-bits per channel images \r\n\r\niCloud, sharing, and saving for the web\r\n• Let iCloud automatically store your edited images and seamlessly take your work to all your Macs\r\n• You can completely skip manual saving of your documents thanks to Auto Save\r\n• Email your photos right from Pixelmator\r\n• Publish your images to social applications like Flickr, Twitter, and\n• Optimize and save images for use on your web pages, blogs, photo albums, and more\r\n\r\nBuilt exclusively for Mac\r\nPixelmator uses a number of OS X features and technologies like Cocoa, OpenGL, OpenCL, Core Image, Grand Central Dispatch, 64-bit, FaceTime camera, Automator, Full-Screen, built-in Sharing and much more. And Pixelmator’s beautiful interface and image editing engine are fully optimized for the Macbook Pro with Retina display.\r\n\r\nApple Design Award Winner \r\nBest of Mac App Store 2011: App of the Year 2011\r\n\r\n\r\n\r\nWHAT'S NEW\r\nVersion 3.3.3:\r\n\r\n- This update includes minor stability improvements and bug fixes","torrent":{"xt":"urn:btih:3c8c391eda37aa4eb6c41991287e18233ddad392","amp;dn":"Pixelmator+3.3.3+%28Mac+OSX%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c8c391eda37aa4eb6c41991287e18233ddad392","infoHashBuffer":{"type":"Buffer","data":[60,140,57,30,218,55,170,78,182,196,25,145,40,126,24,35,61,218,211,146]},"announce":[],"urlList":[]}}