{"title":"King Kong 1976 bdrip 1080p H264  mkv 2.7Gb","uid":9654612,"size":2927538037,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:3cc85a30961677afe4efe57d77c2a5baa9afcd3e&amp;dn=King+Kong+1976+bdrip+1080p+H264++mkv+2.7Gb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"audiomaximus","files":17,"time":1393162987,"description":"The Big Apple is again besieged by the monstrous King Kong. Jeff Bridges and Jessica Lange star in this ambitious remake of the 1933 original which adds a great deal of camp and good fun to the story Again the gargantuan ape battles attacking aircraft high above the streets of New York this time plunging from the top of the World Trade Center to his death amidst thousands of horrified onlookers. King Kong won an Oscar for special effects and the horror and the thrills are brought anew to another generation in this classy production. \n\nMKV created from an overseas blu ray disc special ordered on Ebay.  I included deleted scenes that are dvd quality on the blu ray not hi def.  \n\n1. crew member dangling over side of ship peeping into porthole while Dwan takes a \n   shower.  Jack tickles the other guy and the peeping tom drops into the ocean.\n\n2. crew watching porn movie in break room.\n\n3. Lord Bagley runs chemical test on oil sample, and chuckles at the results.\n\n4. extended fight scene between Kong and giant snake.\n\n5. extended scene Kong approaches giant wall, Fred Wilson is on top scared stiff, \n   and Kong finally breaks thru wall.  \n\n6. Extended scene Fred tells Dwan if she breaks her contract, she will be tap \n   dancing in rotary clubs.\n\n7. Petrox executive yells at Fred &quot;This will cost the corporation billions!&quot; &quot;You \n   can run but you cant hide, we will find you!&quot;  Kong stomps on Fred and all you \n   see is Kongs footprint and Freds hat.\n\n8. Jack and Dwan are running thru city away from Kong.  He looks thru parked cars \n   looking for keys.  Dwan asks if he knows how to hotwire a car.\n\nEnjoy this classic movie and help seed !  Comments welcome.\n\nVideo \n\n1920 x 818  H264  2500kbps  24fps  mkv  runtime  2:14:28\n\nAudio\n\nMP3 Lame  128kbps  48khz  stereo mixdown dolby pro logic II (5.1)","torrent":{"xt":"urn:btih:3cc85a30961677afe4efe57d77c2a5baa9afcd3e","amp;dn":"King+Kong+1976+bdrip+1080p+H264++mkv+2.7Gb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cc85a30961677afe4efe57d77c2a5baa9afcd3e","infoHashBuffer":{"type":"Buffer","data":[60,200,90,48,150,22,119,175,228,239,229,125,119,194,165,186,169,175,205,62]},"announce":[],"urlList":[]}}