{"title":"Holy Writ as Oral Lit: The Bible as Folklore","uid":6325332,"size":3020916,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3db14b33d358ab35062a48ced2b453ccfee2ac10&amp;dn=Holy+Writ+as+Oral+Lit%3A+The+Bible+as+Folklore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stilljacktwenty","files":1,"time":1303093751,"description":"With great reverence for the Bible, Dundes offers a new and exciting way to resolve some of the mysteries and contradictions that evolved during the Bible's pre-written legacy and that persists today. Using his expert knowledge of folklore, Dundes unearths and contracts multiple versions of nearly every major biblical event, including the creation of women, the flood, the ten commandments, the Sermon on the Mount, the Lord's Prayer, and the inscription on the Cross.\n\nAbout the Author\n\nAlan Dundes is known as one of the world's leading authorities on folklore. In more than 30 books he has unveiled the meanings in the oral traditions of many cultures. He lives in Berkeley, where he is professor of anthropology and folklore at the University of California.\n\n\nReview by Harumi Kawamura:\n\nThis was a fantastic read. The author step-by-step takes the reader through the basics of oral literature (folklore, folk tales), and gives numerous examples of oral literature in the Bible. Among many other examples, he shows how the two creation stories, the two flood stories, all demonstrate that the Bible, Holy Writ, is an example of a collection of Oral Lit, oral folk tales that the ancient people used to tell each other.\nIt was a delightful and insightful reading experience for me, and I finished it in a couple hours.\n\nNote from the uploader:\n\nI've got my physical copy ages ago, but now I had access to an electronic one and I thought I'd share it. This really is an amazing little book. It is a kick in the face to anyone who presents the contents of the bible as historical fact. If you are interested in the meme of religion or in folklore, you can't do much better than this.","torrent":{"xt":"urn:btih:3db14b33d358ab35062a48ced2b453ccfee2ac10","amp;dn":"Holy+Writ+as+Oral+Lit%3A+The+Bible+as+Folklore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3db14b33d358ab35062a48ced2b453ccfee2ac10","infoHashBuffer":{"type":"Buffer","data":[61,177,75,51,211,88,171,53,6,42,72,206,210,180,83,204,254,226,172,16]},"announce":[],"urlList":[]}}