{"title":"AFIELD - A Chef's Guide to Preparing and Cooking Wild Game and F","uid":12915798,"size":25862535,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3dba3641aeacbad36bf9b249f28707fadc87c921&amp;dn=AFIELD+-+A+Chef%27s+Guide+to+Preparing+and+Cooking+Wild+Game+and+F&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1449342487,"description":"AFIELD - A Chef's Guide to Preparing and Cooking Wild Game and Fish - 1st Edition (2012).pdf Gooner\r\n\r\nPublisher: Welcome Books; 1St Edition edition (September 18, 2012)\r\nLanguage: English\r\nISBN-10: 1599621142\r\nISBN-13: 978-1599621142\r\n\r\n2012 IPPY Bronze Award in the Cookbook category (Independent Publisher Book Awards)\r\nForeWord Reviews 2012 Book of the Year Award Finalist (TBA)\r\n2013 James Beard Foundation Book Awards, Nominee Finalist\r\n\r\nBorn from the principles of the local food movement, a growing number of people are returning to hunting and preparing fish and game for their home tables. Afield: A Chef's Guide to Preparing and Cooking Wild Game and Fish is at once a manifesto for this movement and a manual packed with everything the new hunter needs to know.  Wild foods, when managed responsibly, are sustainable, ethical, and delicious, and author Jesse Griffiths combines traditional methods of hunting, butchering, and preparing fish and game with 85 mouthwatering recipes.\r\n\r\nAfield throws open the doors of field dressing for novice and experienced hunters alike, supplying the know-how for the next logical step in the local, sustainable food movement.  Stemming from a commitment to locally grown vegetables and nose-to-tail cooking, Griffiths is an expert guide on this tour of tradition and taste, offering a combination of hunting lessons, butchery methods, recipes, including how to scale, clean, stuff, fillet, skin, braise, fry and more. Fellow hunting enthusiast and food photographer Jody Horton takes you into the field, follows Griffiths step-by-step along the way and then provides you with exquisite plate photograph of the finished feasts. Filled with descriptive stories and photographs, Afield takes the reader along for the hunt, from duck and dove to deer and wild hog. \r\n\r\nGame and fish include:\r\nDoves, Deer, Hogs, Squirrel, Rabbits, Ducks, Geese, Turkey, Flounder, White Bass, Crabs, Catfish, and more","torrent":{"xt":"urn:btih:3dba3641aeacbad36bf9b249f28707fadc87c921","amp;dn":"AFIELD+-+A+Chef%27s+Guide+to+Preparing+and+Cooking+Wild+Game+and+F","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dba3641aeacbad36bf9b249f28707fadc87c921","infoHashBuffer":{"type":"Buffer","data":[61,186,54,65,174,172,186,211,107,249,178,73,242,135,7,250,220,135,201,33]},"announce":[],"urlList":[]}}