{"title":"Scrum Shortcuts without Cutting Corners prabhu_","uid":9437779,"size":9888393,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e57e2844db4181ae5dcb84fb79aaa9e93ebcbbf&amp;dn=Scrum+Shortcuts+without+Cutting+Corners+prabhu_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prabhu_","files":3,"time":1388938397,"description":"Scrum Shortcuts without Cutting Corners: Agile Tactics, Tools, &amp; Tips (Addison-Wesley Signature Series (Cohn))\n\nby Ilan Goldstein\n\n\nabout book :-\n\nPractical, Step-by-Step Scrum Techniques for Improving Processes, Actions, and Outcomes\n \nThe widespread adoption and success of Scrum can be attributed in large part to its perceived intuitiveness and simplicity. But when new Scrum practitioners attempt to apply Scrum theory and high-level approaches in actual projects, they often find it surprisingly difficult. In Scrum Shortcuts without Cutting Corners, Scrum expert Ilan Goldstein helps you translate the Scrum framework into reality to meet the Scrum challenges your formal training never warned you about.\n \nDrawing on his extensive agile experience in a wide range of projects and environments, Goldstein presents thirty proven, flexible shortcuts for optimizing Scrum processes, actions, and outcomes. Each shortcut walks you through applying a Scrum approach to achieve a tangible output. These easy-to-digest, actionable patterns address a broad range of topics including getting started, quality and metrics, team members and roles, managing stakeholders, estimation, continuous improvement and much more.\n \nWhatever your role, Scrum Shortcuts without Cutting Corners will help you take your Scrum skills to the next level and achieve better results in any project you participate in.\n \nabout this author :-\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/9b/e0/41d5536b06390ad8956ee4.L._V356901279_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/9b/e0/41d5536b06390ad8956ee4.L._V356901279_.jpg&lt;/a&gt;\n\nIlan Goldstein is a globally recognised Scrum trainer and consultant with extensive experience working with start-ups, market leaders, government agencies, universities and public companies, all over the world to help improve their agility through the implementation of Scrum.\n\nHe is the author of the 'Mike Cohn Agile Signature Series' book, 'Scrum Shortcuts Without Cutting Corners' (published by Pearson under the Addison-Wesley brand) and is a founder of both AxisAgile (an Agile training and consulting company based in Sydney) as well as Scrum Australia (a national not-for-profit organization focused on growing and enriching the Australian Scrum community).\n\nIlan is a regular conference speaker, contributor to industry publications and blogger.\n\nFor those interested in the alphabet-soup of certifications, Ilan is a Certified Scrum Trainer (CST), a Certified ScrumMaster (CSM), Certified Scrum Product Owner (CSPO), Certified Scrum Professional (CSP), Project Management Professional (PMP), Agile Certified Practitioner (ACP) and PRINCE2 Practitioner.\n\nIn his spare time he volunteers for Compeer, the award winning, global mental health program.\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`","torrent":{"xt":"urn:btih:3e57e2844db4181ae5dcb84fb79aaa9e93ebcbbf","amp;dn":"Scrum+Shortcuts+without+Cutting+Corners+prabhu_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e57e2844db4181ae5dcb84fb79aaa9e93ebcbbf","infoHashBuffer":{"type":"Buffer","data":[62,87,226,132,77,180,24,26,229,220,184,79,183,154,170,158,147,235,203,191]},"announce":[],"urlList":[]}}