{"title":"Life.In.Cold.Blood","uid":4521556,"size":3906097152,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e5d5a93efed9569a867f8f18041dbbd5be02e8a&amp;dn=Life.In.Cold.Blood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"krytenthesmug","files":5,"time":1227142023,"description":"In his 82nd year, David Attenborough is still going strong.\n\n&quot;Life in Cold Blood&quot; tells all about reptiles and amphibians over five hour-long episodes. The last ten minutes of each episode contains an informative appendix called &quot;Under the Skin&quot; which goes behind the scenes of the preceding episode. Unlike such documentaries as &quot;Planet Earth&quot;, this series is much more personal. Attenborough narrates - as per usual - but also appears frequently on screen.\n\nTo anyone at all familiar with reptiles, there isn't too much in the way of new information. For a lay-person such as myself, there are many fascinating unknown factors, especially relating to blood and body temperature. The cinematography provides a huge range of gorgeous high definition photography. Thermal and Infrared cameras provide valuable insight. Director Scott Alexander films the action with a good eye, always going for the interesting shot over the easy one.\n\nI was pleased that often ridiculous and unsubstantiated theories of macro-Evolution were not dwelled on too much. What this documentary has to say about provable and observable micro-Evolution is excellent, however. Several people have made negative comments in regard to this series lacking the 'epic' factor of other Attenborough projects. But sometimes it's refreshing to get more down-to-earth. This approach works well, and makes this another excellent watch.\n\nRATING: 8.2 out of 10","torrent":{"xt":"urn:btih:3e5d5a93efed9569a867f8f18041dbbd5be02e8a","amp;dn":"Life.In.Cold.Blood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e5d5a93efed9569a867f8f18041dbbd5be02e8a","infoHashBuffer":{"type":"Buffer","data":[62,93,90,147,239,237,149,105,168,103,248,241,128,65,219,189,91,224,46,138]},"announce":[],"urlList":[]}}