{"title":"Resplendence SanityCheck Professional v3.00 Retail [TorDigger]","uid":8401241,"size":1338939,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3ef9191c0a90269c15fe720b5785dd71065a1f43&amp;dn=Resplendence+SanityCheck+Professional+v3.00+Retail+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":8,"time":1366704090,"description":"Resplendence SanityCheck Professional\n\nSanityCheck v3 supports Windows 8 and Windows Server 2012.\n\nSanityCheck is an advanced rootkit and malware detection tool for Windows which thoroughly scans the system for threats and irregularities which indicate malware or rootkit behavior. By making use of special deep inventory techniques, this program detects hidden and spoofed processes, hidden threads, hidden drivers and a large number of hooks and hacks which are typically the work of rootkits and malware. It offers a comprehensible report which gives a detailed explanation of any irregularities found and offers suggestions on how to solve or further investigate any situation.\n\nSanityCheck Features\nCurrently SanityCheck offers the following features:\n\nRuns on almost all Windows versions\n\nSanityCheck runs on most recent Windows versions including Windows 7, Windows8, Windows Vista and Windows XP. For an exact overview of the Windows versions supported by SanityCheck and the service packs required click here.\n\nMakes use of special deep inventory techniques\n\nSanityCheck makes use of a special Windows feature (a GlobalFlag setting) which allows it to create a deep inventory of drivers, devices, processes, threads and a lot of other information about your system. By making use of this feature in combination with other techniques it is able to create a very thorough scan of irregularities on your system.\n\nDetect hidden processes\n\nSanityCheck goes to incredible lengths to detect processes which hide themselves from the Windows taskmanager and programming interfaces. It uses seven unmentioned safe techniques to reveal hidden processes in both usermode and kernelmode.\n\nDetect obfuscated processes\n\nSanity Check detects processes which do efforts to obfuscate their names. This is a typical activity associated with malware.\n\nDetect processes attempting to appear as common system processes\n\nSanity Check detects for processes which appear as a standard Windows process.\n\nDetect processes with obviously deceptive names\n\nMalicious processes which are received as email attachements often try to appear as an innocent document types. An example of such a process name is:\n&quot;foo.txt .exe&quot;\n\nDetect processes without product, company or description information\n\nAlthough not necessarily evil, SanityCheck checks for processes without a product, company or description resource information.\n\nVerify signatures and checksums of processes and kernel modules\n\nSanitycheck verifies digital signatures on processes and kernel modules and checks them for validity. It also verifies the validity of checksums.\n\nDetect SSDT hooks\n\nSanityCheck detects kernel modules which hook the system service descriptor table. Although not necessarily the work of malware, SanityCheck will do every effort to detect the modules responsbile for these acts and generate a comprehensible report.\n\nDetect Import Address Table hooks\n\nThe program detects kernel modules which hook the entry points of exported kernel routines.\n\nDetect kernel object callout hooks\n\nAlthough rarely used, kernel object callout hooks are incredibly powerful and have the potential to instrument the complete working of the Windows kernel. Currently we do not know of any security product which detects these hooks.\n\nDetect hidden drivers\n\nSanityCheck detects various forms of kernel modules which are attempting to hide.\n\nDetect hijacked driver entry points\n\nHijacked dispatch entry points in drivers can be used by rootkits and malware for a wide variety of purposes. SanityCheck detects both drivers which have their entry points hooked as well as the modules reponsible for these actions.\n\nFind the culprit\n\nNote that it is not always possible to make a clear distinction between malware and legitimate products. This is because certain products resort to aggressive controversial techniques as anti-piracy measures, to avoid debugging or even for anti-competitive purposes. Anitivirus or other security software that is installed on your system may be making use of rootkit-like techniques such as a hidden process in an effort to hide itself from malware. Such products may be involved in a controversial race along the lines of &quot;defeat evil with its own weapons&quot;.\n\nFor this reason SanityCheck does everything possible to pinpoint the modules and processes which are responsbile for these actions while remaining careful in drawing any conclusions.\n\nComprehensible report\n\nWe do not believe in aggressively &quot;fixing&quot; malware with a single click of a button. This is because there is no such thing as a clear distinction line between malware and legitimate products which make of controversial techniques. &quot;Fixing&quot; hooks in the kernel is a very unsafe and despicable act which is only very likely to make your system crash or worse. Instead Sanitycheck leaves your system in an unaltered state while offering comprehensible suggestions on how to proceed in any situation. \n\nOptional expert mode\n\nOptionally you can switch SanityCheck into expert mode. It will then display a wealth of information on drivers, devices, processes, threads, kernel objects and system routines which can be very useful for further analysis. A lot of the information available in expert mode cannot be obtained by any other existing utility other than a kernel debugger. Because the amount of information can be overwhelming and may be difficult to understand for novice users, it is turned off by default and only a comprehensible report is displayed.\n\nSupported OS:\n\nWin2000/XP/2003/Vista/2012/Win7/Win8\n\nHomepage: http://www.resplendence.com/sanity\n\nInstallation Instructions:\n\n- Install program.\n- Already Registered, no need of Key or crack.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:3ef9191c0a90269c15fe720b5785dd71065a1f43","amp;dn":"Resplendence+SanityCheck+Professional+v3.00+Retail+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ef9191c0a90269c15fe720b5785dd71065a1f43","infoHashBuffer":{"type":"Buffer","data":[62,249,25,28,10,144,38,156,21,254,114,11,87,133,221,113,6,90,31,67]},"announce":[],"urlList":[]}}