{"title":"The Loco Roco soundtrack ripped","uid":3515224,"size":170110188,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3f16a853e4dc877cb1829438d4ed981f6d1970de&amp;dn=The+Loco+Roco+soundtrack+ripped&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"larswad","files":55,"time":1156320201,"description":"What: The ripped soundtrack from the PSP game Loco Roco.\nFormat: MP3 256 kbps 44100 Stereo, INSANE quality preset (converted with lame frontend aumpel).\nSize: 162MB, 54 songs.\nWhen: 2006-09-13\nWhy: I wanted this cool game music in my car stereo without dragging around the PSP.\nWhere: who cares?\nWho: Who cares?\n\n\nSo, after going through a jungle of weird audio tools and codec&amp;#039;s I finally\nmanaged to rip the songs and convert them from Sony&amp;#039;s AT3 format into WAV and then\nfinally into MP3. I tried to keep as low compression ratio as possible in order not to loose to much quality. Remember the songs were compressed once already.\nIf anyone want the AT3 converted wav files instead, let me know and maybe I&amp;#039;ll put them up. They will fill up somewhere around one complete CD.\n\nThey are listed in the order they appear in the DATA.BIN file on the UMD disc.\nI was surprised to see that there were so many variations of the same songs, because you don&amp;#039;t notice that when you play the game.\n\nOf course it&amp;#039;s impossible for me to know the original names of the songs in the game, so I just used my imagination to give them some meaningful names instead of file1, file2 and soforth. I wasn&amp;#039;t able to find fitting names for all of the files though.\nWe will probably find out about the song names if they later on decide to release an official soundtrack of Loco Roco.\nYou can of course use your own song names if you find something that fits better, in that case you simply rename the files.\n\nI hope you will enjoy this just as much as I do, game music more cute and enjoyable than this is hard to find.\nMy personal favourite is the last one in order, number 54.\n\nEnjoy!\n\nThanks goes to:\n\n&quot;-Loco001&quot; for the &quot;Loco Roco DATA.BIN BGM File Extractor For PSP&quot;\nThe creator of &quot;MarC&amp;#039;s HiMdRenderer&quot;.\nThe creator of &quot;aumpel&quot;.\nSony for Sonicstage.\n","torrent":{"xt":"urn:btih:3f16a853e4dc877cb1829438d4ed981f6d1970de","amp;dn":"The+Loco+Roco+soundtrack+ripped","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f16a853e4dc877cb1829438d4ed981f6d1970de","infoHashBuffer":{"type":"Buffer","data":[63,22,168,83,228,220,135,124,177,130,148,56,212,237,152,31,109,25,112,222]},"announce":[],"urlList":[]}}