{"title":"Man-Thing v1","uid":4278614,"size":428226101,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:40fe4b4e177396502380e612aa81c97fb82e8a06&amp;dn=Man-Thing+v1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gilgamesh07","files":29,"time":1215301122,"description":"This torrent is in response to a larger request from the forums. This torrent contains Marvel Comics&amp;#039; Man-Thing v1 and Giant-Sized Man-Thing v1 which were published  more or less concurrentl during the early 1970s.\n\nThe Man-Thing is a fictional character in the Marvel Comics Universe, created by writers Stan Lee, Roy Thomas, and Gerry Conway and artist Gray Morrow in Savage Tales #1 (May 1971). He went on to be featured in various titles and in his own series, including Adventure into Fear, which introduced the popular character Howard the Duck. In 2005 Man-Thing was produced as a TV movie for the SciFi Channel.\n\nMan-Thing is a large, slow-moving, vaguely humanoid creature living in the Florida Everglades near the Seminole reservation.\n\nFollowing the Man-Thing&amp;#039;s 11-page debut in the black-and-white adventure-fantasy magazine Savage Tales #1 (May 1971), the character next appeared as an antagonist of Marvel&amp;#039;s jungle-lord hero Ka-Zar in a two-part story in Astonishing Tales #12-13 (June-Aug. 1972). Man-Thing received his own 10-page feature shortly thereafter, beginning in Adventure into Fear #10 (Oct. 1972), sharing that anthological title with reprinted 1950s horror/fantasy stories. Steve Gerber, who would become Man-Thing&amp;#039;s signature writer, succeeded Conway the following issue. The feature expanded to 15 pages with #12, became 16 pages two issues later, and reached the standard 19-page length of Marvel superhero comics with issue #15. After issue #19 (Dec. 1973), Man-Thing received his own solo title, which ran 22 issues (Jan. 1974 - Oct. 1975). A sister publication was the quarterly Giant-Size Man-Thing #1-5 (Aug. 1974 - Aug. 1975), which featured 1950s horror-fantasy and 1960s science fiction/monster reprints as back-up stories, with a Howard the Duck feature added in the final two issues. The fifth issue was a prequel, with Madame Swabada showing Ted Sallis (with Ellen Brandt) his future as Man-Thing, including stories by writers other than Gerber in a Gerber frame, with Gerber also writing the first story). Following Morrow, the main series&amp;#039; primary pencillers were, successively, Val Mayerik, Mike Ploog, John Buscema, and Jim Mooney.\n\nIn the final issue, writer Gerber appeared as a character in the story, claiming he had not been inventing the Man-Thing&amp;#039;s adventures but simply reporting on them and that he had decided to move on. Gerber continued to write Man-Thing guest appearances in other Marvel titles, as well as the serialized, eight-page Man-Thing feature in the omnibus series Marvel Comics Presents #1-12 (Sept. 1988 - Feb. 1989).\n\nTed Sallis, a native of Omaha, Nebraska, is a biochemist working in the Everglades who develops a &quot;miracle drug&quot; later defined as an attempt at recreating the &quot;super-soldier serum&quot; that created Captain America. Betrayed by his lover, Ellen Brandt, Sallis flees from agents from Advanced Idea Mechanics (AIM), who covet his formula and research. He injects himself with the serum, but after crashing in a swamp and apparently drowning, he is transformed into a swamp creature through a combination of his formula and, as later explained, magical forces extant in the area.[1] Sallis&amp;#039; mind was apparently extinguished, although on rare occasions he could briefly return to consciousness within his monstrous form,[2] and even to his human form.[3] Sallis&amp;#039; assistant was an elderly African-American scientist, Dr. Wilma Calvin.\n\nBefore long, the Man-Thing first encountered Ka-Zar, and agents of A.I.M.[4]. After that, he first encountered the sorceress Jennifer Kale, and battled the demon Thog the Nether-Spawn.[5]\n\nVisitors to the swamp soon discovered it was a place of mystical properties known as the Nexus of All Realities, and the Man-Thing visited an extra-dimensional world and met the benevolet Dakimh the Enchanter.[6] Man-Thing then first encountered Wundarr (alias the Aquarian),[7] and then Howard the Duck.[8] Later, he first encountered the Foolkiller.[9]\n\nMan-Thing became the Guardian of the Nexus of Realities, and found himself facing demons, ghosts, and time-traveling warriors, while continuing to encounter such non-supernatural antagonists as rapacious land developers, fascist vigilantes, and common criminals. Regular visitors included Thog the Nether-Spawn, Dakimh, Howard the Duck, and several humans, including members of the Cult of Zhered-Na (led by Jennifer Kale&amp;#039;s father, Joshua). Developer Franklin Armstrong Schist attempted to build an airport in Citrusville. Dakimh declared that he, Man-Thing, Jennifer, Korrek Warrior Prince of Katharta, and Howard were the chosen five needed to defeat Thog.\n\nTwenty-something radio DJ Richard Rory moves to Citrusville. He and nurse Ruth Hart become involved in defending Man-Thing from Schist&amp;#039;s attempts to destroy the creature. Rory in particular formed a bond with Man-Thing, while Hart left Rory for Hell&amp;#039;s Kitchen, New York City.\n\nIn time, reality set in and the energy crisis prevented Schist from completing his airport. The reason for the airport was then revealed: Schist wanted to find the Fountain of Youth. Unfortunately, he learned the hard way that the desired effects of the fountain&amp;#039;s water come from bathing in it, not drinking it, and with a newly fragile body, was done in by Man-Thing.[10]\n\nGerber also wrote five longer issues of a parallel series, Giant-Size Man-Thing, whose unintentional double entendre title became a common joke among comics readers (a &quot;giant-size&quot; comic is one with more pages than a standard comic book). The first issue introduced the Cult of Entropy, who would later be foes of the Incredible Hulk and Howard the Duck, even reaching the latter&amp;#039;s newspaper strip. Man-Thing first encountered Yagzan and the Cult of Entropists.[11] In the second issue, Schist&amp;#039;s widow and daughter arrange to have the Man-Thing captured, but he escapes and runs amok in Manhattan. The third issue featured the death of Dakimh&amp;#039;s physical form, though his spirit would continue to appear, while the fourth began the solo adventures of Howard the Duck. In the fifth issue, we see that Ted Sallis had prior knowledge of his future as Man-Thing from a fortune teller, who outraged him rather than making him pay heed.\n\nAt one point, an astral pirate ship headed by Captain Fate, ended up in the Nexus. A scientist, Dr. Maura Spinner, was the reincarnation of a pirate queen and both were linked with a satyr named Khordes. In a controversial ending about which Gerber expressed regrets with having written, Spinner stayed with Khordes.[12]\n\nSoon, Gerber was delving into Ted Sallis&amp;#039;s past. In a text story in Monsters Unleashed #8 and #9, it was revealed that Sallis had slept with an underage girl, whose father sought to kill the current occupant of his shack. In Daredevil #108, Gerber introduced Foggy Nelson&amp;#039;s sister Candace, who was being harassed over research she was doing at Empire State University.[13] In issue #113, this was revealed to be about the Sallis Papers, research that could have turned the human race into smog-breathing monsters and allow industry to proceed unchecked. In Man-Thing #15, we are introduced to Sainte-Cloud, a young woman who helped Sallis decide to abandon the project. Sometimes this has been erroneously cited as the project that created Man-Thing, though it is made clear in the stories that this is an earlier project. At one point Man-Thing first encountered the Thing.[14]\n\nThe final arc of the Gerber series (16, GS4, 17-22) dealt with a hypermasculine laborer named Sorensen forced into retirement at age 65. He went on a rampage as a Mad Viking, killed his daughter Astrid&amp;#039;s artist boyfriend, and allied himself with Olivia Selby, who led a book burning riot at Citrusville High School, leading to the slaughter of several teachers. Man-Thing&amp;#039;s involvement led to him being dumped in the local sewage treatment plant, which only increased his ability to leave the swamp, while Richard Rory got fired by the local radio station for speaking out against the book burning on air. Rory attempted to leave for Atlanta, and Man-Thing and Carol Selby, Olivia&amp;#039;s daughter, demanded to go with him. In Atlanta, they met Robert Nicolle, a man with neither feeling nor physical sensation, who appeared as the costumed criminal the Scavenger, and whose sister, Dani Nicolle, had her sensations on overload and must project them into objects called Nightmare Boxes.\n\nThese comics have been pretty much scarce out there, finally being culled from a varety of sources who all have made seperate and major efforts to do Marvel Comics chronological packs :thumbsup::thumbsup::thumbsup: (yes they do, but between the lot of them there are still a lot of missing books, even among their best effortsO:-):fun:\n\nI would love to see chronological pcks from 1979 - 1990 so I can collect a Man-Thing v2 torrent O:-\n\n\nThanks to the scanners and the many and sundry original sources.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:40fe4b4e177396502380e612aa81c97fb82e8a06","amp;dn":"Man-Thing+v1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40fe4b4e177396502380e612aa81c97fb82e8a06","infoHashBuffer":{"type":"Buffer","data":[64,254,75,78,23,115,150,80,35,128,230,18,170,129,201,127,184,46,138,6]},"announce":[],"urlList":[]}}