{"title":"VICE on HBO Season One: Corruption (Episode 6)[1080p][pt-BR]","uid":9823570,"size":576079494,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:44438777b0859bd4bbb147226b1b6b8dccc79784&amp;dn=VICE+on+HBO+Season+One%3A+Corruption+%28Episode+6%29%5B1080p%5D%5Bpt-BR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"enedois","files":-1,"time":1395733123,"description":"Segment 1: China's Ghost Towns\n\nFifteen years ago, China changed its policy so people could buy their own homes. Real-estate investments boomed, and new cities began popping up each year, many inspired by western design and mimicking iconic locales like Paris and lower Manhattan. The problem is: people don't live here. One ghost city in Inner Mongolia, built to house one million people, is now an empty shell of unoccupied skyscrapers and abandoned construction sites. VICE checks out this and other urban failures to figure out how China's preoccupation with growing its GNP turned &quot;supply and demand&quot; into &quot;build now, sell later.&quot;\n\nSegment 2: Egypt on the Brink\n\nOver two years ago, Arab Spring climaxed in the overthrow of President Mubarek in Egypt. But for many Egyptians, the situation has actually gotten worse, as has the man who replaced Mubarek: Mohamed Morsi, elected under the radical Muslim Brotherhood banner. VICE visits the embattled streets of Cairo, where opposition to Morsi has resulted in renewed mass protests and violence in Tahrir Square. Among those we meet: members of the Black Bloc, youthful revolutionaries who disguise themselves with hoods and scarfs while vowing to oust Morsi and destroy the Muslim Brotherhood.","torrent":{"xt":"urn:btih:44438777b0859bd4bbb147226b1b6b8dccc79784","amp;dn":"VICE+on+HBO+Season+One%3A+Corruption+%28Episode+6%29%5B1080p%5D%5Bpt-BR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44438777b0859bd4bbb147226b1b6b8dccc79784","infoHashBuffer":{"type":"Buffer","data":[68,67,135,119,176,133,155,212,187,177,71,34,107,27,107,141,204,199,151,132]},"announce":[],"urlList":[]}}