{"title":"[Peng Chang][Pachinko Queen Explosion][Sakiko no Sushi] 3 DVD in","uid":4982869,"size":4674736128,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:450b9543af5593761de927594c19c7ae40e367c7&amp;dn=%5BPeng+Chang%5D%5BPachinko+Queen+Explosion%5D%5BSakiko+no+Sushi%5D+3+DVD+in&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sailo","files":-1,"time":1246444332,"description":"1. College student Nana loved to play Mahjong with her boyfriend Kazuya in Mahjong Gambling Club. One day they joined a Mahjong game with professional player Nishioka. Kazuya totally lost. He left nana and ran away. Nana agreed to give her body to Nishioka to pay the debt for Kazuya. But Nishioka did not take advantage of Nana. He only asked her to do housework for him. He admired her character and even passed his secret Mahjong technique to Nana to train her as a professional. Nana's fate was thus changed by that single gambling game...\n\n2. Mari is a gorgeous girl working In Pachinko Centre &quot;SEVEN&quot;. One day, Yamazaki, a food chainstore tycoon proposes to take over the Pachinko Centre to build a food mial. Mari strongly objects to this idea because this Pachinko Centre is the place where she often played with her father in childhood. To reserve her good memory of her father in childhood. To reserve her good memory of her father and a hope to see her father again in this Pachinko Centre, she has to win in the Pachinko Game Competition. White there's a story behind Yamazaki's intention to take over this Pachinko Centre...\n\n3. With a special natural instinct of &quot;absolute taste&quot;, the genious girl Sakiko was trained by her father in their family Sushi bar. But one day Sakiko was fed up with her father's harsh training. She left with her boy friend. Years later she came back home only to find her father's Sushi bar to be taken over by the rich girl Harumi and her Black Gang as a revenge of Harumi's lost love. Now Sakiko had to fight not only for her family but her dignity to win the Sushi Contest.\n\n3 DVD Movies combine to 1 DVD, sexual content and nudity.\n\nGoogle them.\n\nAudio : Japanese 2.0\n\nSubs  : English, Chinese","torrent":{"xt":"urn:btih:450b9543af5593761de927594c19c7ae40e367c7","amp;dn":"%5BPeng+Chang%5D%5BPachinko+Queen+Explosion%5D%5BSakiko+no+Sushi%5D+3+DVD+in","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"450b9543af5593761de927594c19c7ae40e367c7","infoHashBuffer":{"type":"Buffer","data":[69,11,149,67,175,85,147,118,29,233,39,89,76,25,199,174,64,227,103,199]},"announce":[],"urlList":[]}}