{"title":"Jeremy Messersmith - Heart Murmurs (2014) [FLAC]","uid":9570393,"size":260620569,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:454632c3c819e5ab369904b5cbf68d269e013cc4&amp;dn=Jeremy+Messersmith+-+Heart+Murmurs+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1391621140,"description":"\n  Jeremy Messersmith - Heart Murmurs (2014) [FLAC]\n\n  Genre: Folk \n  Style: Singer/Songwriter\n  Source: Scene CD (forsaken)\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 It's Only Dancing \n  02 Tourniquet \n  03 Bridges \n  04 Steve \n  05 Ghost \n  06 Heidi \n  07 I Want You To Be Your One Night Stand \n  08 You'll Only Break His Heart \n  09 Bubblin'\n  10 Hitman\n  11 Someday, Someone\n\n  Following 2010's The Reluctant Graveyard (written from the perspective of the dead) and 2012's ambient, largely instrumental Paper Moon, Heart Murmurs is Minneapolis singer Jeremy Messersmith's foray back into the living world of big pop songwriting. The aptly titled LP shivers with the irregularities of its namesake, just as it beats with a steady, gushing pulse. Messersmith has long been a proponent of wistful and melancholic songs, but on Heart Murmurs he takes on the many romantic aspects of the heart, sung from perspectives of yearning, apathy, and regret, to name a few. Making his debut for Glassnote Records, he steps out from the D.I.Y. indie aesthetic of his earlier work to deliver an 11-track clinic on studiocraft that walks a fine line between big-budget pomp and careful elegance. Working again with Minneapolis producer Andy Thompson, the arrangements are streamlined and punchy, but with tightly woven strings, pianos, and other neatly sprung tricks. \n\n  Beginning with the opening tale of unrequited love, &quot;It's Only Dancing,&quot; you're drawn into Messersmith's unapologetically human tales that he delivers in his warm, high tenor voice. Both in presentation and songwriting, Messersmith comes across as ultimately relatable in the same way that mentor and former producer Dan Wilson (Trip Shakespeare, Semisonic) does, but like Wilson, he strives for a higher artistic standard to transcend the often pedestrian adult contemporary genre where music like this tends to be placed. While some of the freewheeling creativity of his earlier records has been subdued, the grand scheme of Heart Murmurs is one of subtlety and artistic maturity. Songs like &quot;Bridges,&quot; &quot;Bubblin',&quot; and &quot;Hitman&quot; are wonderfully realized power pop ballads, and even if the single &quot;Ghost&quot; falls a bit too closely into the rousing strum 'n' kick Mumford/Lumineers mold, it is such a better-written piece of music than those bands' vacant hobo epics that it's not hard to get behind it. Taken as a whole, Heart Murmurs is a well-rounded and full-hearted record by an elite songwriter deserving of greater exposure.","torrent":{"xt":"urn:btih:454632c3c819e5ab369904b5cbf68d269e013cc4","amp;dn":"Jeremy+Messersmith+-+Heart+Murmurs+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"454632c3c819e5ab369904b5cbf68d269e013cc4","infoHashBuffer":{"type":"Buffer","data":[69,70,50,195,200,25,229,171,54,153,4,181,203,246,141,38,158,1,60,196]},"announce":[],"urlList":[]}}