{"title":"Brente Engler - Svart Vitenskap - 2009 - DCR","uid":4804438,"size":69394450,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:45a5804a4deea4c8e1a4ebd22b76980a4af5b4ed&amp;dn=Brente+Engler+-+Svart+Vitenskap+-+2009+-+DCR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kelmart","files":-1,"time":1238154787,"description":"Brente Engler (Norwegian for Burned Angels) is a peculiar black metal project hailing from the small village of Koppang in Norway. The official credits for the first release that was sent to BELLVM GERITE listed three members: Kjell Hagen (vocals, guitars, bass, drums), Johannes Berg and Tor Olsen. Kjell never really explained who the other two people listed in the credits are and how they contributed to the project. An old friend of his who now lives in Lillehammer expressed doubts about their very existence. He also revealed that Kjell had spent over 6 months in a psychiatric hospital after he had a mental breakdown due to a long history of suffering from depression and delusions. He is no longer able to work due to his mental illness and lives on welfare - roughly 8000 NOK per month (about 900 EUR/1200 USD). The debut release Svart Vitenskap (Black Science) features mostly slow blast beats accompanied by monotonous and grim riffs but also fast and aggressive passages. Unlike most digitally released contemporary black metal the sound is clean, uncompressed and low in volume to allow more dynamic depth - the way music used to be released prior to the Loudness War which originated in the Eighties. The most curious thing about the release are the lyrics though. Do not be fooled by the Norwegian song names, Kjell does not sing in English or Norwegian. It is currently unknown which language he is using and when he was asked about it in a phone interview he jokingly replied: &quot;Jeg synger med englerÃƒÂ¸st!&quot; (I sing with the voice of an angel!) Many people erroneously think it is Norwegian or even a Slavic language but that is definitely not the case. Kjell does not appear to hold his own music in high regard: &quot;I was listening to Darkthrone's Transilvanian Hunger a lot back when I started Brente Engler and it's so monotonous, slow and simple... yet so effective and mesmerising. When I hear it I think of random highlights in my life, like that mailwoman who smiled at me for a second, a few days ago. Don't get me wrong, what I make sounds nothing like them, I think, but the concept fascinated me and it is also why I chose this particular speed, possibly even the idea behind a few riffs. That album is also the reason why I use two guitars instead of just one even though they play exactly the same most of the time. I do not make music for money, for fame or even because I particularly enjoy it. What can I say, I haven't eaten anything in two days. It's more of an irrational obsession I have. I keep on making more because I have no other choice and it is quite saddening actually, because I do not like my music. Every single time I try to create anything I just fail. As soon as I touch an instrument the music is doomed to fail. The music is repetitive, unimaginative, it has boring riffs, my vocal technique is pathetic, my equipment blows, I can't afford much. The only good thing about it is that it doesn't participate in this dumb digital volume war. Dynamic range compression is a fucking crime and it's a shame that it is so common nowadays, even in black metal. Not many artists have the guts to go against it, releasing music with the digital release volume of, say, Vikerne's Aske [editor's note: he was referring to Kristian Vikernes of Burzum]. But what can I do about it? I just sit here and I keep on rolling more cigarettes with the walls staring back at me. I have achieved absolutely nothing as a musician and I never will.&quot;","torrent":{"xt":"urn:btih:45a5804a4deea4c8e1a4ebd22b76980a4af5b4ed","amp;dn":"Brente+Engler+-+Svart+Vitenskap+-+2009+-+DCR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45a5804a4deea4c8e1a4ebd22b76980a4af5b4ed","infoHashBuffer":{"type":"Buffer","data":[69,165,128,74,77,238,164,200,225,164,235,210,43,118,152,10,74,245,180,237]},"announce":[],"urlList":[]}}