{"title":"Pinoy Poker With Holdem Indicator(A Poker Odds Calculator)","uid":4093010,"size":25379940,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:46382bd87081c23ff8200ff69c90f4d655595c9c&amp;dn=Pinoy+Poker+With+Holdem+Indicator%28A+Poker+Odds+Calculator%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kamusta","files":1,"time":1206158474,"description":"Pinoy Poker With Holdem Indicator(A Poker Odds Calculator)\n\n Holdem IndicatorTM, the state-of-the-art online poker odds calculator, offers instant poker odds, real time opponent statistics and betting patterns in simple and easy to understand displays. With this feature-rich poker odds calculator, you?ll immediately have every piece of information you need to make intelligent and profitable decisions.\n\n    * Automatically attaches to the game table while it auto-reads your cards, absolutely no input required during your online play, allowing you to fully concentrate on the game.\n    * Instantly calculates accurate win odds, pot odds, outs, and table position. Shows EV and Sklansky Group ratings for your hole cards.\n    * Shows your opponents mucked cards immediately after showdown so you don&amp;#039;t have to retrieve hand history or numerous emails from your poker site.\n    * YOU HAVE THE NUTS ALERT: Eliminates any confusion when you have the best possible hand. This way you can concentrate on how to extract the most money possible from your helpless opponents.\n\n\n# Opponent Stats helps you better understand your opponent&amp;#039;s playing styles. You can even run Hold&amp;#039;em Indicator while you wait to sit at a table, collecting vital player information - before you ever risk a cent! NO other poker calculator on the market has this feature!\n# During play, Holdem Indicator categorizes your opponents based on hard evidence (Loose/Tight, Aggressive/Passive, Solid/Overplay), which helps you find the fish, bully the rocks, and exploit the maniacs.\n# Hold&amp;#039;em Indicator even tracks your own playing style, and lets you know what others may be thinking about your play.\n\n\n","torrent":{"xt":"urn:btih:46382bd87081c23ff8200ff69c90f4d655595c9c","amp;dn":"Pinoy+Poker+With+Holdem+Indicator%28A+Poker+Odds+Calculator%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46382bd87081c23ff8200ff69c90f4d655595c9c","infoHashBuffer":{"type":"Buffer","data":[70,56,43,216,112,129,194,63,248,32,15,246,156,144,244,214,85,89,92,156]},"announce":[],"urlList":[]}}