{"title":"Quincy S02E05 The Two Sides of Truth  DVDRip  DivX","uid":4403025,"size":419708438,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:46b44a016dbc876289ceab069f42195645118e55&amp;dn=Quincy+S02E05+The+Two+Sides+of+Truth++DVDRip++DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lee.ka","files":3,"time":1221798955,"description":"Quincy, M.E. (1977)\nS02E05 The Two Sides of Truth\nFirst aired: 2/25/1977\n \nIn a court appearance Quincy comes up against his old professor, Dr. Herbert Stone, who is an expert witness for the defence. Stone comes up with a completely different view of the medical evidence than Quincy, which causes Quincy to become confused and unsure of his own opinion. Because of this the prosecution loses. Later they appear to be on opposite sides again in another case. Stone refutes evidence that Quincy has found that shows that a rich businessman died in a fire. Quincy is upset when the Assistant DA points out that his old professor is now just selling his expertise to whoever will pay him.  Joseph Campanella, John Saxon, guest star.\n\nCast: Jack Klugman (Quincy, M.E.), Garry Walberg (Lt. Frank Monahan), Robert Ito (Sam Fujiyama), Lynette Mettey (Lee Potter), Val Bisoglio (Danny Tovo), John S. Ragin (Dr. Robert Astin), Joseph Roman (Sgt. Brill)\n \nGuest cast: Joseph Campanella (Max Wilbur), June Dayton (Judge), Barry Sullivan (Dr. Stone), Michael Callan (Farrell), Mark Goddard (Borland), AimÃƒÂ©e Eccles (Alice Ting), Suzanne Rogers (Elaine Farrell), Jason Wingreen (Dr. Freeman), Lynn Tufeld (Nurse), Jackie Russell (Billings), Harold Ayer (Gate Guard), James Ingersoll (Assistant D. A.), John Saxon.\nDirector: Jackie Cooper\n\nDVD&gt;DivX/640x480/1009kbps/23.976fps/mp3/48KHz/stereo/103Kbps/49min/400Mb","torrent":{"xt":"urn:btih:46b44a016dbc876289ceab069f42195645118e55","amp;dn":"Quincy+S02E05+The+Two+Sides+of+Truth++DVDRip++DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46b44a016dbc876289ceab069f42195645118e55","infoHashBuffer":{"type":"Buffer","data":[70,180,74,1,109,188,135,98,137,206,171,6,159,66,25,86,69,17,142,85]},"announce":[],"urlList":[]}}