{"title":"Food Culture in the Mediterranean","uid":6624849,"size":2289827,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:46db92fe19a4102289bb87841011b6d6c1930981&amp;dn=Food+Culture+in+the+Mediterranean&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lionzbay","files":1,"time":1314120131,"description":"\nAuthor(s): Carol Helstosky\nPublisher: Greenwood\nDate: 2009\nFormat: PDF\nLanguage: English\nISBN10: 0313346267\nPages: 189\n\nFood that originated from the Mediterranean area is incredibly popular. Pasta, pizza, gyros, kebab, and falafel can be found just about everywhere. Many people throughout the world have a good idea of what Mediterranean cuisine and diet are all about, but they know less about the entire food culture of the region. This one-stop source provides the broadest possible understanding of food culture throughout the region, giving a variety of examples and evidence from the southern Mediterranean or North Africa (Morocco, Algeria, Tunisia, Libya, and Egypt), the Western Mediterranean or European side of the Mediterranean (Spain, France, Italy, and the French and Italian islands), to the eastern Mediterranean or Levant (Greece, Turkey, Syria, Lebanon, and Israel).\n\nThe Mediterranean region region is home to three of the world's major religions, and for centuries, the Mediterranean Sea has been an invitation to trade, travel, conquest, and immigration. Where different cultures, beliefs, and traditions mix there is always volatility and tension, but there is also great energy. Understanding the food culture in the Mediterranean is one way readers can see how people of different regions come together, share ideas and information to create new dishes, meals, traditions, and forms of sociability. This volume answers questions such as Do people in the Mediterranean still eat the Mediterranean Diet or do they eat American style? Why is it that the same ingredients can be prepared in so many different ways, even in the same country? Why would cooks take the time to make foods like zucchini, lentils, or figs into dozens of different dishes? How and why do religious rituals differ regarding food preparation? What do Jews, Muslims, and Christians eat on religious holidays? Do people eat out or eat at home? Why is hospitality so important to Mediterranean people and what do they do to demonstrate hospitality and good will through the preparation and serving of meals?","torrent":{"xt":"urn:btih:46db92fe19a4102289bb87841011b6d6c1930981","amp;dn":"Food+Culture+in+the+Mediterranean","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46db92fe19a4102289bb87841011b6d6c1930981","infoHashBuffer":{"type":"Buffer","data":[70,219,146,254,25,164,16,34,137,187,135,132,16,17,182,214,193,147,9,129]},"announce":[],"urlList":[]}}