{"title":"Bad Girls of Film Noir-Vol 1 - The Killer that Stalked New York ","uid":11426130,"size":7724562432,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4757bcc493b92bb9660c343dd35f1bfb4ba8ad6c&amp;dn=Bad+Girls+of+Film+Noir-Vol+1+-+The+Killer+that+Stalked+New+York+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SaM","files":-1,"time":1415667421,"description":"Bad Girls of Film Noir-Vol 1 - The Killer that Stalked New York (1950) - Two of a Kind (1951) DVD9 [DDR]\n-----------------------------------------------------------------------\n\nThe Killer that Stalked New York (1950) - Evelyn Keyes, Dorothy Malone [DDR]\n\nThe Killer That Stalked New York (also knoin as Frightened City) is a 1950 film noir starring Evelyn Keyes. \nThe film, shot on location and in a semi-documentary style, is about diamond smugglers who unknowingly start a smallpox outbreak in the New York City of 1947. \nIt is based on the real threat of a smallpox epidemic in the city, as described in a story taken from a 1948 Cosmopolitan magazine article\n\n    CAST:-\n    Evelyn Keyes as Sheila Bennet\n    Charles Korvin as Matt Krane\n    William Bishop as Dr. Ben Wood\n    Dorothy Malone as Alice Lorie\n    Lola Albright as Francie Bennet\n    Carl Benton Reid as Health Commissioner Ellis\n    Ludwig Donath as Dr. Cooper\n    Art Smith as Arnold Moss\n    Whit Bissell as Sid Bennet\n    Roy Roberts as the Mayor\n    Connie Gilchrist as Belle\n    Jim Backus as Willie Dennis\n    Richard Egan as Treasury Agent Owney\n    Harry Shannon as Police Officer Houlihan\n    Beverly Washburn as Walda Kowalski - six-year-old\n\nDirected by Earl McEvoy\nProduced by Robert Cohn\nScreenplay by Harry Essex\nRunning time 79 minutes\n\nMOVIE PLOT:- The Killer That Stalked New York (1953)\nArriving at New York City's Pennsylvania Station after a trip to Cuba, Sheila Bennet (Evelyn Keyes), who is smuggling $50,000 worth of diamonds into the country, realizes she's being followed by the authorities. She mails the diamonds to her husband, Matt Krane (Charles Korvin), instead of carrying them around, and then tries to shake the Treasury agent following her.\n\nFeeling sick, Sheila nearly faints on the street, so a cop takes her to a local clinic. While there, she encounters a little girl and inadvertently infects her. Sheila is misdiagnosed as having a common cold, and she leaves and returns home. After the girl is admitted to the hospital, she is found to have smallpox.\n\nMeanwhile, Matt has been cheating on Sheila with her sister, Francie (Lola Albright), and then attempts to take off without either of them when the diamonds finally arrive through the mail. Unfortunately for him, the fence cannot buy the diamonds because they are too hot. Matt will have to wait for ten days for the cash, so he cannot leave New York. Sheila confronts Francie, who kills herself afterward due to Matt's betrayal of them both. This gives Sheila more reason to get revenge on him.\n\nFinding a growing number of smallpox victims, city officials decide to vaccinate everyone in New York to prevent an epidemic, but quickly run out of serum. This causes a panic in the city. Tracking the victims, agents realize that the disease carrier and the diamond smuggler are one and the same. However, an increasingly sick Sheila continues to elude capture. Still unaware that she has smallpox, she returns to the doctor at the clinic to get more medicine. The doctor explains her illness and tries to talk her into turning herself in, but she shoots him in the shoulder and escapes.\n\nSheila eventually catches up with Matt, who tries to escape from the police, but falls from a building ledge to his death. Sheila nearly attempts to drop herself from the ledge, until the doctor tells her the little girl she met had died. Remorseful, Sheila turns herself in and, before succumbing to the disease, provides authorities with a badly needed list of those she contacted.\n\nCRITICAL RESPONSE:-\nThe New York Times film critic, Bosley Crowther, gave the film a mixed review, writing, &quot;But, unfortunately, the script of Harry Essex, based on a factual magazine piece, has a bad tendency to ramble and to confuse two separate hunts. And the performances of the principal characters, while adequate, have little punch. Evelyn Keyes, as the fugitive smallpox carrier, manifests great discomfort and distress, but she is no more than a melodramatic cipher in a loosely organized &quot;chase.&quot; William Bishop is blankly youthful as the physician and Charles Korvin is conventional as the lady's no-good husband who tries to give her the brush. Others are moderately effective in a potentially but not sufficiently intriguing film.&quot;\n\nFilm critic Dennis Schwartz gave the film a mixed review as well and wrote, &quot;There's not much in the way of thrills or surprises in this minor film noir ... The action part of the melodramatic story was weakly told, while the noir characterizations of Sheila did capture the desperate feelings of the subject but it was not enough to overcome the overall inability of the story to have a heart to it. The city officials and Dr. Wood running around the city to stem the epidemic, seemed hard to fathom. The mechanical acting by everyone, except for Keyes, and the unconvincing action scenes made the film appear as the B film it was, despite the great noir camerawork of Joseph Biroc who caught how dark the city could be for someone on-the-run.&quot;\n\n==========================================================================\n\nTwo of a Kind (1951) - Edmond O'Brien, Liz Scott [DDR]\n\nTwo of a Kind is a 1951 film noir directed by Henry Levin, and written by James Edward Grant, James Gunn, and Lawrence Kimble. \nThe film features Edmond O'Brien, Lizabeth Scott, Alexander Knox, among others.\n\n    CAST:-\n    Edmond O'Brien as Lefty Farrell\n    Lizabeth Scott as Brandy Kirby\n    Terry Moore as Kathy McIntyre\n    Alexander Knox as Vincent Mailer\n    Griff Barnett as William McIntyre\n    Robert Anderson as Todd\n    Virginia Brissac as Maida McIntyre\n\nDirected by Henry Levin\nProduced by William Dozier, James Gunn\nScreenplay by Lawrence Kimble, James Gunn\nMusic by George Duning\nRunning time 75 minutes\n\nMOVIE PLOT:- Two of a Kind (1951)\nLefty Farrell (O'Brien) links up with con artists Brandy Kirby (Scott) and Vincent Mailer (Knox). The three concoct a scheme to rob a rich couple out of ten million dollars by having Farrell pose as the couple's long-lost son. When the husband refuses to change his will, Kirby and Mailer decide to kill them. Farrell confesses the scam to the elderly couple, which prompts Mailer to add him to his list of potential victims.\n\nBrandy Kirby and crooked Lawyer Vincent Mailer plan to rob William and Maida McIntyre by producing a convincing double for their long-lost son. Brandy charms gambler Lefty Farrell into impersonating the missing son. Kathy, the McIntyre's niece, who likes Lefty, introduces him to the McIntyres who soon become convinced he is their son, but the old man refuses to change his will. Lefty balks at killing McIntyre and exposes Mailer's attempted swindle. Brandy and Lefty end up together as &quot;two of a kind.&quot; \n\nCardsharp Edmond O'Brien gets more than he bargained for when he links up with con artists Lizabeth Scott and Alexander Knox. The trio plot to fleece a wealthy couple out of ten million dollars by having O'Brien pose as the couple's long-lost son. When the husband (Griff Barnett) refuses to change his will, Scott and Knox plan to bump him off. O'Brien may be a crook, but he's no murderer, so he balks at the plan and confesses the scam to the elderly couple--prompting Knox to add O'Brien to his list of potential victims. When Scott decides to pull out of the plan as well, Knox is run out of town, leaving the girl with O'Brien--truly &quot;two of a kind,&quot; who'll be able to line up suckers elsewhere.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 5863 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 154 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:4757bcc493b92bb9660c343dd35f1bfb4ba8ad6c","amp;dn":"Bad+Girls+of+Film+Noir-Vol+1+-+The+Killer+that+Stalked+New+York+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4757bcc493b92bb9660c343dd35f1bfb4ba8ad6c","infoHashBuffer":{"type":"Buffer","data":[71,87,188,196,147,185,43,185,102,12,52,61,211,95,27,251,75,168,173,108]},"announce":[],"urlList":[]}}