{"title":"Toots Thielemans - Live 1987","uid":6715224,"size":377935698,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:47c2ad4addcaefc2b6b7c55a7ea09b373bdf2d89&amp;dn=Toots+Thielemans+-+Live+1987&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1317547471,"description":"Jean-Baptiste Frederic Isidor, Baron Thielemans (born 29 April 1922, Brussels, Belgium), known as Toots Thielemans, is a Belgian jazz musician well known for his guitar and harmonica playing as well as his whistling. Thielemans is credited as one of the greatest harmonica players of the 20th century. In 2009 he became NEA Jazz Master, the highest honour for a jazz musician in the United States.\n\n- - -\n\nThielemans started his career as a guitar player. In 1949 he joined a jam session in Paris with Sidney Bechet, Charlie Parker, Miles Davis, Max Roach and others. In 1949 and 1950 he participated in European tours with Benny Goodman, making his first record in Paris with fellow band member, tenor saxophonist Zoot Sims. In 1951 he went on tour with Bobbejaan Schoepen.\n\nHe moved to the US in 1952 where he was a member of Charlie Parker's All-Stars and worked with Miles Davis and Dinah Washington. He played and recorded with Ella Fitzgerald, Jaco Pastorius, Peggy Lee, The George Shearing Quintet, Quincy Jones, Oscar Peterson, Bill Evans, Paul Simon, Billy Joel, The Happenings, Astrud Gilberto, Shirley Horn, Elis Regina and others.\n\nA jazz standard by Toots Thielemans is Bluesette, where he used whistling and guitar in unison. First recorded by Toots in 1962, with lyrics added by Norman Gimbel the song became a major worldwide hit. His harmonica playing can also be heard in film scores such as Midnight Cowboy, Jean de Florette, Sugarland Express, The Yakuza, Turkish Delight, The Getaway, French Kiss, Dunderklumpen, and in various TV programs, including Sesame Street, the Belgian TV series Witse, and the Dutch TV series Baantjer. He composed the music for the 1974 Swedish film Dunderklumpen! in which he also voiced the animated character Pellegnillot.\n\nHis whistling and harmonica playing can be heard on Old Spice radio and TV commercials that have been made over the years. During the 1980s he performed with bassist and composer/bandleader Jaco Pastorius in ensembles ranging from duet to the Word of Mouth Big Band. In 1983 he contributed to Billy Joel's album An Innocent Man, and his trademark harmonica can be heard on Leave a Tender Moment Alone. A year later, he appeared on the Julian Lennon song Too Late For Goodbyes, from the album Valotte. In 1984, he recorded the final album of Billy Eckstine (I Am A Singer), featuring very beautiful ballads and standards arranged and conducted by Angelo DiPippo. In the 1990s Thielemans embarked on theme projects that included world music. In 1998 he released a French flavoured album titled Chez Toots, that included the Les Moulins De Mon Coeur (The Windmills of Your Mind) featuring guest singer Johnny Mathis. Apart from his popularity as an accomplished musician, he is well liked for his modesty and kind demeanor. In his native Belgium, he is also popular for describing himself as a Brussels ket, which means street kid in old Brussels slang. He received a joint honorary doctorate from the Universite Libre de Bruxelles and the Vrije Universiteit Brussel (Belgium) and in 2001 Thielemans was ennobled a baron by King Albert II of Belgium.\n\nIn 2005 he was nominated for the title of The Greatest Belgian. In the Flemish version he ended 20th place, in the Walloon version he ended 44th place. In October 2008, he was honored with the 2009 National Endowment for the Arts Jazz Masters Fellowship. On 23 January 2009, he joined Philip Catherine on stage at the Liberchies (Belgium) church in memory of the 100th anniversary of Django Reinhardt's birth.\n\n- - -\n\nThielemans may have had a significant impact on The Beatles, John Lennon in particular, during the group's pre-fame formative years. While performing in 1959 in Hamburg, Lennon (sometimes with fellow Beatle George Harrison in tow) would often go over to the club where Toots was performing (in a noontime residency) as a member of The George Shearing Quintet. Lennon was evidently taken with Toots' harmonica playing and guitar selection: an electric American made Rickenbacker with a short scale neck. \nBased on the sound Lennon heard, he decided to purchase a natural alder wood alderglo colored three pickup Rickenbacker 1958 model 325 Capri guitar with a short scale as Harrison would recall to various interviewers many years later. This guitar, often fondly referred to as the Holy Grail of all guitars, was customized and tinkered with many times over the years by Lennon and re-painted to jetglo black: it was the guitar he played on The Beatles first and third appearance on The Ed Sullivan Show during February 1964). Lennon also adopted the chromatic harmonica, which was used on the group's early recordings.\n(wikipedia)\n\n- - -\n\nToots Thielemans - Live  1974, 1976 &amp; 1978\n(Polydor West Germany 1987)\n\n 1. Days of wine and roses\n 2. Lullaby\n 3. Tenor madness\n 4. Nice to be around\n 5. Strange boogie man\n 6. Dat mistige rooie beest\n 7. Dream girl\n 8. I do it for your love\n 9. Youre my blues machine\n10. Autumn leaves\n11. My little Anna\n12. C-jam blues\n\n\nNiels Henning Orsted Pedersen, bass\nRob Langereis, bass\nWim Overgaauw, guitar\nRob Franken, electric piano\nBruno Castolucci, drums\nJoop Scholten, guitar\nVictor Kaihatu, bass\nCees Schrama, tambourine and metronome\n","torrent":{"xt":"urn:btih:47c2ad4addcaefc2b6b7c55a7ea09b373bdf2d89","amp;dn":"Toots+Thielemans+-+Live+1987","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47c2ad4addcaefc2b6b7c55a7ea09b373bdf2d89","infoHashBuffer":{"type":"Buffer","data":[71,194,173,74,221,202,239,194,182,183,197,90,126,160,155,55,59,223,45,137]},"announce":[],"urlList":[]}}