{"title":"The World That Never Was: A True Story of Dreamers, Schemers, An","uid":6713175,"size":4778138,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4846c10620b2a415512c4915ae27b91087729806&amp;dn=The+World+That+Never+Was%3A+A+True+Story+of+Dreamers%2C+Schemers%2C+An&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"acosmic","files":-1,"time":1317439871,"description":"The World That Never Was: A True Story of Dreamers, Schemers, Anarchists and Secret Agents\nby Alex Butterworth\n\n\nReports that al-Qaeda operatives were studying Bakunin have encouraged journalists to explain twenty-first-cenutry Jihadists by quoting nineteenth-century anarchists. Butterworth fears that ignorance of anarchist principles often makes these explanations misleading. And it is genuine understanding of this forgotten tradition that he here offers. Readers learn of the piquant personalities of prominent anarchists (including the volatile Bakunin, the passionate Kropotkin, and the peripatetic Rochefort) and of the diverse settings (from the steppes of Russia to the stockyards of Chicago) in which they pursued their political dreams. But it is finally ideas that trump character and geography. Very far from the religious principles of Jihadists, these ideas promise a secular world of free individuals finding social justice without institutional coercion. Though Butterworth represents these hopes sympathetically, we witness their dark transformation, as frustrated idealists turn to violence and terrorism. We also detect an even more troubling metamorphosis in the government agents charged with ferreting out these subversives. Okhrana officers serving the czar set the tone, but soon police commissioned by Western democracies follow suit, trampling on the rights of ordinary citizens in the name of the law. Butterworth urges his readers to recognize the alarming contemporary parallels. A narrative taut with intrigue and freighted with contemporary significance. (Bryce Christensen)","torrent":{"xt":"urn:btih:4846c10620b2a415512c4915ae27b91087729806","amp;dn":"The+World+That+Never+Was%3A+A+True+Story+of+Dreamers%2C+Schemers%2C+An","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4846c10620b2a415512c4915ae27b91087729806","infoHashBuffer":{"type":"Buffer","data":[72,70,193,6,32,178,164,21,81,44,73,21,174,39,185,16,135,114,152,6]},"announce":[],"urlList":[]}}