{"title":"Tillie Olsen - Tell Me a Riddle (pdf)","uid":10800215,"size":1735489,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48fdd2e67539f7b97f4f45ab3a0b0e6b8ebf922f&amp;dn=Tillie+Olsen+-+Tell+Me+a+Riddle+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1408337199,"description":"Tillie Olsen - Tell Me a Riddle (Dell, 1989). 116 pages.\n\nImproved version of an older scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to the original scanner.\n\n\ndescription:\n\nThis collection of four stories, &quot;I Stand Here Ironing,&quot; &quot;Hey Sailor, what Ship?,&quot; &quot;O Yes,&quot; and &quot;Tell me a Riddle,&quot; had become an American classic.  Since the title novella won the O. Henry Award in 1961, the stories have been anthologized over a hundred times, made into three films, translated into thirteen languages, and - most important - once read, they abide in the hearts of their readers.\n\n**\n\nFrom Library Journal\n\nOlsen, the writer, teacher, and 1930s left-wing activist, was born in 1912 of East European parents committed to Socialist and Jewish enlightenment values. Her work reflects the discrimination and marginalization she felt as a young girl growing up in Omaha, Nebraska. Like other women of the time, Olsen was underappreciated even in leftist circles, which suffered much the same gender bias as the larger society. &quot;Tell Me a Riddle,&quot; which received the O. Henry first prize for best American short story in 1961, is reprinted in this volume (edited by Rosenfelt, women's studies, Univ. of Maryland) along with seven critical essays by feminist literary scholars, previously published in books or journals, that give a contemporary appreciation to Olsen's work. Highly recommended for multicultural collections, women's studies, and all American literature collections.\n\nReview\n\n&quot;These stories have the lyric intensity of an Emily Dickinson poem and the scope of a Balzac novel.&quot; -- from the judges' citation for the Rea Award for the Short Story\n\n","torrent":{"xt":"urn:btih:48fdd2e67539f7b97f4f45ab3a0b0e6b8ebf922f","amp;dn":"Tillie+Olsen+-+Tell+Me+a+Riddle+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48fdd2e67539f7b97f4f45ab3a0b0e6b8ebf922f","infoHashBuffer":{"type":"Buffer","data":[72,253,210,230,117,57,247,185,127,79,69,171,58,11,14,107,142,191,146,47]},"announce":[],"urlList":[]}}