{"title":"2 Novels by Rachel Hanna","uid":8829522,"size":413348,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:497cf2fade5d9c497cce3e77cb845220ffd211f1&amp;dn=2+Novels+by+Rachel+Hanna&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":2,"time":1376931181,"description":"Unbreakable\nSophie Morgan is a problem, or at least her parents think so. She is beyond the normal coming of age problems other eighteen year olds have, and her parents are tired of dealing with her issues. When they decide to send her to stay with her aunt and uncle on a ranch in Texas, she is fuming mad and sure that she can't and won't learn a thing from being around horses and manure all the time.\nThat is until she meets tasty Miller Rhodes. Straight laced but immensely hot, Miller rubs Sophie the wrong way from the start. But when he helps to save her from herself, a friendship starts to bloom. As the years pass, Miller changes and it will soon be Sophie's turn to save him right back.\n\nRuined\nWillow Blake has a secret. A big one. And when she and her mother move cross country to protect that secret, her guard is up to protect her heart.\nWhen she meets handsome Reed Miller, she feels her walls start tumbling down and the fear is overwhelming. If he finds out her secret, will he hate her forever?\nJust when she thinks things are settling down, a new house guest makes her second guess everything she knows to be true about who she is and what she wants.\nCaught between her past life and her new one - and two sexy men - will choose to be alone or fight for her own happiness?","torrent":{"xt":"urn:btih:497cf2fade5d9c497cce3e77cb845220ffd211f1","amp;dn":"2+Novels+by+Rachel+Hanna","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"497cf2fade5d9c497cce3e77cb845220ffd211f1","infoHashBuffer":{"type":"Buffer","data":[73,124,242,250,222,93,156,73,124,206,62,119,203,132,82,32,255,210,17,241]},"announce":[],"urlList":[]}}