{"title":"Coast to Coast AM June 14, 2013 - Animal Communications Open Lin","uid":8586578,"size":55386459,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4a2dceb06d60f4a1a2da4ceb34c9acb6155b85a2&amp;dn=Coast+to+Coast+AM+June+14%2C+2013+-+Animal+Communications+Open+Lin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1371546673,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-14-13\nHost:\nGeorge Noory\nGuests:\nJocelyn  Kessler,                   Open  Lines\nIn the first half, animal communicator and intuitive Jocelyn Kessler discussed the energetic connection between animals and humans. Kessler traced her ability to communicate with animals back to her childhood, when she began perceiving emotional energy from her pets. This energy, she said, was &quot;so precise that I could hear words&quot; which were difficult to decipher. Following an accident involving her horses, Kessler's ability became stronger and she was able to understand the words being communicated to her via this energy. Over time, she claimed, her skills at conversing with animals developed to the point where she can now understand &quot;everything they are trying to communicate.&quot; \nKessler shared a number of insights from her years communicating with dogs in various settings. She explained that dogs are &quot;in the moment,&quot; so that they speak simply and focus on the present. In recounting a standard session communicating with a dog, Kessler revealed that &quot;it is a huge relief for them&quot; since they can now speak to someone &quot;on a different level&quot; and clearly convey their message to a human for the first time. According to Kessler, some of the concerns expressed to her by dogs include issues surrounding a disconnection with their human companions, blockages in their chakras, and worries about being ill. As to why dogs run away, Kessler acknowledged that there are a variety of reasons, but the primary cause is that their mind has become static where &quot;instinct and being 'in the moment' has left for the dog and they're trying to run and find it.&quot;  \n------------------------------------ \nDuring Open Lines, Sam in Kansas City talked about his UFO encounter which happened about six weeks ago. While stargazing late at night, he saw an orange light hovering above the trees. After thinking to himself &quot;that's kind of cool,&quot; the light began moving towards him until it was directly over his head. He described the object as a circular disc that was surrounded by orange lights. Suddenly, the UFO cast a beam of light at him and conveyed an image to his mind. This image, Sam said, was of a man and his son going through an octagonal portal. He theorized that it was some kind of teleportation device and posited that it may be related to the claims of alleged time traveler Andrew Basiago. \nLater in the program, an anonymous caller in Los Angeles told a chilling tale of government harassment which befell his family. He recounted how, since his uncle was a nuclear safety technician, his aunt drew the suspicion of the government after she introduced herself to their new neighbors, who happened to be on the terrorist watch list. Following this innocent exchange of pleasantries, his aunt's home began being broken into, unmarked vehicles followed her while she worked delivering newspapers, and she received threatening phone calls. The anonymous caller claimed that the harassment, which lasted for over seven years, grew so pervasive and stressful that his aunt ultimately took her own life. \nNews segment guests: Catherine Austin Fitts &amp; Rhettman Mullis\nWebsite(s):\n jocelynkessler.com\nBook(s):\n The Secret Language of Dogs\n","torrent":{"xt":"urn:btih:4a2dceb06d60f4a1a2da4ceb34c9acb6155b85a2","amp;dn":"Coast+to+Coast+AM+June+14%2C+2013+-+Animal+Communications+Open+Lin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a2dceb06d60f4a1a2da4ceb34c9acb6155b85a2","infoHashBuffer":{"type":"Buffer","data":[74,45,206,176,109,96,244,161,162,218,76,235,52,201,172,182,21,91,133,162]},"announce":[],"urlList":[]}}