{"title":"Functionalization of Polyolefins - T.C. Mike Chung","uid":15357523,"size":7161921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4acea3b256ac1e9c1479c23c7d94abdaa0c37142&amp;dn=Functionalization+of+Polyolefins+-+T.C.+Mike+Chung&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468989935,"description":"Functionalization of Polyolefins - T.C. Mike Chung (AP, 2002).pdf\r\n\r\nPolyolefins are the most widely used commercial polymers and their functionalization has been a long standing scientific challenge and an industrially important area. In recent decades significant progress has been made in the area, with exciting results reported in many journals.\r\n\r\nFunctionalization of Polyolefins is the first book to summarize the significant experimental results on the functionalization of polyolefins and classify them into several chemical methods (shown in each chapter of this book). The book also provides an update on the functional polyolefin materials available today.\r\n\r\nThe two key subject categories covered are:\r\n*Chemical approaches in the functionalization of polyolefins\r\n*New available polyolefin materials and their potential applications\r\n\r\nThe book includes:\r\n*The historic development and future prospects for polyolefins\r\n*Functionalization chemistry, classified into four general approaches\r\n*Chemical approaches with experimental results\r\n*Functionalization approaches\r\n\r\nThe book provides an invaluable reference for researchers in industry and academia interested in functionalization chemistry and polymers. It has been developed through Professor Chung's own teaching experience, both at Pennsylvania State University and on short courses. It is therefore ideally suited as a core text for advanced polymer chemistry and courses on polyolefins and polymers, as well as being a useful supplementary reference for introductory courses on polyolefin chemistry and materials.\r\n\r\nT.C. Mike Chung is Professor of Polymer Science in the Materials Science and Engineering Department, Pennsylvania State University, USA. He is one of the most experienced people in the field of polyolefin functionalization, with a wide-ranging knowledge gained through many years of experience both in academia and industry.\r\n\r\n\r\nShows the available functionalisation approaches with a discussion of their scope and limitations\r\nWritten by one of the most experienced people in this field","torrent":{"xt":"urn:btih:4acea3b256ac1e9c1479c23c7d94abdaa0c37142","amp;dn":"Functionalization+of+Polyolefins+-+T.C.+Mike+Chung","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4acea3b256ac1e9c1479c23c7d94abdaa0c37142","infoHashBuffer":{"type":"Buffer","data":[74,206,163,178,86,172,30,156,20,121,194,60,125,148,171,218,160,195,113,66]},"announce":[],"urlList":[]}}