{"title":"A Nameless Witch by A. Lee Martinez {dwg}","uid":11251279,"size":2394839,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b67a9972ff7562fc7b25c037c8eb4a9afb6bbb9&amp;dn=A+Nameless+Witch+by+A.+Lee+Martinez+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1413836358,"description":"A tale of vengeance, true love, and cannibalism.\n\nBeing born undead can have its disadvantages, such as eternal youth and flawless beauty; things most unsuitable for a witch. Hiding behind the guise of a grimy old crone, the witch is content living outside Fort Stalwart with her unlikely band of allies: a troll named Gwurm, an enchanted broom, and a demonic duck named Newt. She leads a simple life filled with spells, potions, and the occasional curse.\n\nSo when a White Knight arrives at Fort Stalwart, the witch knows her days of peace are at an end. The Knight is just days in front of a horde of ravenous goblings, and Fort Stalwart lies right in the horde's path. But the goblings are just the first wave of danger, and soon the witch and the Knight must combine forces on a perilous quest to stop a mad sorcerer from destroying the world.\n\nFilled with menace, monsters, and magic, A Nameless Witch is a properly witchly read by the award-winning author of Gil's All Fright Diner and In the Company of Ogres","torrent":{"xt":"urn:btih:4b67a9972ff7562fc7b25c037c8eb4a9afb6bbb9","amp;dn":"A+Nameless+Witch+by+A.+Lee+Martinez+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b67a9972ff7562fc7b25c037c8eb4a9afb6bbb9","infoHashBuffer":{"type":"Buffer","data":[75,103,169,151,47,247,86,47,199,178,92,3,124,142,180,169,175,182,187,185]},"announce":[],"urlList":[]}}