{"title":"Ladytron - Witching Hour[FLAC - LOSSLESS]","uid":4181331,"size":362100451,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4b831829a1c2bdf612ea0a449cbb2396c16baf67&amp;dn=Ladytron+-+Witching+Hour%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"99AM","files":18,"time":1210380839,"description":"FLAC files + CUE sheet + Covers\nRelease date:04 Oct 2005.\n\n\nTrack Lising:\n1 High Rise\n2 Destroy Everything You Touch\n3 International Dateline\n4 Soft Power\n5 AMTV\n6 Sugar\n7 Fighting In Built Up Areas\n8 The Last One Standing\n9 Weekend\n10 Beauty*2\n11 Whitelightgenerator\n12 All The Way...\n\n\n\nEven though the warm breath of October has made it easier (here in Toronto, anyway) to pretend we&amp;#039;re still in July, the spell is becoming increasingly difficult to maintain. From the browning leaves to the scarves in the windows of the downtown department stores, it&amp;#039;s understood that we&amp;#039;re just playing in injury time now, and that any prickly chill might signal autumn&amp;#039;s speed trials on the way to another interminable winter.\n\nBeyond the first snowfall, I am not a finds-comfort-in-December kind of person, which is probably why my treasured winter albums mean a lot more to me than the summer ones. There&amp;#039;s something to be said for all records that lend themselves to certain seasons; the really good ones have this strange ability to extrapolate themselves across time. When Bj?s Vespertine came out in 2001, I knew it wasn&amp;#039;t just going to be a record I listened to a lot that winter, but in every one after it. It&amp;#039;s instant, like a mirror-in-mirror hallway, folding out into the future for God knows how long, always as much a mystery as it is a comfort.\n\nThis year, for reasons I haven&amp;#039;t figured out yet, I&amp;#039;m feeling like perhaps the good winter records are going to be even more important than usual. Maybe it&amp;#039;s because I&amp;#039;m getting older, and the mirrors are getting smaller. Or maybe it&amp;#039;s just going to be that much harder to fend off the creeping feeling of end days without the benefit of summer&amp;#039;s attendant glories.\n\nI won&amp;#039;t lie: I didn&amp;#039;t expect this to be one of those records. In fact, with the exception of a handful of singles, the best of which still felt brittle and two-dimensional, I never cared much for Ladytron. Granted, the whole electroclash thing getting levied against them seemed kind of unfair (the takeaway: keyboard basslines and polygonal haircuts are a gateway drug to dumb press), but for a type of music that was supposed to be emblematic of, if not a stand-in for, mountains of cocaine, Ladytron always seemed kind of enfeebled, their glassy tick-tock a weak substitute for anything properly muscular.\n\nIf they lacked the horsepower before, the year plus they spent touring behind 2002&amp;#039;s Light &amp; Magic put the meat on their bones. Despite being delayed for nearly a year thanks to the collapse of their UK label Telstar and the emergency room administration required for their still-dormant U.S. label Emperor Norton, The Witching Hour is the most urgent and immediate of their career. The earlier records were sort of toylike and plastic; this not only has a pulse, it has chilled blood in its veins.\n\nEvery quantum leap record has a quantum leap single, and in this case, it&amp;#039;s &quot;Destroy Everything You Touch&quot;. With a charging chorus and shivery production that sounds as equally indebted to shoegaze as it does synthpop, this is probably the most confident and menacing thing they&amp;#039;ve ever done. Almost as good is &quot;International Dateline&quot;, which marries a pogo punk rhythm and a post-punky guitar lead with a keening vocal hook. With nothing but a transparent wash of synths and a simple minor-key vocal melody, closer &quot;All the Way&quot; demonstrates that Ladytron&amp;#039;s advancement owes as much to their songwriting as it does to their increased production prowess. And, for better or worse, the barely concealed cocaine metaphor of &quot;Sugar&quot; (&quot;If I get the sugar, will you get me/ Something elusive and temporary&quot;) proves they could go there if they wanted to.\n\nBut perhaps the most surprising thing about The Witching Hour is how affecting it is. Beyond the crumbling synths and the uneasy washes of white noise are lyrics that move between sounding commanding and hopelessly lost; where vocalists Mira Aroyo and Helena Marnie once sang about things like movie theatres and Commodore computers from about four steps back from mic, they&amp;#039;re right between your ears now, their lungs fighting with the wheezing synths for airspace. That&amp;#039;s as good an illustration as any of how far they&amp;#039;ve come in these last three years: if Ladytron of old was a truckful of ice, this one&amp;#039;s a winter storm, bundled up people and all.\n\n(Review by Mark Pytlik from pitchforkmedia.com )\n\n\nEnjoy! ","torrent":{"xt":"urn:btih:4b831829a1c2bdf612ea0a449cbb2396c16baf67","amp;dn":"Ladytron+-+Witching+Hour%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b831829a1c2bdf612ea0a449cbb2396c16baf67","infoHashBuffer":{"type":"Buffer","data":[75,131,24,41,161,194,189,246,18,234,10,68,156,187,35,150,193,107,175,103]},"announce":[],"urlList":[]}}