{"title":"(2015) Admiral Fallow - Tiny Rewards [FLAC,Tracks] {100.XY}","uid":14559569,"size":322453526,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4baa183be38278270cf295ca5f2910cbcadfbcd0&amp;dn=%282015%29+Admiral+Fallow+-+Tiny+Rewards+%5BFLAC%2CTracks%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"100.XY","files":14,"time":1462727141,"description":"Review: \r\nThe Admiral Fallow you thought you knew is dead. The Scottish quintet used to be what you could call a folk-rock band, but they got swept up in their own ambitions and waved goodbye to the Tree Bursts in Snow era, looking firmly forward, focused only on what was to come. \r\nFast forward two years and just about the only recognisable things about the band’s sound are the signature elements, to wit: Kevin Brolly’s clarinet; Sarah Hayes’ flute; and Louis Abbott’s voice. \r\nThey have reinvented themselves; not in a self- conscious, Marcus Mumford-esque fit of pique, but as a challenge. Looking back, it’s easy to see how Tree Bursts in Snow could be seen as both a development, and the logical conclusion, of the sound they had settled on by the release of 2010’s Boots Met My Face. There were other places they could have gone, sure, but we’ll never know if those journeys would have provided them with enough material to put together an album. \r\n\r\nIt turns out that they would find inspiration elsewhere. In some ways, Tiny Rewards is their album about life on the road – the touring schedule that would see them playing venues in America, ones as far removed from old haunts in Glasgow and down south in London as it was possible to get; playing to tiny crowds and trying to win over entirely new audiences. It was that tour that changed everything for them – when they next got together to brainstorm ideas for LP3, it was as a quintet, working together, rather than under Abbott’s guidance, as had been their previous modus operandi. The seeds of Tiny Rewards were eventually sown through a collection of instrumental demos, to which Abbott then added lyrics. This time around, he’s not just concerned with the touring life: topics featured here include base instinct and acting on impulse (‘Easy as Breathing’); the thrills and terrors of being a new parent (lead single ‘Evangeline’); the life of the musician as creator (a whole quartet of them); and the feeling that the current generation have royally fucked things up for those to come (‘Good Luck’). \r\n\r\nThese ideas are fleshed out via the most colourful instrumental line-up yet employed on an Admiral Fallow album, the staples of their sound augmented by synths. the woodwind instruments warped into new shapes (‘Happened in the Fall’, piano lines looped and married to ever-changing chords (‘Holding the Strings’); influences ranging from the National’s more grandiose material, through earlier Sufjan Stevens (nothing as sparse as Carrie And Lowell here), to the heyday of classic disco. No, really: as incongruous as that sounds, there’s something propulsive about the coda of ‘Building As Foreign’, rhythmic Seventies pomp filtered through an undeniably modern sound before everything dissolves into noise. The ebb and flow of the record deserves particular commendation: the band agonised over its track listing, and it shows. There are many different sides to their 2015 incarnation, and no song on Tiny Rewards is overshadowed by its counterparts, nor given anything less than the band’s full dedication. Front to back, this is their strongest record to date, and though its title may suggest gruelling work for little gain (it’s actually lifted from ‘Liquor and Milk’), the rewards it yields are colossal. The Admiral Fallow you thought you knew is dead, yet their return heralds a glorious rebirth. \r\n\r\nTracklist: \r\n01 - Easy as Breathing.flac \r\n02 - Evangeline.flac \r\n03 - Happened in the Fall.flac \r\n04 - Good Luck.flac \r\n05 - Holding the Strings.flac \r\n06 - Sunday.flac \r\n07 - Building as Foreign.flac \r\n08 - Salt.flac \r\n09 - Some Kind of Life.flac \r\n10 - Liquor and Milk.flac \r\n11 - Carousel.flac \r\n12 - Seeds.flac \r\n\r\n\r\nSummary: \r\nCountry: Scotland \r\nGenre: Indie-Folk \r\n\r\n\r\nMedia Report: \r\nSource : CD \r\nFormat : FLAC \r\nFormat/Info : Free Lossless Audio Codec, 16-bit PCM \r\nBit rate mode : Variable \r\nBit rate : ~768-928 Kbps \r\nChannel(s) : 2 channels \r\nSampling rate : 44.1 KHz \r\nBit depth : 16 bits","torrent":{"xt":"urn:btih:4baa183be38278270cf295ca5f2910cbcadfbcd0","amp;dn":"%282015%29+Admiral+Fallow+-+Tiny+Rewards+%5BFLAC%2CTracks%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4baa183be38278270cf295ca5f2910cbcadfbcd0","infoHashBuffer":{"type":"Buffer","data":[75,170,24,59,227,130,120,39,12,242,149,202,95,41,16,203,202,223,188,208]},"announce":[],"urlList":[]}}