{"title":"Bob Weir - 2012-09-10 - Tower Theatre in Upper Darby, PA  SBD","uid":7803478,"size":761318360,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4baf70b7b0f5925dfc9a70a820b7ae0dafb2b834&amp;dn=Bob+Weir+-+2012-09-10+-+Tower+Theatre+in+Upper+Darby%2C+PA++SBD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DOOLY-WZMB","files":22,"time":1352341879,"description":"BOB WEIR - Acoustic\n\n2012-09-10\nTower Theatre\nUpper Darby, PA\n \nSoundboard:  SBD &gt; CDR &gt; EAC &gt; FLAC8\n\n01. Music Never Stopped &gt;\n02. Shaky Ground &gt;\n03. Music Never Stopped &gt;\n04. New Minglewood Blues\n05. My Brother Esau\n06. Loose Lucy\n07. When I Paint My Masterpiece\n08. Artificial Flowers\n09. Weather Report Suite\n10. Ashes and Glass &gt;\n11. Big Bad Blues\n12. Easy To Slip\n13. Peggy-O\n14. Hell In a Bucket\n15. Dear Prudence\n16. Sugar Magnolia\n\nEncore\n17. Brokedown Palace\n\nReview by &quot;Junior Boarder&quot; :\n\nReally enjoyed this. First time for me at a Bob solo show. Had 11th row DFC, so it was like having the man playing in my living room. Firstly, I have to give credit for going out there by himself with just an acoustic \nguitar. Also have to say his voice sounded amazing...really fine. Great crowd, not a lot of chatter, lots of friendly faces. Missed the FFF hangout in the lot, but spotted WLewis in the lobby and gave him the BertSignal, \nbut he had no idea who I was. That was kind of funny. I cruised the beautiful back roads of chester and delaware county from the job in malvern down to the mean streets of upper darby and was pleasantly surprised to find people hanging in the garage pre-show...cracked some coldies and chowed down and met some new friends and rolled into the theatre about 7:45. Very mellow scene. I liked the tie-dye tour shirt, but just could not pull the trigger at $30.\n\nI could see how this would not be for everyone...a little something for the faithful. If you think you might like to watch Bob Weir tool around on the acoustic for a few hours (then there might be something profoundly wrong with you), then by golly this is the show for you. He puts it all out there, warts and everything, and you get rewarded with brilliance, soul, warmth, and a really interesting interpretation of the catalogue. Highlights for me were Music Never Stopped-&gt;MInglewood, WRS, BBB, Peggy-O and Sugar Mags. Would definitely catch this again. Hopefully in a somewhat smaller place. I like the Tower, but it was just a bit cavernous for this show. This would have been better suited to the TLA, Keswick, Colonial in Phoenixville or Reading PAC. ","torrent":{"xt":"urn:btih:4baf70b7b0f5925dfc9a70a820b7ae0dafb2b834","amp;dn":"Bob+Weir+-+2012-09-10+-+Tower+Theatre+in+Upper+Darby%2C+PA++SBD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4baf70b7b0f5925dfc9a70a820b7ae0dafb2b834","infoHashBuffer":{"type":"Buffer","data":[75,175,112,183,176,245,146,93,252,154,112,168,32,183,174,13,175,178,184,52]},"announce":[],"urlList":[]}}