{"title":"Teorex.FolderIco.v.1.0.Keygen.BBB.rar","uid":6458704,"size":2853530,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4ce21b555f991639c504c30d98333b9e16b48334&amp;dn=Teorex.FolderIco.v.1.0.Keygen.BBB.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1307677577,"description":"Teorex FolderIco 1.0\n\nDon't you know how to change standard yellow folder to a colourful and bright? FolderIco is a unique application designed to enhance the color to Windows folders. With just a one click, colorize your folders, and discover a new intuitive way to classify your files. A quick look is now enough to identify the folder you are looking for! You can now classify your folders by Priority. Red is an Important folder, Orange is Urgent, Green is Familial. Choose the attributions that you like, so you'll never delete an important folder by error. FolderIco is a very light soft, that doesn't stay in memory. It uses a native functionality of Windows to be more efficient. Discover it's simplicity: with a single right-click on a folder you change it icon! FolderIco is integrated into your Windows Explorer! One right-click on any folder and FolderIco is ready to changing your folder's icon\n\nHere are some key features of &quot;FolderIco&quot;:\n\nOrganise your folders more easily:\nÃ‚Â· Don't you know how to change standard yellow folder to a colourful and bright? With FolderIco, give some color to Windows folders. With just a one click, colorize your folders, and discover a new intuitive way to classify your files. A quick look is now enough to identify the folder you are looking for!\n\nClassify your folders by Priority:\nÃ‚Â· You can now classify your folders by Priority. Red is an Important folder, Orange is Urgent, Green is Familial... Choose the attributions that you like, so you'll never delete an important folder by error.\n\nA fast and light tool:\nÃ‚Â· FolderIco is a very light soft, that doesn't stay in memory. It uses a native functionality of Windows to be more efficient. Discover it's simplicity: with a single right-click on a folder you change it icon!\n\nIntegration with Windows Explorer:\nÃ‚Â· FolderIco is integrated into your Windows Explorer! One right-click on any folder and FolderIco is ready to changing your folder's icon.\n\nHome Page - http://www.theinpaint.com/\n\n","torrent":{"xt":"urn:btih:4ce21b555f991639c504c30d98333b9e16b48334","amp;dn":"Teorex.FolderIco.v.1.0.Keygen.BBB.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ce21b555f991639c504c30d98333b9e16b48334","infoHashBuffer":{"type":"Buffer","data":[76,226,27,85,95,153,22,57,197,4,195,13,152,51,59,158,22,180,131,52]},"announce":[],"urlList":[]}}