{"title":"The Age of Absurdity - Foley epub","uid":6816850,"size":267680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d0f92de9df83769ff5d087135117d2ec572bf73&amp;dn=The+Age+of+Absurdity+-+Foley+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jakcreed2","files":1,"time":1321247428,"description":"The Age of Absurdity: Why Modern Life Makes it Hard to Be Happy \n\nThe good news is that the great thinkers from history have proposed the same strategies for happiness and fulfilment. The bad news is that these turn out to be the very things most discouraged by contemporary culture. This knotty dilemma is the subject of The Age of Absurdity - a wry and accessible investigation into how the desirable states of wellbeing and satisfaction are constantly undermined by modern life. Michael Foley examines the elusive condition of happiness common to philosophy, spiritual teachings and contemporary psychology, then shows how these are becoming increasingly difficult to apply in a world of high expectations. The common challenges of earning a living, maintaining a relationship and ageing are becoming battlegrounds of existential angst and self-loathing in a culture that demands conspicuous consumption, high-octane partnerships and perpetual youth. In conclusion, rather than denouncing and rejecting the age, Foley presents an entertaining strategy of not just accepting but embracing today's world - finding happiness in its absurdity. \nEnjoy and seed","torrent":{"xt":"urn:btih:4d0f92de9df83769ff5d087135117d2ec572bf73","amp;dn":"The+Age+of+Absurdity+-+Foley+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d0f92de9df83769ff5d087135117d2ec572bf73","infoHashBuffer":{"type":"Buffer","data":[77,15,146,222,157,248,55,105,255,93,8,113,53,17,125,46,197,114,191,115]},"announce":[],"urlList":[]}}