{"title":"Working Stiff - Judy Melinek &amp; T.J. Mitchell","uid":11684692,"size":1519055,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d6ea4afca07977e8ba2666b296adccd36375bfd&amp;dn=Working+Stiff+-+Judy+Melinek+%26amp%3B+T.J.+Mitchell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1423270875,"description":"'Far from the magic we see on TV, Working Stiff describes forensic pathology in the real world. The book is a compelling and absorbing read.' Kathy Reichs, New York Times bestselling author'engrossing . . . pulls back the sheet to show readers just what goes on after someone dies . . . Armchair detectives and would-be forensic pathologists will find Melinek's well- written account to be inspiring and engaging.' Publishers WeeklyDr Judy Melinek has made a career out of working with dead bodies. As a forensic pathologist, she has probed and prodded corpses for clues that may reveal murder, suicide, a medical accident or a rare genetic WC disease This fearless memoir tells the gripping story of the young doctor's 'rookie season' as a forensic pathologist, and the cases-hair-raising and heartbreaking and impossibly complex- that shaped her as both a physician and a mother.Just two months before the September 11 terrorist attacks, Dr Melinek began her training as a New York City forensic pathologist. With her husband T.J. and their toddler Daniel holding down the home front, Judy threw herself into the fascinating world of death investigation-performing autopsies, investigating death scenes, and counselling grieving relatives.Lively, action-packed, and loaded with mordant wit, Working Stiff offers a firsthand account of daily life in one of the modern world's most arduous professions, and the unexpected challenges of shuttling between the domains of the living and the dead. Dr Melinek lays bare the truth behind the glamorised depictions of autopsy work on shows like CSI and Law &amp; Order to reveal the secret story of the real morgue and what really goes on behind the police tape.'Melinek's enthusiasm for her calling is always apparent, and her writing is unselfconsciously bouncy, absorbed and mordant (though not caustic) . . . A transfixing account of death, from the mundane to the oddly hair-raising.' Kirkus Reviews'Working Stiff is the grossest book you'll ever love. But it is also so much more than that: Seamlessly fusing memoir, science journalism, riveting whodunit mysteries, and light humour about a dark topic . . . a relentlessly fascinating and informative book from the first page to the last.' Scott Stossel, author of the New York Times Bestseller My Age of Anxiety","torrent":{"xt":"urn:btih:4d6ea4afca07977e8ba2666b296adccd36375bfd","amp;dn":"Working+Stiff+-+Judy+Melinek+%26amp%3B+T.J.+Mitchell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d6ea4afca07977e8ba2666b296adccd36375bfd","infoHashBuffer":{"type":"Buffer","data":[77,110,164,175,202,7,151,126,139,162,102,107,41,106,220,205,54,55,91,253]},"announce":[],"urlList":[]}}