{"title":"The Tender Bar","uid":12475477,"size":197901525,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4f97db0c46ba1e797bf9880597b8a8811a781322&amp;dn=The+Tender+Bar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"freddygotfingered","files":1,"time":1442973486,"description":"\n&quot;Long before it legally served me, the bar saved me,&quot; asserts J.R. Moehringer, and his compelling memoir The Tender Bar is the story of how and why. A Pulitzer-Prize winning writer for the Los Angeles Times, Moehringer grew up fatherless in pub-heavy Manhasset, New York, in a ramshackle house crammed with cousins and ruled by an eccentric, unkind grandfather. Desperate for a paternal figure, he turns first to his father, a DJ whom he can only access via the radio (Moehringer calls him The Voice and pictures him as &quot;talking smoke&quot;). When The Voice suddenly disappears from the airwaves, Moehringer turns to his hairless Uncle Charlie, and subsequently, Uncle Charlie's place of employment--a bar called Dickens that soon takes center stage. While Moehringer may occasionally resort to an overwrought metaphor (the footsteps of his family sound like &quot;storm troopers on stilts&quot;), his writing moves at a quick clip and his tale of a dysfunctional but tightly knit community is warmly told. &quot;While I fear that we're drawn to what abandons us, and to what seems most likely to abandon us, in the end I believe we're defined by what embraces us,&quot; Moehringer says, and his story makes us believe it. --Brangien Davis --This text refers to the Paperback edition","torrent":{"xt":"urn:btih:4f97db0c46ba1e797bf9880597b8a8811a781322","amp;dn":"The+Tender+Bar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f97db0c46ba1e797bf9880597b8a8811a781322","infoHashBuffer":{"type":"Buffer","data":[79,151,219,12,70,186,30,121,123,249,136,5,151,184,168,129,26,120,19,34]},"announce":[],"urlList":[]}}