{"title":"Why I Became an Atheist (Revised and Expanded) - John W. Loftus","uid":14107736,"size":1162322779,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:50003077ae9fa26a003e8e958fdb065f1efd6fc1&amp;dn=Why+I+Became+an+Atheist+%28Revised+and+Expanded%29+-+John+W.+Loftus&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twp6045","files":3,"time":1459371185,"description":"For about two decades John W. Loftus was a devout evangelical Christian, an ordained minister of the Church of Christ, and an ardent apologist for Christianity. With three degrees--in philosophy, theology, and philosophy of religion--he was adept at using rational argumentation to defend the faith. But over the years, doubts about the credibility of key Christian tenets began to creep into his thinking. By the late 1990s he experienced a full-blown crisis of faith.\r\n\r\nIn this honest appraisal of his journey from believer to atheist, the author carefully explains the experiences and the reasoning process that led him to reject religious belief. The original edition of this book was published in 2006 and reissued in 2008. Since that time, Loftus has received a good deal of critical feedback from Christians and skeptics alike. In this revised and expanded edition, the author addresses criticisms of the original, adds new argumentation and references, and refines his presentation. For every issue he succinctly summarizes the various points of view and provides references for further reading. In conclusion, he describes the implications of life without belief in God, some liberating, some sobering.\r\n\r\nThis frank critique of Christian belief from a former insider will interest freethinkers as well as anyone with doubts about the claims of religion.\r\n\r\nJohn W. Loftus (Angola, IN) earned MA and MDiv degrees in theology and philosophy from Lincoln Christian Seminary under the guidance of Dr. James D. Strauss. He then attended Trinity Evangelical Divinity School, where he studied under Dr. William Lane Craig and received a ThM degree in philosophy of religion. Before leaving the church, he had ministries in Michigan, Illinois, and Indiana, and he taught at several Christian colleges. He is also the editor of The Christian Delusion: Why Faith Fails and The End of Christianity. In addition, he has an online blog at","torrent":{"xt":"urn:btih:50003077ae9fa26a003e8e958fdb065f1efd6fc1","amp;dn":"Why+I+Became+an+Atheist+%28Revised+and+Expanded%29+-+John+W.+Loftus","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50003077ae9fa26a003e8e958fdb065f1efd6fc1","infoHashBuffer":{"type":"Buffer","data":[80,0,48,119,174,159,162,106,0,62,142,149,143,219,6,95,30,253,111,193]},"announce":[],"urlList":[]}}