{"title":"John Coltrane - Live At The Village Vanguard Again! (1966","uid":14393941,"size":474772815,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:502697f0e53e2c3ea992e73881581371fa38a1b0&amp;dn=John+Coltrane+-+Live+At+The+Village+Vanguard+Again%21+%281966&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pucholoco","files":12,"time":1461328521,"description":"John Coltrane - Live At The Village Vanguard Again! (1966)\r\n             EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 294 Mb \r\n                     Full Artwork @ 600 dpi (tiff) -&gt; 84 Mb\r\n\r\n\r\nThis album was always a bit of a disappointment. John Coltrane plays passionately on &quot;My Favorite Things&quot; and with great beauty on &quot;Naima,&quot; but Pharoah Sanders' ferocious screeching on the latter piece largely ruins the almost-sacred ballad. Pianist Alice Coltrane, bassist Jimmy Garrison, and drummer Rashied Ali mostly vamp behind the saxophonists. This album is worth getting for Coltrane's passionate but coherent playing, but one wishes that Sanders (who comes across as a much more limited player) had sat the night out.\r\n\r\nJohn Coltrane returns to the Village Vanguard – but his sound here is a lot more far-reaching than a few years before! The album's a great counterpart to the first Vanguard session – as it takes all of the bold, soaring energy of that date, and balances it with the newly introspective sound of the later Coltrane years – plus some of the freedoms learned from the Love Supreme era. The group here showcases the new territory explored by Coltrane – with Trane himself on tenor, soprano, and a bit of bass clarinet (echoing earlier Dolphy), plus Pharoah Sanders on additional tenor, Alice Coltrane on piano, Jimmy Garrison on bass, and Rasheid Ali on drums. The album only features 2 long tracks – an incredibly soulful version of &quot;Naima&quot;, and a very firey version of &quot;My Favorite Things&quot;, but one that begins with a haunting bass solo by Garrison!\r\n\r\nLive at the Village Vanguard, was one of John Coltrane's most successful and controversial albums. It was one of the first by the &quot;classic quartet,&quot; and contained a boffo guest appearance by Eric Dolphy on the magnificent &quot;Spiritual.&quot;\r\n\r\nThis isn't it. Five years after that triumph, Coltrane returned to the Vanguard with his New Thing quintet, expanded to a sextet for the occasion: Coltrane on soprano, tenor, and bass clarinet; Pharoah Sanders on tenor and flute; Alice Coltrane on piano, Jimmy Garrison on bass, Rashied Ali on drums, and Emanuel Rahim on percussion. This album contains only two songs: &quot;Naima&quot; and &quot;My Favorite Things,&quot; which were perhaps the two most celebrated numbers, or overplayed chestnuts, of the Coltrane catalogue. Here they are given a treatment like no other.\r\n\r\nThis CD is worth the price for the breathtaking &quot;Naima.&quot; &quot;My Favorite Things&quot; has its moments, too. People talk of &quot;late Coltrane&quot; as if all of his music after A Love Supreme sounded the same, but actually the music on this disc is much removed from the likes of Ascension, Om, or Live in Seattle. One might call this version of &quot;Naima&quot; The Gentle Side of Late Coltrane. Not for all tastes, perhaps, but essential for the musically adventurous.\r\n\r\n---------------------------------------------------------------------------------\r\nTracklist:\r\n---------------------------------------------------------------------------------\r\n\r\n01 - Naima\r\n02 - Introduction To My Favorite Things\r\n03 - My Favorite Things\r\n\r\n*2011 Impulse! / Verve / UMG | B0015827-2\r\n\r\n\r\nPersonnel:\r\nJohn Coltrane – soprano saxophone, tenor saxophone, bass clarinet\r\nPharoah Sanders – tenor saxophone, flute\r\nAlice Coltrane – piano\r\nJimmy Garrison – bass\r\nRashied Ali – drums\r\nEmanuel Rahim – percussion\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!\r\n\r\n\r\n\r\nJohn Coltrane - Live At The Village Vanguard (1961) [EAC-FLAC]:\r\n \nhttps://thepiratebay.se/torrent/10817597/John_Coltrane_-__Live_At_The_Village_Vanguard_%281961%29_[EAC-FLAC]\r\n\r\n\r\nJohn Coltrane Quartet - Crescent (1964) [EAC-FLAC]:\r\n     \nhttps://thepiratebay.se/torrent/13526772/John_Coltrane_Quartet_-_Crescent_%281964%29_%5BEAC-FLAC%5D\r\n\r\n\r\nJohn Coltrane - Expression (1967) [EAC-FLAC]:\r\n \nhttps://thepiratebay.se/torrent/14347725/John_Coltrane_-_Expression_%281967%29_[EAC-FLAC]","torrent":{"xt":"urn:btih:502697f0e53e2c3ea992e73881581371fa38a1b0","amp;dn":"John+Coltrane+-+Live+At+The+Village+Vanguard+Again%21+%281966","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"502697f0e53e2c3ea992e73881581371fa38a1b0","infoHashBuffer":{"type":"Buffer","data":[80,38,151,240,229,62,44,62,169,146,231,56,129,88,19,113,250,56,161,176]},"announce":[],"urlList":[]}}