{"title":"Tori Amos - The Original Bootlegs (2005)  - The Complete 6 Conce","uid":4058448,"size":1258435034,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:50914559345044a1dbde98ce4545c8a3d20365fb&amp;dn=Tori+Amos+-+The+Original+Bootlegs+%282005%29++-+The+Complete+6+Conce&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"latentlunacyie","files":1,"time":1204484888,"description":"\n\n\nThe Original Bootlegs was a compilation of Tori Amos concert recordings from her Original Sinsuality tour. 6 shows were recorded.\n\n\nAuditorium Theatre Chicago, IL 4/15/05\n\nThe first in a series of official bootlegs of Tori Amos concerts. Each official bootleg is a double-disc package recorded during her &quot;Original Sinsuality&quot; and &quot;Summer of Sin&quot; tours brimming with live rarities, fan favorites and stunning cover versions.\n\nThe first album features songs captured during Amos&amp;#039; April 15th, 2005 concert at the Auditorium Theatre in Chicago. Among the set&amp;#039;s many highlights are live, soul-baring renditions of 1992&amp;#039;s &quot;Mother&quot;, the title track of new album, &quot;The Beekeeper&quot;, and 1996&amp;#039;s &quot;Father Lucifer,&quot; as well as poignant covers of Jim Croce&amp;#039;s 1971 hit &quot;Operator&quot; and Joni Mitchell&amp;#039;s &quot;Circle Game&quot;.\n\n\nRoyce Hall Auditorium Los Angeles, CA 4/25/05\n\nThe second in a series of official bootlegs released by Tori Amos. Each official bootleg is a double-disc package recorded during her &quot;Original Sinsuality&quot; and &quot;Summer of Sin&quot; tours brimming with live rarities, fan favorites and stunning cover versions.\n\nThe second album, recorded April 25th, 2005 at Royce Hall Auditorium on the campus of the University of California, Los Angeles, features intimate versions of 1994&amp;#039;s &quot;Cloud On My Tongue&quot; and &quot;Yes, Anastasia,&quot; as well as covers of Bon Jovi&amp;#039;s 1986 No. 1 hit &quot;Livin&amp;#039; On A Prayer&quot; and Jules Shear&amp;#039;s &quot;All Through The Night&quot;.\n\n\nParamount Theatre Denver, CO 4/19/05\n\nParamount Theatre Denver, CO 4/19/05 is the third in a series of official bootlegs released by Tori Amos. Each official bootleg is a double-disc package recorded during her &quot;Original Sinsuality&quot; and &quot;Summer of Sin&quot; tours brimming with live rarities, fan favorites and stunning cover versions.\n\nThe album was recorded at Tori&amp;#039;s Denver, CO Paramount Theater performance on April 19. The show contains a treasure trove of hits spanning Tori&amp;#039;s entire career, from Little Earthquakes&amp;#039; &quot;Leather&quot; to Boys For Pele&amp;#039;s &quot;Putting the Damage On&quot; to The Beekeeper&amp;#039;s &quot;Power of Orange Knickers.&quot; Covers include A Flock of Seagulls&amp;#039; &quot;I Ran&quot; and Leonard Cohen&amp;#039;s &quot;Suzanne&quot;.\n\n\nManchester Apollo Manchester, UK 6/5/05\n\nThe fourth in a series of official bootlegs released by Tori Amos. Each official bootleg is a double-disc package recorded during her &quot;Original Sinsuality&quot; and &quot;Summer of Sin&quot; tours brimming with live rarities, fan favorites and stunning cover versions.\n\nThe fourth album in the bootleg series is the first from the European leg of the Original Sinsuality tour. Recorded at the Apollo during the Manchester, England show on June 6 this album includes heartbreakers like &quot;Winter&quot; and &quot;Horses&quot; but also highlights Tori&amp;#039;s sense of humor as she has fun with covers like &quot;Don&amp;#039;t Look Back in Anger&quot; from Manchester natives Oasis and &quot;My Favorite Things&quot; by Rodgers and Hammerstein.\n\n\nHammersmith Apollo London, UK 6/04/05\n\nThe fifth in a series of official bootlegs released by Tori Amos. Each official bootleg is a double-disc package recorded during her &quot;Original Sinsuality&quot; and &quot;Summer of Sin&quot; tours brimming with live rarities, fan favorites and cover versions.\n\nThe fifth album in the bootleg series was recorded June 4 during Tori&amp;#039;s second night in London at the Hammersmith Apollo and is a rare treat for her fans. Joining her on stage that night was special guests, The Gospel Singers, whose notable contributions are featured on the evening&amp;#039;s performances of Beekeeper favorites &quot;Mother Revolution,&quot; &quot;Sweet the Sting,&quot; &quot;Witness&quot; and &quot;Hoochie Woman.&quot; Covers included George Michael&amp;#039;s &quot;Father Figure&quot; and a cover version of Madonna&amp;#039;s &quot;Like a Prayer&quot;.\n\n\nBank of America Pavilion Boston, MA 8/21/05\n\nThe sixth in a series of &amp;#039;official bootlegs&amp;#039; released by Tori Amos. Each official bootleg is a double-disc package recorded during her &quot;Original Sinsuality&quot; and &quot;Summer of Sin&quot; tours brimming with live rarities, fan favorites and cover versions.\n\nThe sixth and final album in the live bootleg series was recorded at B of A Pavilion in Boston on August 21 during Tori&amp;#039;s Summer of Sin tour. An inspired outdoor summer performance, the Boston show included old favorites &quot;Cool on Your Island&quot; and &quot;Tear in Your Hand&quot; as well as welcome newcomers &quot;Barons of Suburbia&quot; and &quot;Garlands.&quot; Covers included &quot;Total Eclipse of the Heart,&quot; originally sung by Bonnie Tyler, &quot;Angie&quot; by The Rolling Stones and &quot;Dream On&quot; by Boston locals, Aerosmith.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Original_Bootlegs&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Original_Bootlegs&lt;/a&gt;\n\n\n\nPlease help to seed so everyone has a chance to hear these great shows!","torrent":{"xt":"urn:btih:50914559345044a1dbde98ce4545c8a3d20365fb","amp;dn":"Tori+Amos+-+The+Original+Bootlegs+%282005%29++-+The+Complete+6+Conce","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50914559345044a1dbde98ce4545c8a3d20365fb","infoHashBuffer":{"type":"Buffer","data":[80,145,69,89,52,80,68,161,219,222,152,206,69,69,200,163,210,3,101,251]},"announce":[],"urlList":[]}}