{"title":"The New Cosmic Onion - Quarks and the Nature of the Universe","uid":6351192,"size":2558203,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5125b06249e2d6f4d724af89884ce9cf5d05ef85&amp;dn=The+New+Cosmic+Onion+-+Quarks+and+the+Nature+of+the+Universe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lionzbay","files":1,"time":1304005150,"description":"\nAuthor(s): Frank Close\nPublisher: Taylor &amp; Francis; Rev Ed edition\nDate: 2006\nFormat: PDF\nLanguage: English\nISBN10: 1584887982\nPages: 232\nOCR: Yes\n\nNot since Newtons apple has there been a physics phenomenon as deliciously appealing to the masses as Frank Closes Cosmic Onion. Widely embraced by scientists and laypersons alike, the book quickly became an international bestseller, has been translated into seven languages, and propelled the author to become a recognized popular science celebrity around the world. Much has changed since the original publication in 1983, and The New Cosmic Onion was extensively revised and updated to reflect our new view of the universe. Keeping the best contents from the previous work, this new edition includes extensive new material explaining the scientific challenges at the start of this century.\n\nReview\nThe theory of elementary particles is not an easy subject, and this is not an easy book, but it is correspondingly rewarding to readers who work their way through it. Using diagrams, analogies, and simplified versions of complicated mathematics, the author largely follows the historical order of discovery. ... The final chapter, Cosmology, Particle Physics, and the Big Bang, celebrates the last centurys astonishing project of explaining the largest scale of nature in terms of the smallest one known. Widely accepted information is explained in terms of widely accepted concepts, and the reader is assured that it comes with no strings attached. Summing Up: Highly recommended.\nD. Park, emeritus, Williams College, CHOICE July, 20077\nNew accelerators are being built that will show how the seeds of matter were created when our universe was less than a billionth of a second old. The discoveries in this century promise to be no less revolutionarythan in the last.  The New Cosmic Onion will provide the explanations that students, opinion formers and intelligent citizens need if they are to understand how science has come to this frontier, and where we think it is headed in the immediate future.","torrent":{"xt":"urn:btih:5125b06249e2d6f4d724af89884ce9cf5d05ef85","amp;dn":"The+New+Cosmic+Onion+-+Quarks+and+the+Nature+of+the+Universe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5125b06249e2d6f4d724af89884ce9cf5d05ef85","infoHashBuffer":{"type":"Buffer","data":[81,37,176,98,73,226,214,244,215,36,175,137,136,76,233,207,93,5,239,133]},"announce":[],"urlList":[]}}