{"title":"Catalyst Catalogue Builder","uid":4324436,"size":8585738,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:515760812fda50ed68777b5706a5858f724323a8&amp;dn=Catalyst+Catalogue+Builder&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jodyanne","files":2,"time":1217685172,"description":"Catalyst Catalog Builder 5.3 description\nCatalyst Catalog Builder creates, distributes and updates desktop catalogs that sell more. Showcase your products including quality product images, detailed descriptions, up to date customer specific\n\nCatalyst Catalog Builder creates, distributes and updates desktop catalogs that sell more. Showcase your products including quality product images, detailed descriptions, up to date customer specific pricing and one click email and fax ordering. So simple you will build and update your catalogs in minutes, without programming knowledge or expensive outside expertise. Try before you buy download provides risk free evaluation.\n\nFeatures include\n- Quick ordering via familiar Excel type price list grid\n- Resizable catalog window displaying product pictures and unlimited descriptions\n- One click email and fax ordering. Never have orders with missing details or illegible handwriting\n- Simple, user-friendly navigation (arrow keys, drop down boxes, click and go hyperlinks etc)\n- Logical product structure (groups, sub groups, etc) provides for efficient catalog navigation\n- Powerful search tool instantly locates the right product\n- Default customer and delivery details expediting orders and eliminating errors\n- Running line, tax and order totals\n- Fast 24 x 7 access to products and ordering without requiring an online connection\n- Information at customer fingertips (no bulky printed catalogues that go missing or quickly date)\n- In minutes add new products, delete obsolete items or amend current pricing\n- Drive sales with regular updates and pricing promotions\n- Ensure your information is secure (files encrypted, password protection, expiry dates etc)\n- Reinforce your corporate branding with customizable welcome page and banner ","torrent":{"xt":"urn:btih:515760812fda50ed68777b5706a5858f724323a8","amp;dn":"Catalyst+Catalogue+Builder","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"515760812fda50ed68777b5706a5858f724323a8","infoHashBuffer":{"type":"Buffer","data":[81,87,96,129,47,218,80,237,104,119,123,87,6,165,133,143,114,67,35,168]},"announce":[],"urlList":[]}}