{"title":"Alien - Complete Soundtrack - Intrada 2007 - 2cd 320kb mp3","uid":15964753,"size":306018500,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5177bb3280715f68c2dfdf20173700cf964d1a15&amp;dn=Alien+-+Complete+Soundtrack+-+Intrada+2007+-+2cd+320kb+mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OddioVizyule","files":48,"time":1475716314,"description":"Alien - Complete Soundtrack - Intrada 2007 - 2cd 320kb mp3\r\n\r\nComposed by Jerry Goldsmith\r\n\r\nNational Philharmonic Orchestra with Lionel Newman conducting\r\n\r\nNearly thirty years after the film's release in 1979, Intrada presents the complete original score as Goldsmith intended, rounded out with all the alternates and rewrites, providing everything Goldsmith recorded for ALIEN.\r\n\r\nFor this monster film set in deep space Goldsmith composed one of his most complex scores, relying on acoustic instruments to deliver the chilling, otherworldly atmosphere of the alien ship and its monstrous occupants. It was akin to his approach to PLANET OF THE APES, where Goldsmith eschewed electronics in favor of unique acoustic instruments to illustrate the foreboding landscape and upside down society. To achieve this effect in ALIEN, Goldsmith augmented the National Philharmonic Orchestra with didjeridu, serpent, and conch shell, with additional eerie effects courtesy of the echoplex, a process Goldsmith deployed previously to great effect in his score to PATTON. The result -- a masterful sci-fi/horror score that would influence genre movie scores for years to come.\r\n\r\nWe could think of this collection as &quot;Alien: The Composer's Cut&quot; since the music was not originally used or heard as intended. The score was substantially cut for the film's released versions, and some recordings from other sources were added, notably portions of Goldsmith's original score for the 1962 film &quot;Freud&quot; (which were that film's Main Title, as well as the tracks Charcot's Show and Desperate Case), and the first movement (adagio) from Howard Hanson's 1930 &quot;Symphony No. 2, Romantic&quot; for the film's end credits. \r\n\r\nThis album was remastered from the 1&quot; multi-track original masters, bringing a new depth, detail, and crispness not heard in previous releases","torrent":{"xt":"urn:btih:5177bb3280715f68c2dfdf20173700cf964d1a15","amp;dn":"Alien+-+Complete+Soundtrack+-+Intrada+2007+-+2cd+320kb+mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5177bb3280715f68c2dfdf20173700cf964d1a15","infoHashBuffer":{"type":"Buffer","data":[81,119,187,50,128,113,95,104,194,223,223,32,23,55,0,207,150,77,26,21]},"announce":[],"urlList":[]}}