{"title":"Longhorn Reloaded","uid":3934291,"size":818247680,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:51861cc45a2ae46fdd1ab83a9a7b98bfcf0e3979&amp;dn=Longhorn+Reloaded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"leodime","files":1,"time":1197710334,"description":"This is what Microsoft left behind.\n\nAs you all know, in 2004, Windows (Codename Longhorn) was announced and the Alpha version was shown. But as the months went by and the build numbers climbed higher, it began to look nicer and nicer. Transparent windows, a sidebar, all kinds of cool stuff. But then Microsoft dropped the entire thing and started off from scratch. Building a new OS from the ground up instead of based off XP. They called it Vista and many were disappointed in the change. But then a group of people picked it up and finished what Microsoft started. They named it \\&quot;Longhorn Reloaded\\&quot; and from there, you can guess what happened. I looked LONG AND HARD for this torrent on the internet. And for an expert google-searcher like me, 5 hours of searching and reading is a long time. The serial? I don\\&amp;#039;t know where it is or where to find it. I\\&amp;#039;m already looking for it myself. But I guess if you want it that bad, then you\\&amp;#039;ll be able to do a few Google searches on it.\nSystem Requirements\n\n-512 megs of RAM\n\n-A video card about 16 megs or higher\n\n-A DVD burner (This file will NOT fit on a standard 700 MB disc because the file size is 780 MB.\n\n-About 7 gigs of disk space\n\n-Some Image Burning software\n\n-A somewhat fast CPU. Atleast in the Gigahertz range\n\n\nI don\\&amp;#039;t know how secure this is or what programs will run on it.\n\nIf you plan on replacing your existing OS with this one, go kill yourself.\n\nIf you\\&amp;#039;re upset \\&amp;#039;cause not alot of stuff runs on it then go kill yourself.\n\nIf you get lots of BSOD\\&amp;#039;s and blame me for it, then go kill yourself.\n\nIf your computer gets fucked up from this and you feel I\\&amp;#039;m responsible for it happening then I am not responsible and\nyou should GO KILL YOURSELF!!!\n\nIf you think this is a virus then go kill yourself.\n\nIf you speak another language that I don\\&amp;#039;t understand then GTFO. No german-norwegian shit.\n\nIf you work for Microsoft then go fuck yourself and then go kill yourself.\n\nIf you think this torrent is gonna get taken down or you think\nyou can convince The Pirate Bay to take it down then go kill yourself.\n\nIf you don\\&amp;#039;t like me telling people to go kill themselves then maybe you should go kill yourself.\n\nIf you don\\&amp;#039;t seed this then you should probably shoot yourself. In the face.\n\nThis OS was NEVER FINISHED. Microsoft didn\\&amp;#039;t finish it, and the programmers that were working on it never finished it either because Microsoft stopped them before it was over. So if something doesn\\&amp;#039;t work, it\\&amp;#039;s cause the ends were never tied up.\n\nI hear that Norton Anti Virus 2005 and Microsoft Office 2003 work fine with this OS but I\\&amp;#039;m not sure what else may or may not work. I guess you\\&amp;#039;ll have to find out. I also hear Halo 2 plays just fine on this but as I said before, this something i\\&amp;#039;ve HEARD and haven\\&amp;#039;t tried or seen.\n\nI have seen Windows Live Messenger work on this and it runs fine.\n\nMake sure you defrag your hard drive and then make a partition in advance before you install this otherwise it may wipe any unpartitioned OS you have on your PC (like XP) and you REALLY don\\&amp;#039;t want that.\n\nI don\\&amp;#039;t know if this has some kind of \\&quot;automatic update\\&quot; thing on it set to automatically download XP updates from the Microsoft site, but I\\&amp;#039;m guessing no.\n\nI don\\&amp;#039;t know if this has IE 7 in it already, but if it doesn\\&amp;#039;t then I don\\&amp;#039;t know if you could install it.\n\nTo make it run faster, disable Aero effects\n\nYou most likely will not get alot of usability out of this OS. It\\&amp;#039;s mainly for show and a free alternative to Vista. And as I said earlier, this OS was never finished and the finishing touches were never added.\n\nTHIS IS NOT WINDOWS VISTA AND IT IS NOT A VERY GOOD ALTERNATIVE EITHER!\n\nWhen I downloaded this, it had 5 seeders and it finished in about 5 hours. But the more people that seed, the quicker this will move. So do everyone a favor and leave it in your torrent client ok? Atleast for a few months! But if you REALLY like this OS then you should seed permenantly. I know I will.\n\nTHIS IS THE REAL THING! NO FAKES, NO IMPOSTORS, NO OTHER OS\\&amp;#039;!!!\n\nWell, I guess this is the end of it, so please seed and if you have any REASONABLE comments then please post them below. Thank you guys and SEED!","torrent":{"xt":"urn:btih:51861cc45a2ae46fdd1ab83a9a7b98bfcf0e3979","amp;dn":"Longhorn+Reloaded","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51861cc45a2ae46fdd1ab83a9a7b98bfcf0e3979","infoHashBuffer":{"type":"Buffer","data":[81,134,28,196,90,42,228,111,221,26,184,58,154,123,152,191,207,14,57,121]},"announce":[],"urlList":[]}}