{"title":"La Bruja de Portobello - Paulo Coelho [Ebook][Spanish]","uid":6914391,"size":9339732,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:525e3ac031b7b1c2e5e68f6dce82e746653f930e&amp;dn=La+Bruja+de+Portobello+-+Paulo+Coelho+%5BEbook%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1324974898,"description":"La bruja de Portobello, Paulo Coelho (DOC|PDF|RTF|EPUB|FB2|MOBI\n\nDOC|PDF|RTF|EPUB|FB2|MOBI\n\nSINOPSIS\n\nEl autor explora de nuevo el mundo femenino, profundiza en sus miedos, en la espiritualidad y en la necesidad de buscar sentido a la vida. Athena es una mujer con un don de la naturaleza. Hija adoptiva de una mujer libanesa y un prÃƒÂ³spero industrial de Beirut, se traslada a vivir a Londres con su familia poco despuÃƒÂ©s que estalle la guerra en su paÃƒÂ­s. En la universidad conoce al que se convertirÃƒÂ¡ en padre de su hijo pero las dificultades que atraviesa la joven hacen que el matrimonio pronto se rompa. Convertida en madre, no puede dejar de pensar en la mujer que la trajo al mundo y, para entender cÃƒÂ³mo pudo abandonarla, decide emprender un viaje a Rumania y buscar a su madre biolÃƒÂ³gica. Pero un viaje nunca te lleva sÃƒÂ³lo a dÃƒÂ³nde pensabas ir, y lo que Athena descubre en este viaje cambiarÃƒÂ¡ para siempre su vida y las vidas de los que la rodean. En La bruja de Portobello Paulo Coelho nos ofrece una trama fascinante y llena de intriga, a travÃƒÂ©s de la cual el lector acaba descubriendo una larga tradiciÃƒÂ³n basada en la fuerza femenina y en el amor. Una novela absolutamente imprescindible en el mundo de hoy.","torrent":{"xt":"urn:btih:525e3ac031b7b1c2e5e68f6dce82e746653f930e","amp;dn":"La+Bruja+de+Portobello+-+Paulo+Coelho+%5BEbook%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"525e3ac031b7b1c2e5e68f6dce82e746653f930e","infoHashBuffer":{"type":"Buffer","data":[82,94,58,192,49,183,177,194,229,230,143,109,206,130,231,70,101,63,147,14]},"announce":[],"urlList":[]}}