{"title":"Star-Crossed.S01E09.720p.HDTV.x264-2HD","uid":9966416,"size":875077376,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:526732183554ceb66acfb336075c2f859d418bec&amp;dn=Star-Crossed.S01E09.720p.HDTV.x264-2HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Thhaque","files":1,"time":1397576588,"description":"[b]Star-Crossed\n\n[IMG]http://i.imgur.com/KM6fmxA.jpg[/IMG]\n\nGenre: Sci-Fi, Drama\nYear: 2014\nCountry: USA\nRuntime: 42 min\nProducer: Meredith Averill\nCast: Chelsea Gilligan, Malese Jow, Ashlyn McEvers, Caden Montgomrey, Aimee Teegarden, Blakely Darsam, Starlette Miariaunii, Tearyn Belanger, Kevonte Mcdonald\n\n Release Name----- Star-Crossed.S01E09.720p.HDTV.x264-2HD\n Release Date----- 2014-04-14\n Release Size----- 835Mb\n Play Time-------- 00:41:18\n Resolution------- 1280x720\n Frame Rate------- 23.976\n Video Bitrate---- 2384kbps\n Video Codec------ x264\n Audio ----------- 48.0 KHz 6ch, 384kbps\n Audio Codec------ AC3\n\n.: Plot :.\nWhen Emery was 6 years old, an alien spacecraft crash-landed in her small town. Whether they came in peace or with more sinister intentions didn't matter: a fierce battle erupted as humans fought for control over their new rivals, an alien species called the Atrians. In the midst of the conflict, Roman, a 6-year-old Atrian boy, found his way to a shed behind Emery's house, where she protected him from harm, bringing him food, comfort - and friendship. In their brief time together, Emery and Roman forged a deep bond, but the authorities wasted no time tracking Roman down and capturing him in a violent confrontation. Emery has grown up believing that Roman was killed that day. Ten years later, the Atrians have been acclimated to life on Earth, but they are interned in a heavily-guarded camp known as the Sector to keep them separate from humans. Now, for the first time, a group of Atrian teens will enroll in a suburban human high school, with the goal of testing the feasibility of human/alien integration. The eyes of the nation and the whole world are fixed on this historical social experiment, an endeavor fraught with suspicion and fear. In the mayhem of the first day, Emery is amazed to learn that Roman was not killed by the authorities and is, in fact, one of the Atrian students. Their childhood bond is quickly rekindled - in a school and a society that distrusts everything about the Atrians, Emery and Roman have found each other again. However, their relationship is threatened by the small-mindedness of their respective communities and the political agendas of people in power. While the world around them rages with anger and prejudice, their bond becomes increasingly strong and increasingly dangerous. As an epic Romeo and Juliet romance unfolds, a violent encounter between Roman's father and Emery's father occurs in the Sector. Can Roman and Emery's love - and peace between the species - survive?[/b]","torrent":{"xt":"urn:btih:526732183554ceb66acfb336075c2f859d418bec","amp;dn":"Star-Crossed.S01E09.720p.HDTV.x264-2HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"526732183554ceb66acfb336075c2f859d418bec","infoHashBuffer":{"type":"Buffer","data":[82,103,50,24,53,84,206,182,106,207,179,54,7,92,47,133,157,65,139,236]},"announce":[],"urlList":[]}}