{"title":"Various Artists - Dubhead - Volume Three","uid":6047826,"size":416253758,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:530c6e7caa20576c70ed53656409173c9f4afe70&amp;dn=Various+Artists+-+Dubhead+-+Volume+Three&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LZforever1","files":24,"time":1292620428,"description":"Various Artists - Dubhead - Volume Three (Year around 1996)\n----------------------------------------\n\n01 - Iration Steppas Vs D. Rootical - Wicked Melt Away\n02 - Mad Professor And Jah Shaka - Slave Rebellion\n03 - The Disciples Meet The Rootsman - Rebirth\n04 - Roots Control - Inner Version\n05 - Blue And Red - Amid The Ether\n06 - East Meets West - Valve Dub\n07 - Alpha &amp; Omega - Ancient Of Days\n08 - Earthquake - Jah Fire\n09 - Hi Tech Roots Dynamics - Strange Stepper\n10 - Dub Ghecko - Asunder\n11 - Riz All Stars featuring Lucy V - Joyful Dub\n12 - The Truth - Strickley Roots\n13 - Armagideon Meets Stryka Dread - Travelling Dub\n14 - Twilight Circus - Lowell And Nine\n\nArtwork\n\nFlac level best (speed - 0,5)\n &lt;a href=&quot;\nhttp://www.strictly-vibes.com/va-dubhead-volume-3-vt2463.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.strictly-vibes.com/va-dubhead-volume-3-vt2463.html&lt;/a&gt;\n\n\nThis new revelation, the Third Chapter in the Book of Dubhead, bestows a further level of maturity upon those Singers and Players of what has recently become known as the New School of Dubism. But it is important to recognise and acknowledge the fact that Dub has neuer Bone away since the time of its creation, flowing from the mind and fingers of the Immortal King Tubby and the legendary Dubmasters who then followed upon his eternal path. In U.K studios the baton of drum and bass was carried from the late seventies through to the present day by the likes of Dennis Bovell, Jah Shaka and the Mad Professor. In the early eighties many critics concerned with matters of the moment Wrote to confirm that the Golden Age was over and reggae was deal. These men ploughed a lonely furrow, at best vilified and at worst ignored by the mainstream media. Now the fruits of their labour are being validated with timeless cloaks of space, depth, reverb and echo thrown over what seems a whole new generation of Dubheads. The abyss of dub has opened not only in the U.K., but also in dub's birthplace, Jamaica, where conscious tunes are back in the market place big style - whether roots or dancehall. And the dub vibration is rattling foundations in the U.S.A., Europe, South America, Africa, Japan - outernationally!\nThe scorn of elitists has now been dashed away. So solid is the new wave of dub that the commitment of its perpetrators can no longer be questioned. In turn the longer established Outfits like the Disciples, Alpha &amp; Omega, Aba Shanti, the Conscious Sounds crew et al haue spawned and encouraged fresh manifestations. There is a\nPremier Division of Dub! Advances in studio technology haue begun to eradicate the inherent coldness of digital sound. Now there's more technology in a bedroom than there was in the Black Ark! Any one of a hundred new dubmasters Gould compete for the soundtrack to William Gibson's &quot;Neuromancer&quot;. The warm sounds of brass are being re-introduced into the mix. Sometimes its dub for dubs sake, but songs and rhythms haue re-emerged - the origination of version. Dub plate culture continues. The music still retains its rebel base. New dub revives interest in the &quot;old&quot; dub. &quot;Old&quot; dub still feeds the new dub. Played back to back - the language of dub remains the saure.\n\nRespect must be due to the dub underground - D.J.'s like Dave Rodigan, Joey Jay and Mannaseh, the countless pirates and the brave few from regional I.L.R and B.B.C. (Radio One - the train has gone! - excepting Uncle John who was an board from the start and Andy Kershaw, welcomed some stops down the line), the Sound System Operators and selectors, the collectors, the writers and the many independent record labels. But most of all to the many artists who haue had enough faith in themselves to continue their work and see it through to self-managed release - the majority of whom haue contributed to the Dubhead series.\n\nSteve Barker - On the Wire\n\nN.B. Jah bless Jah Rip, Sister Ripella and the soon come Ripette\n","torrent":{"xt":"urn:btih:530c6e7caa20576c70ed53656409173c9f4afe70","amp;dn":"Various+Artists+-+Dubhead+-+Volume+Three","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"530c6e7caa20576c70ed53656409173c9f4afe70","infoHashBuffer":{"type":"Buffer","data":[83,12,110,124,170,32,87,108,112,237,83,101,100,9,23,60,159,74,254,112]},"announce":[],"urlList":[]}}