{"title":"Aloha Spirit a.k.a. Little Pink Booklet of Aloha (e-book, PDF)","uid":6400851,"size":240140,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5459866b61d99af7eaa65696274a2e4f50c0a7d6&amp;dn=Aloha+Spirit+a.k.a.+Little+Pink+Booklet+of+Aloha+%28e-book%2C+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"inst23","files":-1,"time":1305658214,"description":"The Aloha Spirit a.k.a. The Little Pink Booklet of Aloha\nby Serge King\n\nAloha International | PDF | 9 pages | English\n\n\n\nQuote from inside the book:\n\n&quot;The Aloha Spirit is a well known reference to the attitude of friendly acceptance for which the Hawaiian Islands are so famous. However, it also refers to a powerful way to resolve any problem, accomplish any goal, and to achieve any state of mind or body that you desire.\n\nIn the Hawaiian language, aloha stands for much more than just &quot;hello&quot; or &quot;goodbye&quot; or &quot;love.&quot; Its deeper meaning is &quot;the joyful (oha) sharing (alo) of life energy (ha) in the present (alo).&quot; \n\nAs you share this energy you become attuned to the Universal Power that the Hawaiians call mana. And the loving use of this incredible Power is the secret for attaining true health, happiness, prosperity and success. \n\nThe way to tune into this Power and have it work for you is so simple that you might be tempted to pass it off as being too easy to be true. Please don't let yourself be fooled by appearances. Take the time to try it out. \n\nThis is the most powerful technique in the world, and although it is extremely simple it may not prove easy, because you must remember to do it and you have to do it a lot. It is a secret which has been given to humanity over and over again, and here it is once more in another form.&quot;","torrent":{"xt":"urn:btih:5459866b61d99af7eaa65696274a2e4f50c0a7d6","amp;dn":"Aloha+Spirit+a.k.a.+Little+Pink+Booklet+of+Aloha+%28e-book%2C+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5459866b61d99af7eaa65696274a2e4f50c0a7d6","infoHashBuffer":{"type":"Buffer","data":[84,89,134,107,97,217,154,247,234,166,86,150,39,74,46,79,80,192,167,214]},"announce":[],"urlList":[]}}