{"title":"The Body Farm (2011) - 6 Episodes","uid":10283345,"size":3303997240,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:54acd7f563a62609b1c37cdc8f9331abd1a74401&amp;dn=The+Body+Farm+%282011%29+-+6+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"bnaron","files":-1,"time":1401742092,"description":"The Body Farm was a British television police procedural crime drama series for the BBC network, featuring a fictional private forensic pathology facility that conducts scientific research to help solve crimes, led by Dr. Eve Lockhart, played by Tara Fitzgerald.\n\nThe program is a spin-off from the cold case police procedural drama 'Waking the Dead', and was commissioned following the series' closure. The series features the work of Dr. Eve Lockhart, who originally appeared in 'Waking the Dead' from 2007 to 2011. An initial six-part run was announced in January 2011, and filming began in March 2011. A brief trailer was shown following the final episode of Waking the Dead. The program was filmed in rural MacClesfield and urban Manchester. The series began airing on 13 September 2011, with the first episode gaining a strong 6.3 million viewers. By the end of the series, ratings had dropped to 4.6 million. Episode three was filmed in the fishing village of Staithes, Cleveland. On 30 January 2012, the BBC confirmed that the show would not be returning for a second season.\n\n\n*****\n\nEpisode Guide\n\n\ns01e01 - No Peace for the Wicked\n\nHale calls upon Eve and her team when a disused council flat is found covered in human remains. Investigations soon uncover that the remains are of two local boys, who had been reported missing just a week previously. It transpires that the pair were part of an illegal rave that occurred in the council flat, and that during the rave, they were involved in the rape of a teenage girl, JoJo Collins, who subsequently attempted to commit suicide and is now in a coma. Eve believes the pair were killed before the explosion, and soon, JoJo's father Alan, an ex-army officer, comes under suspicion from Hale, as it is discovered that the explosion was caused by an incendiary device. Eve believes, however, that JoJo's sister Natasha and her boyfriend Nathan may have more to do with the deaths than meets the eye, and must use her scientific skills to prove it. \n\n\ns01e02 - Wealth Pays the Rent\n\nThe discovery of a hand in the grounds of an estate belonging to wealthy businessman Harold Penton leads Hale to Sam Villiers, an employee of Penton's who disappeared three weeks ago. Hale questions Penton's right hand man Jimmy West, as he believes he holds the key to finding Sam's body. Using his instinct, Hale hires Eve and the team to investigate a vegetable patch, and they find the body to which the hand belongs. However, after running tests on the body, Eve discovers that it is not the body of Villiers, but that of his boyfriend, Jason Quinn. Hale investigates a local drop-in center where Villiers and Quinn regularly visited, and discovers that not only are both of them addicted to drugs, but have been remanded for soliciting men in the past. After some investigation, it transpires that Penton is the man behind the drop-in center, and that the possible murderer is Dr. Thomas Grove, a friend of Penton's whom he hires to visit the drop-in center to look after the youngsters. Eve soon discovers that Villiers is still alive, and has simply been living in solitude.\n\n\ns01e03 - If You Go Down to the Sea Today\n\nWhen the body of thirty-five-year-old Connor Ryan is pulled from waters on the coast, Eve and the team are called to investigate when Hale suspects that the events surrounding his death are suspicious, and warrant an investigation. The team discover Ryan was part of a three man crew who had been on a diving expedition, to recover soil samples from the sea bed, and that the possible cause of death might have been lack of oxygen, caused by a faulty oxygen tank. However, when a second member of the crew, Tom Wilkes, is found alive and well, and provides different information regarding the incident, Hale realizes that pieces of the investigation don't slip into place. When the third member of the crew, mother of two Patsy Faye, is found dead at sea, Eve and Mike uncover a drug smuggling operation, which could have cost Patsy her life. Hale must prove that Wilkes killed his fellow crewman when they discovered he was a drug smuggler, in order to obtain an arrest. But will the evidence be enough to secure a conviction against this less than co-operative suspect?\n\n\ns01e04 - Sexual Intentions\n\nWhen the body of inmate Beth Fox is found during a riot in an open prison, Eve and the team are called to investigate the cause of her death. While a strike on the head with a pool cue during the riot appears to have only been superficial, whoever cut her throat had stronger intentions of killing her. With one of the suspects, Tess Williams, protesting on the roof of the prison, and unable to be reached, Hale must try and extract information from Nicole, a fellow inmate. Hale discovers that both Tess and Beth were part of an international drugs trial, in which inmates offered themselves up for tests in return for privileges at the prison. Nicole also reveals that Tess and Beth were having a sexual relationship. When the roof of the prison is cleared, however, Tess is nowhere to be found. Eve and the team must use their expert knowledge to track down the dangerous Tess, before she kills again.\n\n\ns01e05 - You've Got Visitors\n\nWhen the burning body of a human rights defense lawyer Richard Warner is found at his house, Hale suspects that it could be a possible suicide. However, Eve has other ideas. When Rosa finds the urine of illegal immigrant Joseph Marcell, a victim of a miscarriage of justice, in his toilet, Hale begins to suspect a case of revenge after Marcell was deported back to Sudan for a crime he did not commit. It soon transpires that Marcell was not the only visitor that night - Sarah Haines, a colleague and secret partner, and the man's son, Nick, however, when Eve discovers that the man was in the advanced stages of dementia, Hale's suicide theory begins to look more likely.\n\n\ns01e06 - Scientific Justice\n\nThe team are called in to investigate the death of Ray Quinn, a security guard who appears to have been murdered during a robbery gone wrong at his place of work. The owners of the garage, Mick and Martin Flannery, are keen to clear the scene so that they can open for business again, but after an initial investigation, Eve is convinced that there is more to the case than meets the eye. When Hale pays a visit to Ray's home, he discovers that he was from a traveling community, who are very suspicious of the police and refuse to tell him anything. Hale becomes concerned, however, when members of the community claim to deal with Ray's death themselves. The case takes a sinister twist when a young girl, Amanda, appears to be missing. Eve must earn the trust of Ray's family by showing them that she is only motivated by finding justice for Ray, and finding Amanda before she becomes another victim. But what is the real secret that the traveling community want to hide? And will Hale uncover the truth before Amanda comes to harm?\n\n*****\n\nVideo Specs: 624 x 352 Resolution - 1150k Data Rate\n             25fps - H.264/AVC Codec - MP4 File Type\nAudio Specs: 96k Bit Rate - 44.1k Sample Rate\n             2 Channel Stereo - MPEG-2/4 Audio Codec\n","torrent":{"xt":"urn:btih:54acd7f563a62609b1c37cdc8f9331abd1a74401","amp;dn":"The+Body+Farm+%282011%29+-+6+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54acd7f563a62609b1c37cdc8f9331abd1a74401","infoHashBuffer":{"type":"Buffer","data":[84,172,215,245,99,166,38,9,177,195,124,220,143,147,49,171,209,167,68,1]},"announce":[],"urlList":[]}}