{"title":"Selected Tales of the Unexpected - Roald Dahl  (BBC)","uid":6341201,"size":67137869,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:54ad8ad13f57004c55c215c3bc3de4d4d1b3df18&amp;dn=Selected+Tales+of+the+Unexpected+-+Roald+Dahl++%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":6,"time":1303672136,"description":"Roald Dahl - Kiss Kiss\nWoman's Hour Drama, BBC Radio 4 Monday 11th to Friday 15th April 2011\n5 episodes of 15 minutes\n\nDramatised by Stephen Sheridan\nProduced and directed by David Blount\n\nCharles Dance leads the cast as the urbane Storyteller in dramatisations of five classic tales by Roald Dahl, taken from the anthology, Kiss, Kiss. Bizarre and amusing by turns, these black comedies are justly famous for their surprise endings.\n\nThe stories show Dahl at the height of his powers as a writer of adult fiction, and are characterized by their deliciously cynical view of human nature and the relish with which they punish the charlatans, bullies and schemers who inhabit their world.\n\n\n1. William and Mary \nMary Pearl (Celia Imrie), thinks she's finally free of William, the tyrannical husband who forbade her all life's pleasures, when he dies after a short illness. She subsequently learns, however, that - hoping to cheat the grave - he allowed a scientist to remove his brain and attach it to a life support system. This gives her the opportunity to get her own back....\n\nCast:\nStoryteller .......... Charles Dance\nMary .......... Celia Imrie\nWilliam .......... John Rowe\nLandy .......... Nigel Anthony\n\n\n2. Parson's Pleasure\nCyril Boggis (Ronald Pickup) is an unscrupulous antiques dealer who charms his way into people's homes disguised as a simple parson, hoping to pick up neglected treasures for a song. One bright, Sunday afternoon however, all does not go according to plan when, in the home of farmer Rummins, he discovers a priceless Chippendale commode...\n\nCast:\nStoryteller .......... Charles Dance\nCyril Boggis .......... Ronald Pickup\nRummins .......... David Ryall\nClaud .......... John Baddeley\nLady Harcourt ......... Lucie Fitchett\n\n\n3. Royal Jelly\nIn Royal Jelly we meet beekeeper Albert Taylor and his wife Mabel. Worried that their newborn daughter isn't eating properly, Albert starts giving her royal jelly - a highly nutritious substance fed by bees to the larvae of their queens. The baby starts to put on weight. But Mabel begins to notice other changes too..\n\nCast:\nStoryteller .......... Charles Dance\nAlbert .......... Chris Emmett\nMabel ........... Rachel Atkins\n\n\n4. Mrs Bixby and the Colonel's Coat\nMrs Bixby - wife of a dull, New York dentist - is having an affair with a wealthy playboy known as the Colonel. When he decides to end their relationship, the Colonel gives her a mink coat as a keepsake. Realizing that her husband will wonder where she acquired such an expensive gift, Mrs Bixby devises an ingenious plan to explain it away....\n\nCast:\nStoryteller ........... Charles Dance\nMrs Bixby / Miss Pulteney ........... Lorelei King\nBixby / Colonel / Wilkins / Pawnbroker ........... Kerry Shale\n\n\n5. The Landlady\nYoung Billy Weaver has just arrived in Bath to take up a new job. He books into a curiously deserted B &amp; B. The landlady, who inhabits a sitting room filled with stuffed animals, is welcoming but odd. Wondering if he's her only guest, Billy checks the register and sees two strangely familiar names. Taking tea with her later, Billy suddenly remembers reading in the papers that both her former guests disappeared in mysterious circumstances. The landlady tells Billy that, like him, each was a beautiful young man whom she didn't want to leave....\n\nCast:\nStoryteller ........... Charles Dance\nLandlady ........... Doreen Mantle\nBilly Weaver .......... James Joyce\nMr Greenslade .......... John Rowe\n\nA Pier Production for BBC Radio 4\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:54ad8ad13f57004c55c215c3bc3de4d4d1b3df18","amp;dn":"Selected+Tales+of+the+Unexpected+-+Roald+Dahl++%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54ad8ad13f57004c55c215c3bc3de4d4d1b3df18","infoHashBuffer":{"type":"Buffer","data":[84,173,138,209,63,87,0,76,85,194,21,195,188,61,228,212,209,179,223,24]},"announce":[],"urlList":[]}}