{"title":"Java Power Tools","uid":4747344,"size":25590280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:555d0eaf3b36d0d001a197d35125ec3cfc8eae24&amp;dn=Java+Power+Tools&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":1,"time":1235948770,"description":"All true craftsmen need the best tools to do their finest work, and programmers are no different. Java Power Tools delivers 30 open source tools designed to improve the development practices of Java developers in any size team or organization. Each chapter includes a series of short articles about one particular tool -- whether it's for build systems, version control, or other aspects of the development process -- giving you the equivalent of 30 short reference books in one package. \nNo matter which development method your team chooses, whether it's Agile, RUP, XP, SCRUM, or one of many others available, Java Power Tools provides practical techniques and tools to help you optimize the process. The book discusses key Java development problem areas and best practices, and focuses on open source tools that can help increase productivity in each area of the development cycle, including: \nBuild tools including Ant and Maven 2 \nVersion control tools such as CVS and Subversion, the two most prominent open source tools \nQuality metrics tools that measure different aspects of code quality, including CheckStyle, PMD, FindBugs and Jupiter \nTechnical documentation tools that can help you generate good technical documentation without spending too much effort writing and maintaining it \nUnit Testing tools including JUnit 4, TestNG, and the open source coverage tool Cobertura \nIntegration, Load and Performance Testing to integrate performance tests into unit tests, load-test your application, and automatically test web services, Swing interfaces and web interfaces \nIssue management tools including Bugzilla and Trac \nContinuous Integration tools such as Continuum, Cruise Control, LuntBuild and Hudson \nIf you are a Java developer, these tools can help improve your development practices, and make your life easier in the process. Lead developers, software architects and people interested in the wider picture will be able to gather from these pages some useful ideas about improving your project infrastructure and best practices. \n","torrent":{"xt":"urn:btih:555d0eaf3b36d0d001a197d35125ec3cfc8eae24","amp;dn":"Java+Power+Tools","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"555d0eaf3b36d0d001a197d35125ec3cfc8eae24","infoHashBuffer":{"type":"Buffer","data":[85,93,14,175,59,54,208,208,1,161,151,211,81,37,236,60,252,142,174,36]},"announce":[],"urlList":[]}}