{"title":"Anne McCaffrey - Acorna (1-7) &amp; Acorna's Children (1-3)","uid":4959318,"size":2403305242,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:557d9e33880539957aa31fb9d1cb857bf98d218b&amp;dn=Anne+McCaffrey+-+Acorna+%281-7%29+%26+Acorna%5C%27s+Children+%281-3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Anaythea","files":247,"time":1245248522,"description":"Book 01\nAcorna The Unicorn Girl\nThree crusty young space prospectors recover a small survival pod containing a toddler with strange hands and feet, silvery curls, and a tiny horn in the center of her forehead. They name her Acorna and learn she has some unusual powers, such as abilities to purify water and air, to make plants grow, and to heal injuries. When the three take her &quot;planetside,&quot; Acorna is commandeered by scientists who want to study her as an anomaly. With some help from sympathizers, the prospectors manage, however, to whisk Acorna away to the planet Kezdet--&quot;a known cover for all sorts of thieves, desperadoes, con men, and cheats&quot;--where questions are not asked. But they soon discover Kezdet secretly deals in child slave labor, a practice Acorna determines to stop.\n\n--\n\nBook 02\nAcorna's Quest\nThis SF team's earlier novel, Acorna, introduced the alien girl Acorna, an orphan rescued and reared by space-faring humans. Though generally human-shaped, she shares some features with the unicorn of myth--notably, a forehead horn that can heal and purify. Now Acorna blasts off with human friends in search of her own race, who shortly turn up looking for her. These gentle, horned nonhumans are fleeing other aliens who are wanton murderers and torturers that resemble huge cockroaches. Meanwhile, a starship full of dispossessed human miners picks up a scientist whose devastating system of planetary weather control inspires some on-board criminals to stage a coup and use the weather machine to blackmail whole planets; Acorna stumbles into this conflict. Meanwhile, a spacefleet of killer roaches is on its way.\n\n--\n\nBook 03\nAcorna's People\nWith the help of her &quot;uncles&quot; and the thousands of humans who love and admire her, Acorna has found her true people, the peaceful, telepathic Linyaari. But Acorna still has much to do before she can enjoy her new home. The legendary resting place of the lost Linyaari ancestors has yet to be found. And with the help of a rogue spacetrader and his feline sidekick, Acorna must strive to right an unspeakable wrong and defeat an enemy even crueler than the Khleevi. Along the way, she will at last uncover the Universe's most carefully guarded secret--the true nature of the ancient link between the Linyaari and the space-faring humans she has also come to think of as her &quot;people.&quot;\n\n--\n\nBook 04\nAcorna's World\nGentle Unicorn Girl Acorna makes her fourth appearance in this galaxy-spanning successor to Acorna's Quest. Her shy, empathetic race, the pacific Linyaari, are still menaced by the horrid insectoid Khleevi, whose cannibalistic Young feast on their own elders as well as on other races they torture and destroy. Acorna, aboard the Condor, a spacegoing salvage ship captained by her friend Jonas Becker and accompanied by the vile-tempered Makahomian Temple Cat Road Kill and her Linyaari friend, Aari, who was previously maimed by the Khleevi, answers a distress call that leads her to a planet of sticky-veined sentient vines holding the secret to sapping the Khleevi and saving the Linyaari from extermination. Along the way, Acorna and Aari fall in love, a giant new Moon of Opportunity marketing venture (MOO) opens up for Acorna's adopted neo-Bedouin Uncle Hafiz, and the former slave children Acorna rescued earlier enjoy suitable education, gainful employment and a future of endless Happy Meals. Predictably strong on sweetness and light, noble self-sacrifice and plenty of teeny-bopper growing-up pangs. Athough correspondingly superficial in characterizations and future scientific wonders. This latest chapter in Acorna's adventures also offers (especially toward its close) some wry social commentary on capitalistic machinations and elder-eating younger generations: harmless good spacefaring fun.\n\n--\n\nBook 05\nAcorna's Search\nHomecoming for Acorna of the Linyaari turns out to be not only bittersweet (because of the damage sustained to the planet during its occupation by the Khleevi) but treacherous in this fanciful continuation of the Adventures of the Unicorn Girl (Acorna; Acorna's Quest; etc.) from fantasy titans McCaffrey (The Dragonriders of Pern) and Scarborough (The Healer's War). Acorna finds out that there's much more to her world than she or anyone else had imagined. It all starts when the teams who are helping to survey the planet for terraforming start to disappear, one by one. At first, Acorna is only a little worried about the disappearances of her friends and co-workers, but when her life-mate Aari goes missing, Acorna will move heaven and earth to bring him back. Mac (an android who wishes he were a Linyaari, even to the point of fashioning himself a horn), a cat named Roadkill and a youngish Linyaari named Thariinye all help Acorna in her search. Acorna and her hastily gathered team race against time (literally) and space to find their missing crewmates, pitting their wits against a world that has been decimated by warfare and a lack of information of any kind and transformed by technology that's more advanced than any they have seen before.\n\n--\n\nBook 06\nAcorna's Rebels\nMcCaffrey (the Pern series) and Scarborough (The Healer's War) offer another readable, lightweight cross between fantasy and SF in their latest novel about Acorna, the Unicorn Girl. A member of the Linyaari, a humanoid race with horns in the middle of their foreheads, Acorna continues to hunt for her beloved life-mate, Aari, who disappeared in Acorna's Search (2002). She travels aboard the starship Condor to the planet Makahomia, which she finds in the grip of a plague killing the sacred Temple cats. Acorna fights a desperate rearguard action against the plague with her horn's healing power, but the mystery clearly lies deeper. With the aid of both Condor shipmates, who include the Temple cat Roadkill (aka RK), and local Makahomians, among them shape-changing priests who can turn into cats, Acorna strives to prevent disaster.\n\n--\n\nBook 07\nAcorna's Triumph\nMore episodic than its predecessors, McCaffrey and Scarborough's finale to the charming Acorna saga will please the two authors' many fans and lovers of horses and cats generally. Last seen in Acorna's Rebels (2003), the unicorn girl has finally located her missing life-mate, Aari, though his exile in time has resulted in a disturbing personality change. Besides helping Aari to recover, Acorna must retrieve a hoard of jewels-chrysoberyls used in terraforming, stolen by a troupe of dancing girls with anti-gravity belts-from three races of sulfur-based beings, the Liquids, Solids and Mutables. She must also contend with the return of the Khleevi, disgusting insectoid aliens with evil designs on Acorna's home planet. And of course there is Grimalkin, the felinoid shape-changer, whose antics delay the well-deserved happy ending after all the bopping back and forth through time, across space and in flight from the Khleevi. While this light SF/fantasy romp is a hopeless proposition for newcomers to Acorna's travels, it serves as a fitting coda to the series. Both Acorna and Aari and their creators can ride off into the starlight with clear consciences.\n\n--\n\nAcorna's Children Book 1\nBy Anne McCaffrey &amp; Elizabeth A Scarborough\nUnabridged 8 hr 17 min\n\nThe breathtaking saga of the second generation begins!\n\nIt is difficult growing up in the shadow of heroes revered throughout the galaxy. But that is the lot of young Khorii -- daughter of the legendary Acorna and her lifemate Aari -- who must now follow her own destiny through a fantastic universe of wonders and perils.\n\nOn a journey, Khorii's trip is delayed when her ship encounters a derelict spacecraft floating aimlessly among the stars, its crew dead in their seats. Suddenly a planned visit by her parents has turned into a terrifying race against time as a deadly plague spreads relentlessly across the universe. Even the healing powers of the Linyaari cannot slow its horrific advance. And now Khorii, one of the few unaffected by the outbreak, must find an antidote -- before the scourge consumes everyone and everything in its path . . . including those she loves above all others. \n\n--\n\nAcorna's Children Book 2\nBy Ann McCaffrey &amp; Elizabeth A Scarborough\nUnabridged 8 hr 26 min\n\nUnicorn girl Khorii of the Linyaari had a horn-full of curing to do in McCaffrey and Scarborough's first chronicle of the Acorna's Children series, First Warning (2005), about a deadly plague sweeping the universe. In this spirited second installment, the gifted young healer, her adopted android brother, Elviiz (&quot;named for an ancient Terran king&quot;), and human survivors of the planet Paloduro struggle to devise a vaccine. Khorii makes the connection between the plague and the new threat of devouring, wraithlike aliens. Meanwhile, Khorii's quarantined parents, Aari and Acorna, learn Khorii has a twin, Arriin, whose embroyo had been stolen from them long ago by the Ancestral Friends. As an adult, Arriin escapes via a stolen time-travel device. The twins' reunion, along with the punishment of the criminal Marl Fidd, is a highlight of this episode in the exploits of Khorii and her crew. \n\n--\n\nAcorna's Children, Book 3\nBy Anne McCaffrey, Elizabeth Ann Scarborough\nNarrated by Lauren Davis\nUnabridged 8 hrs 2 min\n\nKhorii, the rebellious daughter of the near-mythic Acorna and her lifemate, Aari, has followed in Acorna's footsteps, leading their people from danger, but the pressure to succeed and fulfill a legacy is tremendous.\n\nFor the deadly foe that has ravaged the known worlds and weakened even her famous parents has launched its final assault, and only Khorii and her newly discovered sister, Ariin, are able to stop the brutal attack.\n\nBut success is elusive, and fragile, and even time itself may not be enough to help their desperate quest to save their family, much less the universe.","torrent":{"xt":"urn:btih:557d9e33880539957aa31fb9d1cb857bf98d218b","amp;dn":"Anne+McCaffrey+-+Acorna+%281-7%29+%26+Acorna%5C%27s+Children+%281-3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"557d9e33880539957aa31fb9d1cb857bf98d218b","infoHashBuffer":{"type":"Buffer","data":[85,125,158,51,136,5,57,149,122,163,31,185,209,203,133,123,249,141,33,139]},"announce":[],"urlList":[]}}