{"title":"The AIDS Conspiracy: Science Fights Back by Nicoli Nattrass","uid":10624851,"size":2201510,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:56bc38e64105fe084ad68bdbb0d87af40cd11d3b&amp;dn=The+AIDS+Conspiracy%3A+Science+Fights+Back+by+Nicoli+Nattrass&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1406209531,"description":"The AIDS Conspiracy - Science Fights Back (2012) by Nicoli Nattrass.pdf\n\nSince the early days of the AIDS epidemic, many bizarre and dangerous hypotheses have been advanced to explain the origins of the disease. In this compelling book, Nicoli Nattrass explores the social and political factors prolonging the erroneous belief that the American government manufactured the human immunodeficiency virus (HIV) to be used as a biological weapon, as well as the myth's consequences for behavior, especially within African American and black South African communities.\n\nContemporary AIDS denialism, the belief that HIV is harmless and that antiretroviral drugs are the true cause of AIDS, is a more insidious AIDS conspiracy theory. Advocates of this position make a &quot;conspiratorial move&quot; against HIV science by implying its methods cannot be trusted and that untested, alternative therapies are safer than antiretrovirals. These claims are genuinely life-threatening, as tragically demonstrated in South Africa when the delay of antiretroviral treatment resulted in nearly 333,000 AIDS deaths and 180,000 HIV infections -- a tragedy of stunning proportions.\n\nNattrass identifies four symbolically powerful figures ensuring the lifespan of AIDS denialism: the hero scientist (dissident scientists who lend credibility to the movement); the cultropreneur (alternative therapists who exploit the conspiratorial move as a marketing mechanism); the living icon (individuals who claim to be living proof of AIDS denialism's legitimacy); and the praise-singer (journalists who broadcast movement messages to the public). Nattrass also describes how pro-science activists have fought back by deploying empirical evidence and political credibility to resist AIDS conspiracy theories, which is part of the crucial project to defend evidence-based medicine.\n\n240 pages\nPublisher: Columbia University Press (March 20, 2012)\nLanguage: English\nISBN-10: 0231149123\nISBN-13: 978-0231149129","torrent":{"xt":"urn:btih:56bc38e64105fe084ad68bdbb0d87af40cd11d3b","amp;dn":"The+AIDS+Conspiracy%3A+Science+Fights+Back+by+Nicoli+Nattrass","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56bc38e64105fe084ad68bdbb0d87af40cd11d3b","infoHashBuffer":{"type":"Buffer","data":[86,188,56,230,65,5,254,8,74,214,139,219,176,216,122,244,12,209,29,59]},"announce":[],"urlList":[]}}