{"title":"Megas XLR All Seasons Including (Season 1,2) 480p","uid":13498705,"size":7127526903,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:585768aeb7eb0765027477696637cf48f0983a2e&amp;dn=Megas+XLR+All+Seasons+Including+%28Season+1%2C2%29+480p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AmazingAnime","files":26,"time":1455177473,"description":"Megas XLR is an American animated action comedy television series created by Jody Schaeffer and George Krstic for Cartoon Network. The series revolves around two slackers: mechanic Coop and his best friend Jamie, who find a mecha robot from the future called Megas (Mechanized Earth Guard Attack System) in a New Jersey junkyard. Coop modifies Megas and replaces his head, the control center, with a classic muscle car, and names him XLR (eXtra Large Robot). Together with Megas's original pilot Kiva, they must defend Earth from the evil alien race called &quot;the Glorft&quot;. The series is an homage and parody of mecha animation.\r\n\r\nSchaeffer and Krstic conceived the idea of an animated series where the main character would pilot a giant robot utilizing his video gaming skills. The pilot episode, LowBrow, was shown in 2002 during Cartoon Network's Cartoon Cartoon Weekend Summerfest, to determine which pilot would become a new Cartoon Cartoon; it was the most popular among viewers. It aired on the Toonami block from May 1, 2004 to January 15, 2005 for two seasons (totaling 26 episodes), before being cancelled due to low ratings.\r\n\r\nThe series was met with positive reception,[1][2] and was ranked at No. 4 on ToonZone's &quot;Toons of the 2000s: Top 5 Cartoon Network Originals&quot;.[3] There have been various fan efforts and petitions to revive the show since its cancellation.\r\n\r\n\r\n\r\n\r\n\r\nIn the distant future (specifically the year 3037, in the 31st century), Earth is fighting a losing war against an alien race known as &quot;the Glorft.&quot; In a last, desperate attempt to save the planet, the human resistance steals a prototype mecha robot from the Glorft and modifies it into a powerful war machine, renaming it MEGAS (Mechanized Earth Guard Attack System). The idea is to use a time-traveling device called a time drive to send MEGAS and its assigned pilot, Kiva Andru (Wendee Lee), two years into the past to the Battle of the Last Stand, which was the last major offensive fought by humanity against the Glorft. Humanity lost that battle, but the members of the resistance, particularly Kiva, believe that MEGAS can tip the scales and hand the Glorft a decisive defeat.\r\n\r\nBefore the plan can be executed, however, an attack by the Glorft forces the human resistance to send MEGAS back in time before proper preparations are made, but the time drive is accidentally damaged in the attack and, as a result, sends the now-crippled MEGAS (its head was blown off in the attack) all the way back to a 21st-century New Jersey junkyard, where it languishes under a pile of garbage until it ends up in the hands of a slacker mechanic, Coop (David DeLuise), and his slacker best friend, Jamie (Steve Blum), around the year 2004. Coop turns MEGAS into a hot rod project by repainting it with a flaming paint job, replacing its head with a classic muscle car (resembling a car from the '70s MOPAR family; most likely a Plymouth Barracuda) and adds XLR (eXtra Large Robot) to its name.\r\n\r\nKiva goes back in time to retrieve MEGAS, and when she finds she is unable to pilot it because of Coop's modifications, she grudgingly decides to train Coop, who is now the only person who can pilot it. However, the Glorft have followed her through time and, much to Kiva's chagrin, it is now up to the three of them to defend Earth from the Glorft and various other threats.\r\n\r\n\r\n\r\n\r\n\r\n\r\nProduction:\r\n\r\nWhile playing video games, Schaeffer and Krstic came up with an idea of making an animated series in which the main character would use his video gaming skills to pilot a giant robot.[4] The pilot short (LowBrow) was shown in 2002 as part of Cartoon Network's Cartoon Cartoon Weekend Summerfest, a contest to determine which pilot would be selected as the next Cartoon Cartoon. It was the most popular among viewers, and was greenlit as a series.\r\n\r\nMuch of the series is inspired by Japanese mecha anime which the two grew up watching, with the animation being inspired by both anime and Western animation.[4] The humour often pays homage or mocks anime conventions.[4]\r\n\r\nAfter being delayed from its original debut in December 2003, Megas XLR finally debuted on the Toonami block on May 1, 2004. However, due to low ratings, the series was cancelled rather quickly, with the final episode airing on January 15, 2005.\r\n\r\nReruns continued to air sporadically from January 16, 2005 to June 24, 2006. During this time, the series was later moved to the graveyard slot of 3:30 A.M. on Saturday mornings, before being removed from the network altogether.\r\n\r\nMegas XLR is currently not airing on any station in the United States, but aired on Teletoon in Canada","torrent":{"xt":"urn:btih:585768aeb7eb0765027477696637cf48f0983a2e","amp;dn":"Megas+XLR+All+Seasons+Including+%28Season+1%2C2%29+480p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"585768aeb7eb0765027477696637cf48f0983a2e","infoHashBuffer":{"type":"Buffer","data":[88,87,104,174,183,235,7,101,2,116,119,105,102,55,207,72,240,152,58,46]},"announce":[],"urlList":[]}}