{"title":"Australian Cinema After Mabo(pdf){Zzzzz}","uid":11524689,"size":2374051,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58d9f0f1db225b3a86f0a4810fa8324baee64b37&amp;dn=Australian+Cinema+After+Mabo%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1416518944,"description":"Australian Cinema after Mabo is a comprehensive 2005 study of Australian national cinema in the 1990s. Using the 1992 Mabo decision as a starting point, it looks at how the Mabo decision, where the founding doctrine of terra nullius was overruled, has destabilised the way Australians relate to the land. It asks how we think about Australian cinema in the post Mabo era, and what part it plays in the national process of reviewing our colonial past and the ways in which settlers and indigenous cultures can co-exist. Including The Tracker, Kiss or Kill, The Castle, Love Serenade and Yolngu Boy among numerous others, this book highlights turning points in the shaping of the Australian cinema since Mabo. It is essential reading for anyone studying Australian cinema and for those interested in the ways in which land politics has impacted upon the way we imagine ourselves through cinema.\n\nPublisher: Cambridge University Press (February 22, 2005)\nLanguage: English\nISBN-10: 0521542561\nISBN-13: 978-0521542562\n\nEditorial Reviews\nReview\n'The authors offer a compelling argument about the development of Australian cinema in the wake of the High Court's 1993 Mabo judgement, which overturned the founding principle of terra nullius - the myth that Australia was 'empty' prior to European settlement/invasion. This belated realization, Collins and Davis argue, opened a completely new chapter in the country's national cinema. The late 1990s and early 2000s have seen Australian film-makers respond by reflecting critically upon Australia's unresolved historical 'trauma' and restaging the country's colonial history ... the book is strong in addressing films directly responsive to the crumbling myth of terra nullius ... it ... offers an excellent, much-needed sophisticated contribution to contemporary political, historical and cinematic debates around Australian national identity, while evidencing the continuing weight and relevance of film as a culturally engaged form.' Year's Work in Critical and Cultural Theory\n\nBook Description\nAustralian Cinema after Mabo is a comprehensive 2005 study of Australian national cinema in the 1990s. Using the 1992 Mabo decision as a starting point, it looks at how Mabo has destabilised the way Australians relate to the land and highlights turning points in the shaping of the Australian cinema","torrent":{"xt":"urn:btih:58d9f0f1db225b3a86f0a4810fa8324baee64b37","amp;dn":"Australian+Cinema+After+Mabo%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58d9f0f1db225b3a86f0a4810fa8324baee64b37","infoHashBuffer":{"type":"Buffer","data":[88,217,240,241,219,34,91,58,134,240,164,129,15,168,50,75,174,230,75,55]},"announce":[],"urlList":[]}}