{"title":"Gladiator Series - Simon Scarrow","uid":9303895,"size":3681229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58ebabd6330bc77d0fc235782f76398d92b740de&amp;dn=Gladiator+Series+-+Simon+Scarrow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1386283826,"description":"Fight for Freedom\nEleven-year-old Marcus Cornelius Primus has been torn from his idyllic childhood and recruited as a gladiator, facing a life of intense training governed by strict rules. As he learns what it takes to become an elite warrior, Marcus makes new friends and masters valuable skills, though he also makes a dangerous enemy who will stop at nothing to make Marcus's life miserable.\nBut Marcus has no intention of staying in gladiator school forever. He is determined to find his father's old commander to right the wrongs that have been done to Marcus's family. Escape won't be easy, with the threat of punishment and battle in the arena looming large. Yet, unbeknownst to Marcus, he carries a secret that might hold the key to his freedom and that of all of the Empire's slaves. And if the Romans discover it, there will be no escape.\n\nStreet Fighter\nIt is settled. The boy is in your charge. You will train him to fight. He must be able to use the dagger, throwing-knife, staves and his bare hands. One day young Marcus may well become a gladiator in the arena. But you must also teach him the ways of the street'. Now a member of Julius Caesar's palace, Marcus' training continues in the city of Rome. The streets are plagued by vicious gang war attacks, and Caesar must employ his own gang leader, who learns of a plot to murder him. Only Marcus can go in undercover. But he's in terrible danger. If the rival gang discover him the price will be fatal. Julius Caesar's isn't the only life at risk.\n\nSon of Spartacus\nFree from slavery, Marcus is determined to find and save his kidnapped mother. Meanwhile, his master Julius Caesar wants Marcus to help destroy the bands of rebel slaves and their leader Brixus, who plans to unite a slave army and resurrect the cause of Spartacus. But Marcus and Brixus are old allies who share a life-threatening secret. Marcus is torn between his friend and master. Can he convince Brixus now is not the time for a deadly revolt - and ask Caesar to negotiate a slave surrender before more carnage and bloodshed? This book comes from the numbered 1 bestselling adult author Simon Scarrow - over 1 million copies sold. It is the perfect introduction to Roman history and gladiators for young readers - great for fans of Rick Riordan's Percy Jackson and J. K. Rowling's Harry Potter. Book 3 in the series.","torrent":{"xt":"urn:btih:58ebabd6330bc77d0fc235782f76398d92b740de","amp;dn":"Gladiator+Series+-+Simon+Scarrow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58ebabd6330bc77d0fc235782f76398d92b740de","infoHashBuffer":{"type":"Buffer","data":[88,235,171,214,51,11,199,125,15,194,53,120,47,118,57,141,146,183,64,222]},"announce":[],"urlList":[]}}