{"title":"Hedlok - Frequency Wrap (2014)","uid":9529944,"size":150523142,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:591edae5d9288d06125fc0e32a0b5d06803060d4&amp;dn=Hedlok+-+Frequency+Wrap+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geloso","files":-1,"time":1390781470,"description":"Hedlok\n\nFrequency Wrap\n\nDubstep\n\nDubstep SF (DUBSTEPSF026)\n\n320 kbps MP3 | unmixed\n\n2013-12-30\n\n01:02:18\n\n143 Mb\n\n\n\n\nTracklist:\n\n01. Salvation (4:08)\n\n02. In the silence (4:42)\n\n03. Pantheon (4:31)\n\n04. GhostFace Killa (6:35)\n\n05. How can we dance (6:04)\n\n06. Twilight's last gleaming (4:11)\n\n07. Qatar (6:03)\n\n08. Frequency Wrap (6:44)\n\n09. Torch Song (7:00)\n\n10. The Swerve (4:13)\n\n11. Secret Weapon (feat. Frost) (5:49)\n\n12. Vulture - Ladder to hell (Hedlok rmx) (2:18)\n\n\n\n &lt;a href=&quot;\nhttp://www.beatport.com/release/frequency-wrap/1218021&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.beatport.com/release/frequency-wrap/1218021&lt;/a&gt;\n\nDubstep SF presents, this full length album from Hedlok, the owner of Wayside Recs from Denver by way of San Francisco and originally from Austin. This will be Hedlok's 5th album and 2nd time on cd, Frequency Wrap is for all seekers of deep and funky dubstep goodness made for your body and your mind, with Hedlok's bass smashed into your face there will be no escape. Taking a heavy psyfy direction with these dubby facemelters Hedlok creates a new style all his own that will launch your dancefloors into outer bass heaven! Influenced by world sounds, electronic cutting edge production and visual stimulation peaking the limits of sensory input. After releasing music under many monikers over the years, Danny Feral had decided to focus all the effort and energy into a single profile, Hedlok. Formed in 2005 As a group of producers based out of Austin,TX. Original Members Included Mk Ultra, Recall &amp; K2. When Recall &amp; Mk Ultra Moved to Oakland,Ca. in 2007 the group rooted quickly in the local dubstep scene and quickly was signed to the prestigious 'Bay Area Dubstep vol.3' on Full Melt Records compiled by Bay Area legend dj Ripple who is noted alongside Atomikdog for introducing dubstep to California. While constantly submerging himself in the esoteric and the spiritual realm Dan will continue to push his world of sound further with collaborations and the growth of his Nomadic Production live act set to tour in 2013. Also look out for previous hit album from Hedlok titled Terminal Error released on Bass Star in 2012. Dubstep SF Features the West Coasts most prominent hotbed of producers grinding out some of the world's most notorious hits &amp; fresh tracks hot from the dancefloors and dub pits of the SF Bay Area. Bass Star Records formed in summer of 2007 and is focused primarily on breaks, dub step, electro house and down tekno grooves. Expect lots of wild unpredictable new cuts coming from this phat","torrent":{"xt":"urn:btih:591edae5d9288d06125fc0e32a0b5d06803060d4","amp;dn":"Hedlok+-+Frequency+Wrap+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"591edae5d9288d06125fc0e32a0b5d06803060d4","infoHashBuffer":{"type":"Buffer","data":[89,30,218,229,217,40,141,6,18,95,192,227,42,11,93,6,128,48,96,212]},"announce":[],"urlList":[]}}