{"title":"The Upperfloor--tUF-33972 Daisy Ducati, Zoey Monroe and Bill Bai","uid":9039189,"size":4133394733,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:59c98acebac7b5e33882b03fe23d93bc427316e6&amp;dn=The+Upperfloor--tUF-33972+Daisy+Ducati%2C+Zoey+Monroe+and+Bill+Bai&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"merzedes","files":-1,"time":1381536640,"description":"Daisy Ducati Petitions to Serve the House, and Anal Slut Zoey Monroe Gets Fucked in the Ass\n\nOct 11, 2013 - Performers: Zoey Monroe ,  Bill Bailey  and  Daisy Ducati \n \n\nMP4 and WMV only.\n  \n\nIt is my humble opinion that a good house slave should be proficient in keeping cocks hard and pussies wet. And Zoey Monroe's pussy is about as fine as any that has pranced around the Upper Floor, especially when stuffed with Mr. Bailey's freakishly huge cock. But first - the household tradition is to stand the petitioner up in front of everyone and make her squirm under an interrogation of pain and orgasms. What does she want here, why should we take her on, and what is she good for? \n\nMeanwhile, Miss Zoey is tied spread eagle to a table as a centerpiece to amuse the brunch guests in a humiliating show of tease and orgasm denial. Watching the hot blonde squirm around on our dining room table in front of the guests makes my dick twitch almost as much as her tits bounce each time Bill rams her pussy with a fat rubber cock. \n\nAfter brunch, we all retire to the lounge to see what these two sluts are really made of. Daisy is ordered to prove that her body really belongs to the House by sending her into the crowd to beg for orgasms. Zoey immediately fucks up and is caught loafing on the furniture - a sure invitation for the House Steward to get in her face, and a lesson in where her place is: kneeling on the floor with a hard cock down her throat. \n\nBy now, guests are steaming the place up fucking, sucking, smacking and tying each other into fucking pretzels as our two sluts try to keep up with the demands. The boy / girl / girl anal action heats up as Bills huge dick pounds Zoey's tiny, tight asshole, and Daisy's tounge is right there to keep everything lubed and happy. It is hot as fuck watching these two beautiful sluts get fucked all afternoon as the guests bang each other silly in the background. When they are finally ordered to get the come, their greedy faces are right there sharing the cock and swapping the jizz for all our amusement. \n\nIn the end, we can only keep one of them. Which one would you pick?\n\nScreens &lt;a href=&quot;\nhttp://www.theupperfloor.com/site/shoot/33972-Daisy-Ducati-Petitions-to-Serve-the-House-and-Anal-Slut-Zoey-Monroe-Gets-Fucked-in-the-Ass.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theupperfloor.com/site/shoot/33972-Daisy-Ducati-Petitions-to-Serve-the-House-and-Anal-Slut-Zoey-Monroe-Gets-Fucked-in-the-Ass.html&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:59c98acebac7b5e33882b03fe23d93bc427316e6","amp;dn":"The+Upperfloor--tUF-33972+Daisy+Ducati%2C+Zoey+Monroe+and+Bill+Bai","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59c98acebac7b5e33882b03fe23d93bc427316e6","infoHashBuffer":{"type":"Buffer","data":[89,201,138,206,186,199,181,227,56,130,176,63,226,61,147,188,66,115,22,230]},"announce":[],"urlList":[]}}