{"title":"Nanostructured Catalysts","uid":12084821,"size":12528681,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59e3ead171ee06a461587d8e8fa52f5d6480ed61&amp;dn=Nanostructured+Catalysts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435871166,"description":"Nanostructured Catalysts - Susannah L. Scott, Cathleen M. Crudden, and Christopher W. Jones (Springer).pdf\n\neBook ISBN: 0-306-47928-1\nPrint ISBN: 0-306-47484-0\n\nWith the recent advent of nanotechnology, research and development in the area of nanostructured catalysts has gained unprecedented prominence. Novel materials with potentially exciting new applications in catalysis are being discovered at a much higher rate than ever before. Innovative tools to fabricate, manipulate, characterize, and evaluate such materials are being developed and expanded. To keep pace with this extremely rapid growth, it is necessary to take a breath from time to time, to critically assess the current knowledge and provide thoughts for future developments. This book represents one of these moments, as a number of prominent scientists in nanostructured catalysts join forces to provide insightful reviews of their areas of expertise; thus, offering an overall picture of the state-of-the art of the field.\n\n\nNanostructured materials designate an increasing number of materials with designed shapes, surfaces, structures, pore systems, etc. In general, nanostructured catalysts have modified surfaces, including materials whose surfaces have been altered via such techniques as grafting and tethering of organic or organometallic species, or through various deposition procedures including electro, electroless, and vapor deposition, or simple adsorption. Materials with designed regular pore systems, such as zeolites, metallophosphates, periodic mesoporous materials, nanoporous organic, and organometallic materials are also members of the large family of nanostructured materials. These materials are of paramount importance, particularly in catalysis.\n\n\nOne of the most distinctive characteristics of this book is the fact that it is all-inclusive, since most of the materials listed above have been dealt with in a concise and informative manner. With fourteen up-to-date reports on the design, synthesis, and catalytic properties of nanostructured materials, this book sets the stage for things to come in this area. The development of novel catalysts, taking advantage of the many interesting attributes of periodic nanoporous materials, and the discovery of innovative materials, such as polymer- silica nanocomposites and confined nanoparticles, are some of the leading ideas for future work in the increasingly important field of nanostructured catalysts","torrent":{"xt":"urn:btih:59e3ead171ee06a461587d8e8fa52f5d6480ed61","amp;dn":"Nanostructured+Catalysts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59e3ead171ee06a461587d8e8fa52f5d6480ed61","infoHashBuffer":{"type":"Buffer","data":[89,227,234,209,113,238,6,164,97,88,125,142,143,165,47,93,100,128,237,97]},"announce":[],"urlList":[]}}