{"title":"Yo-Yo Sexy Girl Cop (2006) - Eng Hard Subs","uid":5571153,"size":734080786,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:59e3b281d1048cec75cb2fe97924fbd1054e21e3&amp;dn=Yo-Yo+Sexy+Girl+Cop+%282006%29+-+Eng+Hard+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Horrorspoke","files":1,"time":1274255943,"description":"In the opening scene of this movie, a Japanese &quot;schoolgirl&quot; is walking alone on the subway and is snatched by a pervert(dressed in lederhosen for some reason). He takes her back to his hideout where he has several more high school girls tied up. This new arrival turns out to be an undercover cop, however, and she dispatches the pervert with her two weapons--her yo-yo and her see-through panties (the yo-yo is actually a good weapon, but aside from their obvious exploitation value, I'm not so sure about the see-through panties). It turns out the character &quot;Saki&quot; aka &quot;Yo-Yo&quot; aka &quot;Agent See-Through Panties&quot; is a former girl-gang leader who is being forced to work undercover (and wear see-through panties) by the police who have arrested her drug-addict/prostitute mother. For her next assignment she is sent undercover to break up a prostitution ring at the local high school.\n\nObviously, this is a lot more exploitative than realistic. &quot;Saki&quot; is supposed to be both a female gang boss AND a virgin, but the model-pretty actress who plays her doesn't look remotely like either. For an undercover operative, she also sticks put like a sore thumb in her &quot;new&quot; high school since she insists on wearing the wrong uniform, yelling at her classmates, and fighting with the girls in the dominant clique (her see-through panties don't help either). As usual in Japanese exploitation films, the males at the school are all clueless dorks and/or incorrigible lechers, and both the female &quot;teachers&quot; and the &quot;students&quot; are all played by twenty-year-old girls with perfect bodies (not that I have anything against twenty-year-old Japanese girls with perfect bodies).\n\nI've been checking out a lot of Japanese &quot;pink&quot; films from the 1960's up to the present day ever since reading Jasper Sharp's excellent book &quot;Behind the Pink Curtain&quot;. Some are actually pretty good, some aren't so good but are genuinely erotic, and some are neither good nor very erotic but are so weird and perverted they're kind of interesting nevertheless. This definitely doesn't make the first category, but it falls somewhere between the second and the third. If you want to take that as a recommendation, have at it. \n\nIMDB info: http://www.imdb.com/title/tt1076862/\n\nSame as always guys, comment seed, and enjoy!","torrent":{"xt":"urn:btih:59e3b281d1048cec75cb2fe97924fbd1054e21e3","amp;dn":"Yo-Yo+Sexy+Girl+Cop+%282006%29+-+Eng+Hard+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59e3b281d1048cec75cb2fe97924fbd1054e21e3","infoHashBuffer":{"type":"Buffer","data":[89,227,178,129,209,4,140,236,117,203,47,233,121,36,251,209,5,78,33,227]},"announce":[],"urlList":[]}}