{"title":"Saved By the Light (TV) [1995] Eric Roberts","uid":6790224,"size":662364806,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5badb3d32741d248bf9a983b7069d1c61a2d52de&amp;dn=Saved+By+the+Light+%28TV%29+%5B1995%5D+Eric+Roberts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1320194095,"description":" &lt;a href=&quot;http://bayimg.com/lAkeHAadM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/lAkeHAadM&lt;/a&gt;\n\nSaved by the Light (TV 1995) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0114342/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0114342/&lt;/a&gt;\n\nA mean, loud-mouthed town bully is talking on the phone one night during a lightning storm when, in a freak occurrence, a bolt of lightning strikes a telephone pole, travels down the phone wires and hits him. He is declared clinically dead, but miraculously recovers shortly thereafter--with a completely new personality and, he claims, the ability to communicate with the dead.\n\n  Eric Roberts  ...  Dannion Brinkley  \n  John Alexander  ...  Car buyer  \n  Elizabeth Alley  ...  Grace Ann  \n  Avis-Marie Barnes  ...  Attending nurse  \n  Christi Bauerle  ...  Expo groupie  \n  Chick Benjamin  ...  First cop  \n  Dan Bright  ...  Gas station attendant  \n  Mark Brown  ...  Anesthesiologist  \n  K Callan  ...  Dannion's mother  \n  Michele Carter  ...  Nursing Home Manager (as Michele Carter Freeman)  \n  Robert Catrini  ...  Lecture man  \n  Tom Chapman  ...  Mr. McCauley  \n  David Cohen  ...  Dannion  \n  George Colangelo  ...  ER doctor  \n  Jim R. Coleman  ...  Jenkins  \n\nDannion Brinkley (born July 20, 1950) is an American author who described two near death experiences in his 1994 book Saved by the Light. He is also a hospice volunteer, speaker, and prominent figure in the New Age and New Thought Movement.\n\nIn Saved by the Light Brinkley explained that he was struck by lightning on September 17, 1975, while using a telephone at his home in Aiken, South Carolina. He said he was clinically dead for 28 minutes. During these 28 minutes Brinkley said he experienced many characteristic details of a near death experience as well as certain unique ones. His account includes an out-of-body experience with extensive observations of physical surroundings, passing through a tunnel, a high-speed and detailed life review and an encounter with beings who showed him visions of the future and discussed with him his life mission. Brinkley said he had a strong reluctance to return to his physical body, but he was sent back to fulfill a mission.\n\nBrinkley said when he re-entered his body in the hospital he blew on the sheet that was covering his head. His friend noticed the moving sheet and said, &quot;he's still alive!&quot; By the end of September 1975 he was released from the hospital.\n\nShortly after the event occurred Brinkley told his story to near-death researcher Raymond Moody. In the Introduction to Saved by the Light, Moody wrote Brinkley's near death experience stands as one of the most incredible he has ever heard.\n\nSaved By the Light was adapted for a 1995 Fox Broadcasting Company TV movie of the same name starring Eric Roberts, and debuted as one of the highest rated television movies in that network's history. Since originally airing, it has been in regular circulation on the Lifetime Movie Network.\n\nThirteen years ago, Eric Roberts was on the top of the world. Fresh off an Academy Award nomination for Runaway Train and a string of memorably intense performances in films such as Star 80 and The Pope Of Greenwich Village, Roberts seemed to have a bright future. Though the quality of his roles has diminished over the last decade, the quantity has increased exponentially. With a good script and a strong director Roberts can still deliver, witness La Cucaracha and The Butcher.\n\n\n","torrent":{"xt":"urn:btih:5badb3d32741d248bf9a983b7069d1c61a2d52de","amp;dn":"Saved+By+the+Light+%28TV%29+%5B1995%5D+Eric+Roberts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5badb3d32741d248bf9a983b7069d1c61a2d52de","infoHashBuffer":{"type":"Buffer","data":[91,173,179,211,39,65,210,72,191,154,152,59,112,105,209,198,26,45,82,222]},"announce":[],"urlList":[]}}