{"title":"Asses In Public XXX  Site Rip@Mastitorrents","uid":5453651,"size":19464286540,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5bf6ef2d142b165546d36bc139495d977adddb5a&amp;dn=Asses+In+Public+XXX++Site+Rip%40Mastitorrents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"amanrulz","files":41,"time":1269218385,"description":"Mastitorrents.com &lt;a href=&quot;\nhttp://mastitorrents.com/forums/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mastitorrents.com/forums/index.php&lt;/a&gt;\n\n\nHere at Brazzers we're willing to risk our fucking lives just to bring you the craziest porn footage in the world. Our latest edition, AssesInPublic.com speaks for itself. Our crew roams the streets of your cities hunting down the hottest asses you've ever seen, getting them to strip down and fuck right out in public. No rules, no limits, just hot asses...\n\nStarring: Alexa Jordan, Rosario Stone, Barbi Addison, Britney Stevens, Brooke Scott, Cali Cassidy, Cayden Moore, Camryn Kiss, Dakoda Brookes, Cassandra Calogera, Charley Chase, Claire Dames, Claudia Valentine, Crista Moore, Felony, Franchezca Valentina, Gwen Diamond, Holly Wellin, Paris Gables, Kylie Reese, Jessica Shaw, Kelly Divine, Kristina Rose, Krystal Jordan, Lacey DuValle, Mariah Milano, Marina Maywood, Naomi Cruise, Jaelyn Fox, Nichole Heiress, Nicole Banks, Olivia O'lovely, Renae Cruz, Ricki White, Sheila Marie, Shyla Stylez, Sophie Dee, Stephanie Cane, Sunny Lane, Tricia Oaks, Velicity Von, Whitney Stevens &amp; Heidi Mayne.\n\nIncluded in this site rip are the scenes feauring Barbi Addison which has since been removed from Brazzers website either due to threatening to pursue legal action or court order. Also included is the Heidi Mayne scene which was intended for Asses In Public but wasn't released before they canceled the website, so it was later released as a Brazzers Vault scene, but there's no question it was intended for Asses In Public. \n","torrent":{"xt":"urn:btih:5bf6ef2d142b165546d36bc139495d977adddb5a","amp;dn":"Asses+In+Public+XXX++Site+Rip%40Mastitorrents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bf6ef2d142b165546d36bc139495d977adddb5a","infoHashBuffer":{"type":"Buffer","data":[91,246,239,45,20,43,22,85,70,211,107,193,57,73,93,151,122,221,219,90]},"announce":[],"urlList":[]}}