{"title":"Coast to Coast AM 2012.02.19 Investigating UFOs","uid":7074895,"size":55686480,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5c7be74f4471b3a379a263d7ef348e57ff4c3eb3&amp;dn=Coast+to+Coast+AM+2012.02.19+Investigating+UFOs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ViViDSOL","files":5,"time":1330801221,"description":"Coast to Coast AM 2012.02.19 Investigating UFOs\n\nHost: \tGeorge Knapp\nGuests: Kevin D. Randle, Lee Speigel\n\nJoining George Knapp, author Kevin Randle discussed his decades-long work as a UFO investigator, and some of the most significant cases he's examined. A former Captain in the Air Force, he described himself as a &quot;skeptical believer,&quot; who accepts the idea that we've been visited by extraterrestrials but thinks these visitations are &quot;not nearly as widespread as a lot of the other UFO researchers would have us believe.&quot; There were a lot of robust sightings in the 1940s-1970s, but since that time UFO flaps have tapered off to a large degree, he commented.\n\nAs for the best type of proof for the phenomenon, Randle cited &quot;chains of evidence,&quot; such as when radar data can be correlated with pilot sightings, like what occurred in a 1952 Washington DC incident. Regarding photographic documentation, it can be proved that the Air Force doctored film of a 1950 incident in Great Falls, Montana to cover-up evidence of a disc-shaped craft, he reported. He named the Levelland,TX UFO sightings of 1957 as one of the strongest cases, in which an object interacted with the environment, stalling car engines, dimming headlights, and filling radios with static-- there were witnesses in thirteen separate locations in the area, he detailed.\n\nOne intriguing case involved the testing of a metal sample said to come from an exploding UFO in Ubatuba, Brazil. The sample was at first thought to be composed of pure magnesium (which would suggest an ET origin), but Randle has questioned the purity and provenance of the material (more info). He also spoke about his in-depth investigation of the Roswell Incident, and how military witnesses may yield the most substantial data in the case, as some civilian testimonies have proved to be unreliable over the years.\nHoaxes &amp; Misidentifications\n\nFirst hour guest, Huffington Post writer Lee Speigel talked about how most reports of UFOs and extraordinary creatures &amp; events are either hoaxed or cases of misidentification. Recent examples include a report of unexplained metal boxes found on an Oregon beach (they actually may have been floating devices that drifted away from docks) and a supposed video of a woolly mammoth recorded in Siberia. We live in a era &quot;where it's just become too easy to create hoaxes and fakery jobs on the Internet. The sophistication of computer programs is now watering down all the good cases,&quot; he lamented.\n\nWebsite(s):\n &lt;a href=&quot;\nhttp://huffingtonpost.com/lee-speigel&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://huffingtonpost.com/lee-speigel&lt;/a&gt;\n\nBook(s):\n\nReflections of a UFO Investigator &lt;a href=&quot;\nhttp://amzn.to/AxWOuL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/AxWOuL&lt;/a&gt;\n\nOperation Roswell &lt;a href=&quot;\nhttp://amzn.to/ACseO5&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/ACseO5&lt;/a&gt;\n","torrent":{"xt":"urn:btih:5c7be74f4471b3a379a263d7ef348e57ff4c3eb3","amp;dn":"Coast+to+Coast+AM+2012.02.19+Investigating+UFOs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c7be74f4471b3a379a263d7ef348e57ff4c3eb3","infoHashBuffer":{"type":"Buffer","data":[92,123,231,79,68,113,179,163,121,162,99,215,239,52,142,87,255,76,62,179]},"announce":[],"urlList":[]}}