{"title":"The Sewing Machine Classroom: Learn the Ins &amp; Outs of Your M","uid":11117654,"size":3463527,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d009b1e657453bfd8de728b528bc92529ad8427&amp;dn=The+Sewing+Machine+Classroom%3A+Learn+the+Ins+%26amp%3B+Outs+of+Your+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KnitLady","files":-1,"time":1411867831,"description":"Make the Most of Your Sewing Machine! Join author Charlene Phillips as you learn all about your new best friendï¿½your sewing machine! From fabric to feet to finished product, youï¿½ll be guided through techniques for mastering your machine and using it to perform basic to advanced stitching tasks. Whether youï¿½ve been sewing for years or just gotten the itch, youï¿½ll find invaluable information inside for using your sewing machine to its maximum potential. Learn how to:Troubleshoot machine problems like skipped stitches, needle breaks and tension troublesPerform basic maintenance on your machine to keep it running smoothlyChoose fabrics, threads and other materials that will keep your machine running at full capacity and result in quality projectsRecognize and utilize the best sewing machine feet to achieve the desired resultsRefine everyday tasks from installing zippers to sewing buttonholes and constructing perfect hemsCreate beautiful embellishments like scallops, ruches, smocking, pin tucks, cutwork, puffing and entredeux to enhance any sewn project or garment An indispensable reference book to keep next to your machine, inside youï¿½ll find quick answers to all your sewing problems. Take control of your sewing machine and achieve wonderful results every time!","torrent":{"xt":"urn:btih:5d009b1e657453bfd8de728b528bc92529ad8427","amp;dn":"The+Sewing+Machine+Classroom%3A+Learn+the+Ins+%26amp%3B+Outs+of+Your+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d009b1e657453bfd8de728b528bc92529ad8427","infoHashBuffer":{"type":"Buffer","data":[93,0,155,30,101,116,83,191,216,222,114,139,82,139,201,37,41,173,132,39]},"announce":[],"urlList":[]}}