{"title":"Lester James Peries - Village in the Jungle (1982)","uid":8411225,"size":1528673440,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5dcb8c9531b16694d6087deaf6a12260b679cc79&amp;dn=Lester+James+Peries+-+Village+in+the+Jungle+%281982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":".GOGO","files":1,"time":1366921506,"description":"Village in the Jungle (1982) \n&quot;Baddegama&quot; (original title)\nDirector: Lester James Peries\nRun time: 130 min \n\nn 1980, Peries made The Village in the Jungle, based on the well-known work of the same name by Leonard Woolf. Commenting on his novel, Woolf observed that, &quot;The jungles and the people who lived in the Sinhalese jungle villages fascinated, almost obsessed me in Ceylon. They continued to obsess me in London , in Putney or Bloomsbury, and in Cambridge.&quot; He added, &quot;The Village in the Jungle&quot; was a novel in which I tried to somehow or other vicariously to live their lives. It was also, in some curious way, the symbol of the anti-imperialism which had been growing upon me more and more in my last years in Ceylon.&quot; The story of The Village in the Jungle is set in an isolated village in the south of Sri Lanka some one hundred years ago. It chronicles the trials and tribulations of a group of villagers living in a tiny, isolated community. Surrounded by the ferociously hostile jungle, they have to contend with a colonial administration and legal system which is as corrupt as it is irrelevant to their daily concerns. The Village in the Jungle is, then, as much about the hardships and misery of a group of peasants trying to eke out a living in inhospitable conditions as it is about the insensitivity and callousness of the colonial administrative machinery. Their lives are shaped by the environment, the climate, the overpowering presence of the jungle as well as by their raw emotions and cultural practices.\n\nSource: template @ kg","torrent":{"xt":"urn:btih:5dcb8c9531b16694d6087deaf6a12260b679cc79","amp;dn":"Lester+James+Peries+-+Village+in+the+Jungle+%281982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dcb8c9531b16694d6087deaf6a12260b679cc79","infoHashBuffer":{"type":"Buffer","data":[93,203,140,149,49,177,102,148,214,8,125,234,246,161,34,96,182,121,204,121]},"announce":[],"urlList":[]}}