{"title":"Alex Jones Show - 2012 Feb 02 TH [sebaygo1]","uid":7004757,"size":68666488,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5dcc262780feb4e0fed6ef7bee7c4d72ad12685a&amp;dn=Alex+Jones+Show+-+2012+Feb+02+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":11,"time":1328227972,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nThursday, 02 February 2012\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site ::\n\nAlex talks with researcher and author Fritz Springmeier on the Thursday, February 2 edition of the Alex Jones Show. Springmeier is the author of numerous books, including a revised edition of Bloodlines of the Illuminati, available at the Infowars Store. The 624-page, large format book is a literal encyclopedia of rare, unbelievable information that exposes the dynasties that make up the global elite. Springmeier has authored more than a dozen other books and has made multiple videos and presentations. \n\nAlex also covers the latest news, including the mysterious decision by Canadian film director and producer James Cameron to buy a large tract of land in a remote area of New Zealand. \n\nOther items covered today include a lawsuit brought against the government in the murder of a Border Patrol agent connected to Operation Fast and Furious and the decision to subject Super Bowl fans to deadly TSA radiation machines.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:5dcc262780feb4e0fed6ef7bee7c4d72ad12685a","amp;dn":"Alex+Jones+Show+-+2012+Feb+02+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dcc262780feb4e0fed6ef7bee7c4d72ad12685a","infoHashBuffer":{"type":"Buffer","data":[93,204,38,39,128,254,180,224,254,214,239,123,238,124,77,114,173,18,104,90]},"announce":[],"urlList":[]}}