{"title":"La Cabina 1972(TVRIP)(SPANISH).","uid":5152849,"size":384593920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5e76250df28e7951e03738ba550e1d3aa8bc079c&amp;dn=La+Cabina+1972%28TVRIP%29%28SPANISH%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":1,"time":1257670858,"description":"La Cabina, EspaÃƒÂ±a, 1970\nGÃƒÂ©nero: Horror\nDirector / Autor: Antonio Mercero\nElenco: JosÃƒÂ© Luis LÃƒÂ³pez VÃƒÂ¡zquez\n\nSinopsis: Un ciudadano comÃƒÂºn y corriente queda atrapado en una cabina telefÃƒÂ³nica. Pese a los intentos de ayuda de los transeuntes, no puede ser liberado.\nPero las cosas pasan a otro nivel cuando los misteriosos operarios que instalaron la cabina esa madrugada se lo llevan con aparato y todo a un destino desconocido. En el trayecto, el prisionero va dÃƒÂ¡ndose cuenta de que estÃƒÂ¡ indefenso en manos de fuerzas siniestras que lo conducen a un inexplicable y atroz destino del cual parece no haber escapatoria... y del que ninguno de nosotros puede considerarse a salvo.\n\nCrÃƒÂ­tica: Excelente cortometraje fantÃƒÂ¡stico y de terror hecho por la TVE y que mereciÃƒÂ³, con toda justicia, elogios dentro y fuera de EspaÃƒÂ±a. El telefilm, de 37 minutos, casi no tiene diÃƒÂ¡logos (solo se escuchan frases sueltas de la multitud), y el personaje principal (JosÃƒÂ© Luis LÃƒÂ³pez VÃƒÂ¡zquez) no solo no tiene nombre ni diÃƒÂ¡logo alguno, sino que se ve como &quot;uno mÃƒÂ¡s del montÃƒÂ³n&quot;, un cuarentÃƒÂ³n que regresaba de dejar a su hijo en el autobÃƒÂºs escolar.\nAcertadamente, el film no da explicaciones de &quot;quiÃƒÂ©nes&quot;, &quot;cÃƒÂ³mo&quot; ni &quot;por quÃƒÂ©&quot; de la tragedia del protagonista. Conforme transcurre la trama, los temores y las interrogantes sin respuesta van aumentando. La creciente desesperaciÃƒÂ³n del ciudadano comÃƒÂºn va haciÃƒÂ©ndose tambiÃƒÂ©n nuestra. No aparece una providencial salvaciÃƒÂ³n o siquiera una explicaciÃƒÂ³n de lo que sucede.\nLo mÃƒÂ¡s chocante es la actitud de la gente a la tragedia ajena. Se interesa, hacen pequeÃƒÂ±os intentos de abrir la indestructible cabina, pero ahÃƒÂ­ queda todo. La mayorÃƒÂ­a lo ve como una curiosidad de la que solo atinan a reÃƒÂ­rse. Curiosamente, los ÃƒÂºnicos que contemplan seriamente al protagonista aprisionado, durante su viaje a lo desconocido, son un payaso y un enano de circo (Ã‚Â¿un homenaje a Fellini?)\nEl protagonista solo halla un triste consuelo cuando, en el trayecto a su destino, ve que no estÃƒÂ¡ solo. Hay otros que, igual que ÃƒÂ©l, estÃƒÂ¡n siendo atrapados por cabinas que tambiÃƒÂ©n esperan a sus inocentes vÃƒÂ­ctimas. Pero incluso este consuelo se convierte en una trÃƒÂ¡gica revelaciÃƒÂ³n en el inesperado y espeluznante final. En medio de una mÃƒÂºsica aterradora, el indefenso prisionero contempla cuÃƒÂ¡l va a ser su espantoso destino.\nPero ÃƒÂ©se no es el final. Los misteriosos operarios que vimos al principio instalan otra cabina idÃƒÂ©ntica en alguna otra calle de EspaÃƒÂ±a (o del mundo)... esperÃƒÂ¡ndonos. Un epÃƒÂ­logo en verdad aterrador.\nA nadie extraÃƒÂ±e que, en los dÃƒÂ­as siguientes a su emisiÃƒÂ³n en la TV espaÃƒÂ±ola, se dieron casos de gente que, al querer hablar por telÃƒÂ©fonos pÃƒÂºblicos, impedÃƒÂ­a con un pie que la puerta de la cabina que ocupaba se cerrase. Una muestra mÃƒÂ¡s de la terrorÃƒÂ­fica verosimilitud de LA CABINA.","torrent":{"xt":"urn:btih:5e76250df28e7951e03738ba550e1d3aa8bc079c","amp;dn":"La+Cabina+1972%28TVRIP%29%28SPANISH%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e76250df28e7951e03738ba550e1d3aa8bc079c","infoHashBuffer":{"type":"Buffer","data":[94,118,37,13,242,142,121,81,224,55,56,186,85,14,29,58,168,188,7,156]},"announce":[],"urlList":[]}}