{"title":"The Yellow Emperor's Cure - Kunal Basu","uid":11684694,"size":1144417,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ea44a497d329621d54d8308c3eb8e54c3bef000&amp;dn=The+Yellow+Emperor%27s+Cure+-+Kunal+Basu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1423271117,"description":"In a breakout novel that transports the reader to a brilliantly imagined, sensuously portrayed, dangerous point in history, Kunal Basu has written the tale of a man's journey that spans continents- -and the limits of his faith in science. Lisbon, 1898: Antonio Maria, surgeon and notorious playboy, returns home after a long absence to learn his beloved father has syphilis, the scourge of both rich and poor. Determined to find a cure, Antonio sets sail for Peking, to study under the evasive but renowned Dr. Xu. But Dr. Xu does not intend to give away his knowledge, and Antonio suddenly falls in love with his assistant, the elusive Fumi. The threat of the advancing Boxer rebellion hangs over the Summer Palace, and Antonio and Fumi must decide whether to flee together or remain in China.\n\nKunal Basu's lush, haunting tale invites comparisons to Michael Ondaatje's best work. This superb novel conjures a man discovering the love that will force him to question everything.\n\nReview\n\nPraise for the work of Kunal Basu &quot;Imaginative . . . like strolling through an art gallery for sheer visual power.&quot;--*Elle *\n\n&quot;A rich tale of artistic and erotic obsession.&quot; --Time Out\n\n&quot;Richly painted literary novel . . . A deeply satisfying tale mixing history, cultural clashes, violence and love. Fortunately, it's the readers who win.&quot; --Kirkus\n\n&quot;A wonderful and compellingly visual novel, whose world is as completely realized as anything by Robert Graves, Amitav Ghosh or Barry Unsworth.&quot; --William Dalrymple, author of From the Holy Mountain\n\nBasu interweaves strands of romance, medicine, and history into a fascinating cross-cultural tapestry...Conjuring up an exotic time and place, Basu provides a passport into a vanished world.&quot; -- Booklist\n\n&quot;Basu keeps us intrigued by his hero and by the exotic world that creates and destroys him.&quot; --Sunday Times (London)","torrent":{"xt":"urn:btih:5ea44a497d329621d54d8308c3eb8e54c3bef000","amp;dn":"The+Yellow+Emperor%27s+Cure+-+Kunal+Basu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ea44a497d329621d54d8308c3eb8e54c3bef000","infoHashBuffer":{"type":"Buffer","data":[94,164,74,73,125,50,150,33,213,77,131,8,195,235,142,84,195,190,240,0]},"announce":[],"urlList":[]}}