{"title":"Bobaflex - BadMan Single","uid":8704852,"size":2084752,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5ee4a5052c125a96d2a6c62aa8c12fa79d928f04&amp;dn=Bobaflex+-+BadMan+Single&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wittydick","files":1,"time":1374123362,"description":"This file was downloaded straight from the Bobaflex website at http://theofficialbobaflex.com.\n\nThe file was referenced in the source code that drives the little MP3 jukebox at the bottom of the screen.\n\nThis is the current single they are trying to promote (aka, sell).\n\n\nI pointed out the error of giving people plaintext urls to their webmaster who promptly acted like a total dick to me.\n\nSince ANYONE who goes to their site already has this file in their cache, they're literally giving this song away for free while trying to sell it.  Additionally, it is my belief that anything you've given away for free without a terms of service agreement attached is legally redistributable.  If there is a terms of service agreement attached to this file, it is completely unenforceable as you can simply claim that you went to their site prior to 10:30 PM Eastern Time on July 17th, 2013.\n\nIn short, if you download this, it is my belief that this song is NOT being pirated by you and was not being pirated by me, as they are giving it away without realizing it due to EXTREMELY POOR SITE DESIGN.\n\nIt is in that spirit that I say enjoy this song for free despite the fact that Bobaflex wishes to sell it and has merely chosen a HORRIBLE WEBMASTER WHO ACTS LIKE A TOTAL DICK TO PEOPLE.","torrent":{"xt":"urn:btih:5ee4a5052c125a96d2a6c62aa8c12fa79d928f04","amp;dn":"Bobaflex+-+BadMan+Single","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ee4a5052c125a96d2a6c62aa8c12fa79d928f04","infoHashBuffer":{"type":"Buffer","data":[94,228,165,5,44,18,90,150,210,166,198,42,168,193,47,167,157,146,143,4]},"announce":[],"urlList":[]}}