{"title":"Anal.Required.XXX.DVDRip","uid":8957782,"size":1870031565,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:60ba29d34b11a8502fdfb2acfb6a3e7f315e4b5c&amp;dn=Anal.Required.XXX.DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1380036491,"description":"Category Anal\n\n Director Mark Wood, Francesca Le\n Starring Sheena Shaw, Jessie Volt, Bonnie Rotten, Asphyxia Noir, Mark Wood, Will Powers, Chris Strokes, Savannah Fox\n\n Savannah Fox First Ever D.P. &amp; Double VAG!\n\n There's No Getting Around The Anal It's Required!\n\n The newest batch of hard-core vignettes from LeWood Productions is loaded with lewd, rude sodomy and filthy face fucking. 'Anal Required' is the name of this two-disc movie, and its also Rule Number One for the sultry starlets gathered by LeWood directors Mark Wood and Francesca Le. Exotic, young Bonnie Rotten is hooking up through a dating service. The taut, tattooed temptress grinds on Mark's lap, removing her business suit and gagging on his massive member before taking a serious backdoor reaming. Next, Mark convinces gorgeous, blonde girlfriend Jessie Volt to call in late to work. A rough anal pounding leaves Jessie's butthole gaping; she eagerly swallows a hot load of sperm!\n\n Slender, athletic, hard-bodied Sheena Shaw does her afternoon workout for Will Powers' benefit, and it isn't long before he's thrusting his tongue into her tender anal sphincter. Sheena receives a ferocious ass-fuck and a messy cum facial. When Goth beauty Asphyxia Noir finally agrees to try backdoor sex, she goes all the way. The luscious punk princess buzzes her clit with a vibrator while stretching her tight anus around Mark's meat. And fleshy, foxy redhead Savannah Fox seduces her male housemates with some slobbery blow job fun that graduates to her first-ever double-penetration and double-vaginal fuck! 'Anal Required; contains 26 minutes of sensuous tease footage; 34 minutes of revealing behind-the-scenes interviews; and a raunchy, full-length bonus butt-fuck with Mark sodomizing plushly proportioned Phoenix Marie. You might ask, is all this nasty butt sex truly necessary? Yes - it's required!\n\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=48614357729357096690.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=48614357729357096690.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=55482255659035756471.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=55482255659035756471.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:60ba29d34b11a8502fdfb2acfb6a3e7f315e4b5c","amp;dn":"Anal.Required.XXX.DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60ba29d34b11a8502fdfb2acfb6a3e7f315e4b5c","infoHashBuffer":{"type":"Buffer","data":[96,186,41,211,75,17,168,80,47,223,178,172,251,106,62,127,49,94,75,92]},"announce":[],"urlList":[]}}