{"title":"The King Of Fighters XIII","uid":6476884,"size":1397132097,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:60d9ab1dfc4cf87fb0f14a702fd2a0354812ef38&amp;dn=The+King+Of+Fighters+XIII&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jorgeolla","files":1,"time":1308340264,"description":"Este es mi primer torrent :)\nThe King of Fighters XIII (KOF XIII) es un videojuego desarrollado por SNK Playmore para la placa Taito Type X2 y es el tÃƒÂ­tulo de la decimotercera entrega de la saga The King of Fighters. Saldra a la venta el 25 de octubre de 2011 para PS3 Y XBOX 360\nSe ha confirmado que primero habrÃƒÂ¡ una nueva versiÃƒÂ³n de Kof XIII conocida como la ver 1.1 ya que la compaÃƒÂ±ÃƒÂ­a de SNK Playmore se ha dado cuenta que la versiÃƒÂ³n final del juego Arcade llega a contener muchos bugs tales como los famosos combos infinitos, en esta nueva versiÃƒÂ³n han dicho que estos errores se han corregido.\n\nHistoria\n\nDespuÃƒÂ©s de atravesar el cuerpo de Magaki con su lanza, se pierde el rastro de Shion a travÃƒÂ©s de la grieta dimensional.\nAdemÃƒÂ¡s, como para ridiculizar la investigaciÃƒÂ³n dirigida por las fuerzas de Heidern, aparecieron para recuperar el cadÃƒÂ¡ver de Magaki, aquellos que se denominan &quot;Los de la tierra lejana&quot; (Heraldos de Orochi). Continuamente persiguiendo los rastros del poder de Orochi.\nMientras tanto, Iori Yagami cae frente a Ash Crimson, Elisabeth Branctorche le planta cara, dando a entender que ambos fueron colegas en un pasado.\nDespuÃƒÂ©s de el de Kagura, el poder de Iori Yagami es absorbido por Ash Crimson. Yata fue superada, Yasanaki (las llamas de Iori) fueron apagadas. De los tres tesoros sagrados, sÃƒÂ³lo queda Kusanagi. Sin embargo, en aquel momento Orochi se poseciono de Iori Yagami, y Kyo Kusanagi fue herido gravemente.\nEn la actualidad:\nTras sufrir estos graves accidentes, la preocupaciÃƒÂ³n se cierne en torno a KOF. Incluso asÃƒÂ­, la cuestiÃƒÂ³n es quiÃƒÂ©n es el mÃƒÂ¡s fuerte... Un KOF a una escala sin precedentes ha comenzado a ser escrito. Con medio mundo como escenario, una competiciÃƒÂ³n imprescindiblemente grande de diferentes estilos de lucha. Nunca antes se habÃƒÂ­a visto un evento similar. Y aquellos que posean las habilidades necesarias reciben una invitaciÃƒÂ³n escrita.\nEl remitente es.....\n\nDisfruten!!","torrent":{"xt":"urn:btih:60d9ab1dfc4cf87fb0f14a702fd2a0354812ef38","amp;dn":"The+King+Of+Fighters+XIII","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60d9ab1dfc4cf87fb0f14a702fd2a0354812ef38","infoHashBuffer":{"type":"Buffer","data":[96,217,171,29,252,76,248,127,176,241,74,112,47,210,160,53,72,18,239,56]},"announce":[],"urlList":[]}}