{"title":"Second World War In HD &amp; Color (2010) PAL 6xDVD5 Eng-NL-DMT","uid":5915216,"size":27631163534,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:629b7fa4835c0b4caa187189b9f78c2f648485a6&amp;dn=Second+World+War+In+HD+%26+Color+%282010%29+PAL+6xDVD5+Eng-NL-DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NLUPPER002","files":-1,"time":1288196982,"description":"Second World War In HD &amp; Color (2010) PAL 6xDVD5 Eng-NL-DMT\n\nTweede Wereldoorlog In HD &amp; Kleur (2010) PAL 6 DvD's\n\nRelease Info:   &lt;a href=&quot; http://www.bol.com/nl/p/dvd/wo-2-in-hd-kleur/1002004007954570/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.bol.com/nl/p/dvd/wo-2-in-hd-kleur/1002004007954570/index.html&lt;/a&gt;\n\n[IMG]http://img143.imageshack.us/img143/7979/boxxp.jpg[/IMG]\n\nSpeelduur 780:00 minuten\n\nDISC 1: De Opkomst van de Dictators begint met een paradox.\nDISC 2: De Britten Houden Stand tegen de nazi's.\nDISC 3: Japan Valt Aan op 7 december 1941.\nDISC 4: De Zoektocht Naar De Beslissende Klap om de oorlog tot een einde te brengen.\nDISC 5: D-Day kan gezien worden als iets onvermijdelijks.\nDISC 6: Overwinning In Europa wordt gekenmerkt door de laatste stuiptrekkingen van het nazirijk.\n\nErvaar de Tweede Wereldoorlog als nooit tevoren met dit gloednieuwe historische overzicht in high definition en kleur!\nMet de modernste technieken en nieuwe onthullingen biedt WO2 in HD &amp; Kleur letterlijk en figuurlijk een nieuwe blik op de Tweede Wereldoorlog.\nEen van beste verzamelingen van zeldzaam en nooit eerder gezien beeldmateriaal van WOII werd volledig gerestaureerd voor optimale beeld- en geluidskwaliteit.\nMet behulp van satellieten werden de terreinen van slagvelden gedetailleerd in kaart gebracht.\nDe nieuwste computertechnieken stonden garant voor nauwgezette reconstructies.\nDe samenstellers van WO2 in HD &amp; Kleur hadden de beschikking over technieken die eerdere documentaireseries over de oorlog niet hadden.\nNiet alleen de nieuwste technieken maken van WO2 in HD &amp; Kleur een must have.\nOok inhoudelijk gaat deze reeks verder dan eerdere documentaireseries.\nDe afgelopen jaren is onze blik op de oorlog drastisch veranderd door nieuw vrijgegeven documenten en foto's.\nOnthullingen over het breken van geheime codes en vrijgegeven overheidsdocumenten hebben een nieuwe dimensie\ntoegevoegd aan het begrip van het grootste militaire conflict dat de wereld ooit gekend heeft.\n\nMet WO2 in HD &amp; Kleur heeft u de mogelijkheid om WOII te bekijken in zijn volledige omvang.\n\nLength 780:00 minutes\n\nDISC 1: The Rise of Dictators begins with a paradox.\nDISC 2: The British Do Stand against the Nazis.\nDISC 3: Japan attacks on December 7, 1941.\nDISC 4: The Quest for the final blow for the war to a conclusion.\nDISC 5: D-Day may be seen as something inevitable.\nDISC 6: Victory in Europe is characterized by the death throes of the Nazi empire.\n\nExperience WWII like never before with this brand new historical overview in high definition and color!\nWith the latest technology and offers new revelations WW2 in Color &amp; HD literally and figuratively a new look at World War II.\nOne of the best collections of rare and unseen footage of WWII was fully restored for optimum picture and sound quality.\nUsing satellites were the sites of battlefields mapped out in detail.\nThe latest computer techniques were guaranteed accurate reconstructions.\nThe compilers of WW2 in Color &amp; HD had access to techniques that earlier documentary series on the war had not.\nNot only the latest techniques of WW2 in HD &amp; Color a must have.\nContent also goes further than this series earlier documentary series.\nIn recent years our view of the war dramatically altered by newly released documents and photographs.\nRevelations about the breaking of codes and secret government documents have released a new dimension\nadded to the understanding of the greatest military conflict the world has ever known.\n\nWith HD &amp; WW2 in Color World War II, you have the option to view its full size.\n\nDVD INFO\n\nAspect: 16:9 16:9 Anamorphic\nAudio: English - Dutch 5.1DD\nSubs: Dutch\nVideo: Untouched\n\nThanks To:  Twilightzone-Team\n\nEnjoy\n","torrent":{"xt":"urn:btih:629b7fa4835c0b4caa187189b9f78c2f648485a6","amp;dn":"Second+World+War+In+HD+%26+Color+%282010%29+PAL+6xDVD5+Eng-NL-DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"629b7fa4835c0b4caa187189b9f78c2f648485a6","infoHashBuffer":{"type":"Buffer","data":[98,155,127,164,131,92,11,76,170,24,113,137,185,247,140,47,100,132,133,166]},"announce":[],"urlList":[]}}