{"title":"Anne Rice - Prince Lestat (The Vampire Chronicles #13)","uid":12555601,"size":272054742,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6351fc6bcff58af9d9bc6d6256ea54727a57be91&amp;dn=Anne+Rice+-+Prince+Lestat+%28The+Vampire+Chronicles+%2313%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Cybotage","files":1,"time":1444625706,"description":"The vampire world is in crisis – their kind have been proliferating out of control and, thanks to technologies undreamed of in previous centuries, they can communicate as never before. Roused from their earth-bound slumber, ancient ones are in thrall to the Voice: which commands that they burn fledgling vampires in cities from Paris to Mumbai, Hong Kong to Kyoto and San Francisco. Immolation, huge massacres, have commenced all over the world.\r\n\r\nWho – or what – is the Voice? What does it desire, and why?\r\n\r\nThere is only one vampire, only one blood drinker, truly known to the entire world of the Undead. Will the dazzling hero-wanderer, the dangerous rebel-outlaw Lestat heed the call to unite the Children of Darkness as they face this new twilight?\r\n\r\nAnne Rice’s epic, luxuriant, fiercely ambitious new novel brings together all the worlds and beings of the legendary Vampire Chronicles, from present-day New York and Ancient Egypt to fourth-century Carthage and Renaissance Venice; from Louis de Pointe du Lac; Armand the eternally young; Mekare and Maharet; to Pandora and Flavius; David Talbot, vampire and ultimate fixer from the Secret Talamasca; and Marius, the true child of the Millennia. It also introduces many other seductive supernatural creatures, and heralds significant new blood","torrent":{"xt":"urn:btih:6351fc6bcff58af9d9bc6d6256ea54727a57be91","amp;dn":"Anne+Rice+-+Prince+Lestat+%28The+Vampire+Chronicles+%2313%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6351fc6bcff58af9d9bc6d6256ea54727a57be91","infoHashBuffer":{"type":"Buffer","data":[99,81,252,107,207,245,138,249,217,188,109,98,86,234,84,114,122,87,190,145]},"announce":[],"urlList":[]}}