{"title":"Joanne Shaw Taylor - Diamonds in the Dirt 2010 (flac)","uid":6438485,"size":319684927,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:63a72461710358f8e21fa2e0c1db59bf3ef8360d&amp;dn=Joanne+Shaw+Taylor+-+Diamonds+in+the+Dirt+2010+%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1306879047,"description":"Certainly she can peel off blazing solos like Stevie Ray Vaughan (whose producer Jim Gaines is again on hand here) and can also conjure up the more gentle blues-soul of Hendrix (World on Fire). And there is an earthiness here, even when she puts her foot to the floor and starts whipping out an incendiary guitar wail (Let It Burn takes a slice of pure SRV).\nBut at other times, notably on the slow burning numbers (Same As It Never Was), she reveals a more soulful voice which has her edging towards Etta James or Janis Joplin in her more reflective moments.\n\nThis is her second album and even beforehand she was picking up awards and acknowledgement in Britain, which hasn't really been a home for this kind of tough urban blues, which may explain why on the cover she's seated before a sign which reads Detroit and the album was recorded in Tennessee. She now lives in Detroit and the States seems her natural home.\n\nShe definitely satisfies the demands of the blues festival stage circuit (the Seventies-rock sound of Who Do You Love), but here the more reflective material like the title track (which Bonnie Raitt could comfortably cover) and The World And Its Way shows there is much more to her than what that blues description might mean to some.\nThis is impressive and the fact she does this with just a bassist and drummer means she must be of great appeal to promoters. Let's hope we see her live some time soon, she sounds unmissable.  (Graham Reid)\n\nI have played with all sorts of blues musicians all over the world, I even made a film Deep Blues where I went to Mississippi and recorded some legendary players such as R.L Burnside and Jesse Mae Hemphill. Last year I heard something I thought I would never hear. A British White Girl playing blues guitar so deep and passionately it made the hairs on the back of my neck stand on end!   \n(Dave Stewart-Eurythmics)\n\n\n\nJoanne Shaw Taylor (vocals, guitar) \nRick Steff (keyboards)\nSteve Potts (drums)\n\n 1. Can't Keep Living Like This\n 2. Dead And Gone\n 3. Same As It Never Was\n 4. Jump That Train\n 5. Who Do You Love\n 6. Diamonds In The Dirt\n 7. Let It Burn\n 8. World On Fire\n 9. Lord Have Mercy\n10. The World And It's Way\n","torrent":{"xt":"urn:btih:63a72461710358f8e21fa2e0c1db59bf3ef8360d","amp;dn":"Joanne+Shaw+Taylor+-+Diamonds+in+the+Dirt+2010+%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63a72461710358f8e21fa2e0c1db59bf3ef8360d","infoHashBuffer":{"type":"Buffer","data":[99,167,36,97,113,3,88,248,226,31,162,224,193,219,89,191,62,248,54,13]},"announce":[],"urlList":[]}}