{"title":"Jonathan Stroud - Heroes of the Valley","uid":4975704,"size":387915602,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:63d1a7f68e2b20045be8862772c881ce1860a653&amp;dn=Jonathan+Stroud+-+Heroes+of+the+Valley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shemyaza","files":16,"time":1245985881,"description":"Jonathan Stroud - Heroes of the Valley\n\nHalli Sveinsson has grown up in the House of Svein, listening to the legends of the heroes as all his forefathers did. His is a peaceful society where the violence of the past has been outlawed and disputes are settled by the Council.\n\nBut young Halli has never quite seemed to fit in with the others. For starters, he was not at all handsome or tall, like his attractive blond siblings. He's stumpy and swarthy, with a quick mind and aptitude for getting in trouble. Bored with the everyday chores and sheep herding, he can't help himself from playing practical jokes on everyone, from Eyjolf the old servant, to his brother and sister. But when he plays a trick on Ragnor of the House of Hakonsson, he goes too far, setting in motion a chain of events that will forever alter his destiny. Because of it, Halli will have to leave home and go on a hero's quest. Along the way, he will encounter highway robbers, terrifying monsters, and a girl who may finally be his match. In the end, he will discover the truth about the legends, his family, and himself.\n\nJonathan Stroud's new novel is a hero's saga and coming-of-age--as well as a surprising look at what bravery really means.","torrent":{"xt":"urn:btih:63d1a7f68e2b20045be8862772c881ce1860a653","amp;dn":"Jonathan+Stroud+-+Heroes+of+the+Valley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63d1a7f68e2b20045be8862772c881ce1860a653","infoHashBuffer":{"type":"Buffer","data":[99,209,167,246,142,43,32,4,91,232,134,39,114,200,129,206,24,96,166,83]},"announce":[],"urlList":[]}}