{"title":"Anders Parker...Anders Parker(2006)[FLAC]","uid":7115857,"size":313941839,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:64958f36d0de15536989570222f69960d88999d6&amp;dn=Anders+Parker...Anders+Parker%282006%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":17,"time":1332212784,"description":" &lt;a href=&quot;http://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://dickthespic.org/&lt;/a&gt;\n\n01. Circle Same (5:03)\n02. Missing (3:43)\n03. Oh, Monkeywrench (3:31)\n04. Dear Sara (5:50)\n05. Airport Road (3:36)\n06. Under Wide Unbroken Skies (3:43)\n07. False Positive (4:15)\n08. Belated (3:49)\n09. Proof (3:17)\n10. Pajarito (4:32)\n11. Winter Coat (4:00)\n12. Pink Clouds (3:04)\n\nAfter briefly teaming with occasional collaborator and tour mate Jay Farrar for an album as Gob Iron, Anders Parker steps back into solo mode with this self-titled album, his second since retiring the group name Varnaline. After digging deep into rootsy ground with Gob Iron, Anders Parker finds the singer and songwriter venturing into gentler and more laid-back surroundings; while the melodic sensibilities of these songs are consistent with much of Parker's previous work, the production and arrangements often recall the Golden Age of country-rock and Laurel Canyon singer/songwriters, especially Mark Spencer's sweetly mournful pedal steel guitar and Ken Coomer's drumming, which is reminiscent of Russ Kunkel's mid-'70s work with James Taylor and Jackson Browne. The smooth surfaces and excellent craft of Anders Parker makes for a strange and subtle contrast with the somber lyrical mood of songs like &quot;Oh, Monkeywrench,&quot; &quot;Dear Sara&quot; and &quot;False Positive&quot; (a notion that seems to follow all the way through to the cover artwork, with it's photos of L.A. palm trees and musicians around the pool), but the album makes the most of the ironies, and both the songs and Parker's delivery rank with his best work on record. Imagine an Asylum Records-approved Mellow Mafia guy who traded in his smugness for a lingering introspective depression and you get an idea of what the album Anders Parker is about, and it's no small praise to say Parker was not only able to visualize such a concept, but make it work on tape with a commendable degree of heart and soul.","torrent":{"xt":"urn:btih:64958f36d0de15536989570222f69960d88999d6","amp;dn":"Anders+Parker...Anders+Parker%282006%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64958f36d0de15536989570222f69960d88999d6","infoHashBuffer":{"type":"Buffer","data":[100,149,143,54,208,222,21,83,105,137,87,2,34,246,153,96,216,137,153,214]},"announce":[],"urlList":[]}}