{"title":"Jeannie Fitzsimmons Virginia Lloyd - Mastering Your Emotions MP3","uid":12046931,"size":654048438,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:663f4ea72cb109b4d3b28341338a0d6d5dacb15f&amp;dn=Jeannie+Fitzsimmons+Virginia+Lloyd+-+Mastering+Your+Emotions+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"elessedilgirl","files":38,"time":1434918469,"description":"The intention of this Mastering Your Emotions course is to provide information about emotions, which we hope will provide greater insight into your own personal nature. This information was developed by Virginia Lloyd over many years of creating and leading seminars for Sedona Institute.\n\nThese seminars present a specific technique to enable you to let go of stressful feelings and are currently being offered exclusively as Core Work by Heart Wisdom Releasing Seminars.\n\nIt is based upon the book Master Your Emotions by Virginia Lloyd. We know that it will teach you, show you, give you direct experience, and guide you into a happier life if you apply what you learn here.\n\nThis very focused interactive course is a gentle, easy-to-listen to 7 hours of wisdom and insight about your emotions and her AGFLAPCAP chart. After all of these years, many still consider this Chart of Emotions to be the 'cornerstone' of all of the releasing work taught around the world today.\n\nAGFLAP-CAP stands for (apathy, grief, lust, anger, pride, courageousness, acceptance and peace) used when she developed the Sedona Institute Basic and Advanced Courses while co-founder for 17 years, with Lester Levenson, of Sedona Institute.\n\nVirginia was the former Director of Training for the Sedona Institute founded by Lester Levenson. Her exquisite design and development of what has become a popular releasing method, came, due to her deep understanding of emotions, feelings, and her inspired faith in Lester. During her 17 years with the Sedona Institute, she trained all of the instructors and taught with the very first corporations exposed to this work.\n\nMP3 - 128 kbps - CBR\n\nAlso includes some short audios (various bit rates)\n\nThanks to original uploader","torrent":{"xt":"urn:btih:663f4ea72cb109b4d3b28341338a0d6d5dacb15f","amp;dn":"Jeannie+Fitzsimmons+Virginia+Lloyd+-+Mastering+Your+Emotions+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"663f4ea72cb109b4d3b28341338a0d6d5dacb15f","infoHashBuffer":{"type":"Buffer","data":[102,63,78,167,44,177,9,180,211,178,131,65,51,138,13,109,93,172,177,95]},"announce":[],"urlList":[]}}