{"title":"That's Entertainment! III (1994) 1080p","uid":9221464,"size":7638231975,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:66dd9395e99a580cf71f4aaab87a37cd23e71b1b&amp;dn=That%27s+Entertainment%21+III+%281994%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tantrick","files":1,"time":1384945615,"description":"That's Entertainment! III (1994) is a documentary film released by Metro-Goldwyn-Mayer to celebrate the studio's 70th anniversary. It was the third in a series of retrospectives that began with the first That's Entertainment! (1974) and That's Entertainment, Part II (1976). Although posters and home video versions use the title without an exclamation mark, the actual on-screen title of the film uses it.\nIn order to provide a &quot;hook&quot; for audiences who by 1994 had become accustomed to viewing classic movies on home video and cable TV (luxuries not widely available when the first two That's Entertainment! films were released), the producers decided to feature film footage cut from famous MGM musicals. Many of these numbers were shown for the first time in That's Entertainment! III.\nHighlights include:\nAn alternate version of Eleanor Powell's extended tap dance routine to &quot;Fascinating Rhythm&quot; from Lady Be Good, shot from a second camera that revealed the well-orchestrated, behind the cameras activity needed to keep the scene moving smoothly.\n&quot;Ain't it the Truth&quot;, a Lena Horne performance from Cabin in the Sky which was cut (Horne suggests it was censored) before the film's release because Horne sang the song in a bubble bath.\nSeveral previously unseen Judy Garland production numbers, including &quot;Mr. Monotony&quot;, cut from Easter Parade because it was deemed too risque for the period of the film (the half-tuxedo outfit Garland wears in this number is the same as the one she'd wear in the &quot;Get Happy&quot; number from Summer Stock three years later); an extravagant musical number, &quot;March of the Doagies&quot;, cut from The Harvey Girls; and two numbers filmed for Annie Get Your Gun (&quot;I'm an Indian Too&quot; and &quot;Doin' What Comes Natur'lly&quot;) before Garland was replaced by Betty Hutton. Garland then made Summer Stock, her last film for MGM in 1950. The original theatrical release omits &quot;Doin' What Comes Naturally&quot; but it is included on the home video version.\nFootage from an abandoned 1930 musical called The March of Time, in particular a sequence called &quot;The Lock Step&quot; featuring The Dodge Twins which strongly resembles the later title musical sequence from the 1957 Elvis Presley film Jailhouse Rock (also featured in That's Entertainment! III).\nDebbie Reynolds singing &quot;You Are My Lucky Star&quot; in a sequence cut from Singin' in the Rain.\nAva Gardner's unused vocal performance of &quot;Can't Help Lovin' Dat Man&quot; for Show Boat before she was dubbed by vocalist Annette Warren.\nThe opening dance sequence from The Barkleys of Broadway with the credits overlay removed so that the dance routine by Fred Astaire and Ginger Rogers can be viewed unobstructed for the first time.\nAn alternate performance of &quot;I Wanna Be a Dancin' Man&quot; by Astaire from the film The Belle of New York. In the alternate take, Astaire wears informal clothes; the studio requested the number be reshot in formal dress. In the film, both performances are shown side-by-side to demonstrate the thoroughness of Astaire's rehearsal process since both performances are virtually identical.\nAn unused performance of &quot;Two-Faced Woman&quot; lip-synched by Cyd Charisse from The Band Wagon, presented side-by-side with a performance from the film Torch Song using the same vocal track but now lip-synched by Joan Crawford.\nAn alternate version of &quot;A Lady Loves&quot; performed by Debbie Reynolds in I Love Melvin, intercut with the version used in the film (the cut version is set in a farmyard while the version used takes place in opulent surroundings).\nA contortionist performance from the film Broadway Rhythm, featuring the Ross Sisters.\nHosts for the third installment in the That's Entertainment! series were Gene Kelly (in his final appearance on film before his death in 1996), June Allyson, Cyd Charisse, Lena Horne, Howard Keel, Ann Miller, Debbie Reynolds, Mickey Rooney, and Esther Williams, making her first appearance in a theatrical film in more than 30 years. That's Entertainment! III had a limited theatrical release in 1994. According to columnist Robert Osborne, writing for The Hollywood Reporter at the time, the film did &quot;pleasant business&quot; at New York's Ziegfeld Theatre.\nAll three films were released to DVD in 2004. The box set collection of the films included a bonus DVD that included additional musical numbers that had been cut from MGM films as well as the first release of the complete performance of &quot;Mr. Monotony&quot; by Judy Garland (the version used in That's Entertainment! III is truncated). The home video version of That's Entertainment! III also contains several musical numbers not in the theatrical release. The film was later remastered for high-definition release on Blu-ray.32","torrent":{"xt":"urn:btih:66dd9395e99a580cf71f4aaab87a37cd23e71b1b","amp;dn":"That%27s+Entertainment%21+III+%281994%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66dd9395e99a580cf71f4aaab87a37cd23e71b1b","infoHashBuffer":{"type":"Buffer","data":[102,221,147,149,233,154,88,12,247,31,74,170,184,122,55,205,35,231,27,27]},"announce":[],"urlList":[]}}