{"title":"Internet Download Manager 6.21 Build 5 [REiS][JUHAX69X]","uid":10824536,"size":9215567,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:67356e374c2f2dc6018b6fa79146c3fb045675d7&amp;dn=Internet+Download+Manager+6.21+Build+5+%5BREiS%5D%5BJUHAX69X%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUHAX69X","files":-1,"time":1408569262,"description":"Internet Download Manager 6.21 Build 5 [REiS][JUHAX69X]\n  \n \nInternet Download Manager (IDM) is a tool to increase download speeds by up to 5 times,\nresume and schedule downloads. Comprehensive error recovery and resume capability will\nrestart broken or interrupted downloads due to lost connections, network problems,\ncomputer shutdowns, or unexpected power outages. Simple graphic user interface makes\nIDM user friendly and easy to use.Internet Download Manager has a smart download logic\naccelerator that features intelligent dynamic file segmentation and safe multipart\ndownloading technology to accelerate your downloads. Unlike other download managers\nand accelerators Internet Download Manager segments downloaded files dynamically during\ndownload process and reuses available connections without additional connect and login\nstages to achieve best acceleration performance.\n\nInternet Download Manager supports proxy servers, ftp and http protocols, firewalls,\nredirects, cookies, authorization, MP3 audio and MPEG video content processing. IDM\nintegrates seamlessly into Microsoft Internet Explorer, Netscape, MSN Explorer, AOL, Opera,\nMozilla, Mozilla Firefox, Mozilla Firebird, Avant Browser, MyIE2, and all other popular\nbrowsers to automatically handle your downloads. You can also drag and drop files, or use\nInternet Download Manager from command line. Internet Download Manager can dial your\nmodem at the set time, download the files you want, then hang up or even shut down your\ncomputer when it's done.\n\nOther features include multilingual support, zip preview, download categories, scheduler\npro, sounds on different events, HTTPS support, queue processor, html help and tutorial,\nenhanced virus protection on download completion, progressive downloading with quotas\n(useful for connections that use some kind of fair access policy or FAP like Direcway, Direct\nPC, Hughes, etc.), built-in download accelerator, and many others.\n \n \n \nVersion 6.21 adds Windows 8.1 compatibility, adds IDM download panel for web-players\nthat can be used to download flash videos from sites like MySpaceTV, and others. It also\nfeatures complete Windows 7 and Vista support, video page grabber, redeveloped scheduler,\nand MMS protocol support. The new version also adds improved integration for IE 11 and IE\nbased browsers, redesigned and enhanced download engine, the unique advanced integration\ninto all latest browsers, improved toolbar, and a wealth of other improvements and new features.\n \n \nWhat's new in version 6.21 Build 5 (Released: Aug 20, 2014):\n \n-Added a feature to select a group of files in main IDM list and change their storage folder\n-Fixed several problems with erroneous interceptions of videos\n-Improved the logic of &quot;Download this video&quot; panel\n-Fixed bugs\n \nHomepage: internetdownloadmanager[dot]com\n \n \nMy IDM upload includes TEAM REiS Patch. Propably the easiest patch to use.\n \nBeacuse itÂ´s a &quot;Hack Tool&quot;, exclude it from Your Antivirus. Read also the &quot;Read Me&quot; txt.\n \nCheck My &quot;Simple IDM Guide&quot;. ThereÂ´s a crystal clear pictures, of My own installation.\n \n \nIf You like this upload, please share it with others by seeding. Thank You.","torrent":{"xt":"urn:btih:67356e374c2f2dc6018b6fa79146c3fb045675d7","amp;dn":"Internet+Download+Manager+6.21+Build+5+%5BREiS%5D%5BJUHAX69X%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67356e374c2f2dc6018b6fa79146c3fb045675d7","infoHashBuffer":{"type":"Buffer","data":[103,53,110,55,76,47,45,198,1,139,111,167,145,70,195,251,4,86,117,215]},"announce":[],"urlList":[]}}