{"title":"30 Seconds To Mars - Kings &amp; Queens  (Xvid-2nafish)","uid":5231960,"size":108953842,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:673f90cab48b88e15e7822586687fb28a97bc5b5&amp;dn=30+Seconds+To+Mars+-+Kings+%26+Queens++%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":1,"time":1261365917,"description":"Source: TV\n\nFile Info:\n\nValid : Yes [AVI]\nDuration : 00:06:17\n\n[Video]\nResolution : 720x540\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 770 Kbps\nQuality Factor : 0.07 b/px\n\n[Audio]\nCodec : Microsoft PCM Format\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 1536 Kbps\n\n\n\nThis video has no logo.\n\n&quot;Kings and Queens&quot; is a song by American rock band 30 Seconds to Mars. The song is released as the first single from their third album, This Is War, the promotional single was released to American radio on October 6, 2009, the physical single was released on October 13, 2009.\n\nThe music video for &quot;Kings and Queens&quot; was directed by Jared Leto with the pseudonym of Bartholomew Cubbins and premiered at The Montalban Theater in Los Angeles on Monday, November 9, 2009. It had two main themes: One featuring cyclists, Jared, Shannon and Tomo among them, riding in downtown Los Angeles. To shoot this part of the video, parts of the city were closed off, including the Santa Monica Pier. The other part of the video simply features the band playing on a cliff edge of some sort that overlooks the city. These two themes alternate between each other during the course of the video. Jared Leto has been quoted saying that the video was &quot;basically a love letter to Los Angeles.&quot;\n\n&quot;Stranger in a Strange Land&quot; is played during the credits for the full music video.\n\nThe video makes reference to other artists, notably Banksy and his man throwing flowers.\n\nOn the week ending October 31, 2009, &quot;Kings and Queens&quot; debuted on the Billboard Hot 100 at #88. It has since re-entered the chart at #94 and re-peaked at #82. On the Alternative Songs chart, the song rose to the Top 5 only four weeks after its debut, so far peaking at #3.\n\nOpening with a wild hawk scream recorded live over the band's work space in Los Angeles, the song includes a heavy contribution from the band's fans, captured singing a chorus created from layers of the band's Summit recordings. Jared said the title and theme were inspired by a book found at the band's South African work space, but that it &quot;ended up being a good metaphor&quot; for world events from the past year.\n\nWhile doing an exclusive track by track album preview, Jared had this to say about the song &quot;In many ways, a cornerstone for this record. Half of (Kings and Queens) was written in America and the other half was written in South Africa, which has proved to be a very lucky and magical place for the band. I wrote the first verse just as I was headed out the door for South Africa, and the minute I touched down I finished the rest of it. I took that as a good omen. Musically, it was a bit of a beast in that it was originally eight minutes long, so we had to do some trimming. I decided to change the chord structure of the bridge and just let the pieces fall where they may. Steve Lillywhite really helped out with that, figuring out what made sense.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:673f90cab48b88e15e7822586687fb28a97bc5b5","amp;dn":"30+Seconds+To+Mars+-+Kings+%26+Queens++%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"673f90cab48b88e15e7822586687fb28a97bc5b5","infoHashBuffer":{"type":"Buffer","data":[103,63,144,202,180,139,136,225,94,120,34,88,102,135,251,40,169,123,197,181]},"announce":[],"urlList":[]}}