{"title":"Analytic Theology: New Essays in the Philosophy of Theology","uid":5161808,"size":1292687,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67a910486a91cc234caafa3ff0274f995ed74cbf&amp;dn=Analytic+Theology%3A+New+Essays+in+the+Philosophy+of+Theology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nedand","files":1,"time":1258193027,"description":"Philosophy in the English-speaking world is dominated by analytic approaches to its problems and projects; but theology has been dominated by alternative approaches. Many would say that the current state in theology is not mere historical accident, but is, rather, how things ought to be. On the other hand, many others would say precisely the opposite: that theology as a discipline has been beguiled and taken captive by 'continental' approaches, and that the effects on the discipline have been largely deleterious. The methodological divide between systematic theologians and analytic philosophers of religion is ripe for exploration. The present volume represents an attempt to begin a much-needed interdisciplinary conversation about the value of analytic philosophical approaches to theological topics. Most of the essays herein are sympathetic toward the enterprise the editors are calling analytic theology; but, with an eye toward balance, the volume also includes essays and an introduction that try to offer more critical perspectives on analytic theology.","torrent":{"xt":"urn:btih:67a910486a91cc234caafa3ff0274f995ed74cbf","amp;dn":"Analytic+Theology%3A+New+Essays+in+the+Philosophy+of+Theology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a910486a91cc234caafa3ff0274f995ed74cbf","infoHashBuffer":{"type":"Buffer","data":[103,169,16,72,106,145,204,35,76,170,250,63,240,39,79,153,94,215,76,191]},"announce":[],"urlList":[]}}