{"title":"Paul Fregosi - Jihad in the West (mobi, epub)","uid":6939991,"size":8496819,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67f7b8eecedfc4a8116ece5a91a897a478df8690&amp;dn=Paul+Fregosi+-+Jihad+in+the+West+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1325972582,"description":"Jihad in the West: Muslim Conquests from the 7th to the 21st Centuries\n\nJihad, the Muslim holy war against Christians and others, has raged for 1300 years with bloody conquests in Europe dating from campaigns to convert the infidels in the 7th century to today's random acts of terrorism in the name of Allah. Yet this huge unrecorded 'hole' in European history has been censored and stifled by political and literary authorities who have feared reprisals from angry Muslims trying to hide a legacy of brutality vastly more bloody and six times longer in duration than the atrocities of the crusades. This is the engrossing factual account of the immense and little-known Islamic military invasions of Europe, and the major players who led them, beginning around 650CE. The Islamic Arabs (and later the Moors) occupied a number of the Mediterranean Islands, and invaded Spain and Portugal in 711CE, and ruled over much of the Iberian peninsula for the next 800 years. France was attacked and invaded, as was Italy, and the European coasts all the way to Ireland and Iceland. The Muslims swept over the Balkans, besieged Vienna, and were intermittent masters of Greece, Bulgaria, Romania, and Hungary into the 19th century, destroying the Byzantines, taking Constantinople (turning it into Istanbul). Ambitious and unrelenting, the Muslims also sought to conquer Austria, and Russia. In a bright and brisk narrative, Paul Fregosi's unique and provocative work is the first, and only, general history of the Jihad, the most neglected and disregarded phenomenon in European history.\n\nAuthor: Paul Fregosi\nPublisher: Prometheus Books\nPublication Date: September 30, 1998\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:67f7b8eecedfc4a8116ece5a91a897a478df8690","amp;dn":"Paul+Fregosi+-+Jihad+in+the+West+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67f7b8eecedfc4a8116ece5a91a897a478df8690","infoHashBuffer":{"type":"Buffer","data":[103,247,184,238,206,223,196,168,17,110,206,90,145,168,151,164,120,223,134,144]},"announce":[],"urlList":[]}}