{"title":"ACE COMBAT: ASSAULT HORIZON - COMPLEX - XBOX360 - PAL - XGD3 {BO","uid":6739796,"size":8535554803,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:689fe56b1d2c93ac4227404f5d26edf01716d135&amp;dn=ACE+COMBAT%3A+ASSAULT+HORIZON+-+COMPLEX+-+XBOX360+-+PAL+-+XGD3+%7BBO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"boobsman","files":89,"time":1318454200,"description":"THIS IS AN XGD3 ISO AND IS ONLY BE PLAYABLE WITH LT2.0!!!\n &lt;a href=&quot;\nhttp://www.pix2links.com/image/NJUcD.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pix2links.com/image/NJUcD.jpg&lt;/a&gt;\n\nNever before has aerial combat been so fast, so in-your-face and so vicious. It's time to set the sky on fire.\n\nThe demanding Project Aces development team at Namco Bandai Games Inc. in Japan weren't satisfied. They wanted more from the series. They wanted planes that tore apart limb from limb right in front of your face, spewing their oil lifeblood across the sky. They wanted to scrape the streets and dodge the steel skyscrapers of real world cities at blistering speeds, in an enthralling war drama that spanned the globe with a web of intrigue. They wanted players to pick up the controller and become deadly combat pilots in seconds, pulling off breathtaking kills at impossible speeds, and doing battle online in a multiplayer sky littered with fiery supersonic debris. What they wanted was steel carnage in the sky.\n\nThe result is not a sequel in the multi-million selling smash hit Ace Combat series, but a complete rebirth, a phoenix from the ashes flying at three times the speed of sound. The Project Aces team is building Ace Combat: Assault Horizon from the ground up, with new technology fuelling their passionately realised vision of a game that puts players in the dark heart of the fight like no aerial combat game has done before.\n","torrent":{"xt":"urn:btih:689fe56b1d2c93ac4227404f5d26edf01716d135","amp;dn":"ACE+COMBAT%3A+ASSAULT+HORIZON+-+COMPLEX+-+XBOX360+-+PAL+-+XGD3+%7BBO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"689fe56b1d2c93ac4227404f5d26edf01716d135","infoHashBuffer":{"type":"Buffer","data":[104,159,229,107,29,44,147,172,66,39,64,79,93,38,237,240,23,22,209,53]},"announce":[],"urlList":[]}}