{"title":"VA - I Need A Hero &amp; Holding Out for a Hero (mixes) Ultimate Col","uid":5740114,"size":515213033,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:69d0f2371b5ac8f6c81a11f523c4fb3ddfa1a115&amp;dn=VA+-+I+Need+A+Hero+%26+Holding+Out+for+a+Hero+%28mixes%29+Ultimate+Col&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"g88fee","files":41,"time":1280974204,"description":"VA - I Need a Hero &amp; Holding Out for a Hero mixes ULTIMATE Collection (320 kps) \n\n\nAlex B - I Need a Hero (Club Mix)\nAlex B - I Need a Hero (Extended Version)\nAlex B - I Need a Hero (Radio Edit)\nAnaconda - I Need a Hero (Klubbingman Radio Edit)\nAnaconda - I Need a Hero (Klubbingman Remix)\nAnaconda - I Need a Hero (Original Extended Mix)\nAnaconda - I Need a Hero (Original Radio Edit)\nAndrew Spencer meets Blue Nature - I need a Hero (a2 picco vs. jens o. jumper remix edit)\nAndrew Spencer meets Blue Nature - I need a Hero (a2 picco vs. jens o. jumper remix)\nAndrew Spencer Meets Blue Nature - I Need a Hero (Andrew Spencer Mix Edit)\nAndrew Spencer Meets Blue Nature - I Need a Hero (Andrew Spencer Mix)\nAndrew Spencer Meets Blue Nature - I Need a Hero (Andrew Spencer Single Mix)\nAndrew Spencer Meets Blue Nature - I Need a Hero (Blue Nature Mix)\nAndrew Spencer Meets Blue Nature - I Need A Hero (Phunk Foundation Remix)\nBonnie Tyler - Holding Out For A Hero (DJ MALLORCA remix)\nBonnie Tyler - Holding out for a hero (Extended remix)\nBonnie Tyler - Holding Out For A Hero (Jellybean remix)\nBonnie Tyler - Holding Out For A Hero (Radio Edit)\nBonnie Tyler - Holding Out For a Hero (Remastered)\nBonnie Tyler - Holding Out For A Hero (Ultrasound mix)\nBonnie Tyler - Holding Out For A Hero '09 (UltraTraxx Vs. US Mix)\nBonnie Tyler - Holding out for a Hero\nBonnie Tyler - I Need a Hero [T-Project &amp; Dj Chmielu remix]\nCarmi - I Need a Hero (Edit Show by DJ Markinhoz)\nDJ Mastermind meets Mindhunters - I Need a Hero (original mix)\nDJ pulse- I Need a Hero (klubbingman remix)\nDJ Tasiorek - I Need a Hero techno mix\nFrou Frou - I Need a Hero\nGraveworm - I Need a Hero\nHolding Out For A Hero (Instrumental)\nJennifer Saunders  - I Need a Hero (Shrek 2 Soundtrack)\nJoss Stone - Holding Out For A Hero\nKelly Wilde - Holding Out For a Hero (Ross Alexander Club remix)\nLady Life - Holding Out for a Hero (Extended Mix)\nLady Life - Holding Out for a Hero (Noel G. Remix Edit)\nLady Life - Holding Out for a Hero (Noel G. Remix)\nLady Life - Holding Out for a Hero\nLaura Branigan - Holding Out For A Hero\nMax Farenthide &amp; Bonnie Tyler - I Need a Hero (Max remix)\nTanja T. - Holding Out For a Hero\nTara Leigh Cobble - Holding Out for a Hero\n\n\nEnjoy !!!\n\n\n","torrent":{"xt":"urn:btih:69d0f2371b5ac8f6c81a11f523c4fb3ddfa1a115","amp;dn":"VA+-+I+Need+A+Hero+%26+Holding+Out+for+a+Hero+%28mixes%29+Ultimate+Col","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69d0f2371b5ac8f6c81a11f523c4fb3ddfa1a115","infoHashBuffer":{"type":"Buffer","data":[105,208,242,55,27,90,200,246,200,26,17,245,35,196,251,61,223,161,161,21]},"announce":[],"urlList":[]}}