{"title":"Handbook of Optics, Third Edition Volume IV","uid":7172437,"size":11712725,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a3577aec780b162874d118365fe3c6e84d7b08a&amp;dn=Handbook+of+Optics%2C+Third+Edition+Volume+IV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PlanetT","files":1,"time":1334006978,"description":"Handbook of Optics, Third Edition Volume IV: Optical Properties of Materials, Nonlinear Optics, Quantum Optics\n\nThe most comprehensive and up-to-date optics resource available\n\nPrepared under the auspices of the Optical Society of America, the five carefully architected and cross-referenced volumes of the Handbook of Optics, Third Edition, contain everything a student, scientist, or engineer requires to actively work in the field. From the design of complex optical systems to world-class research and development methods, this definitive publication provides unparalleled access to the fundamentals of the discipline and its greatest minds. \n\nIndividual chapters are written by the world's most renowned experts who explain, illustrate, and solve the entire field of optics. Each volume contains a complete chapter listing for the entire Handbook, extensive chapter glossaries, and a wealth of references. This pioneering work offers unprecedented coverage of optics data, techniques, and applications. \n\nVolume IV covers optical properties of materials, nonlinear optics, and quantum optics.\n\n2010 edition","torrent":{"xt":"urn:btih:6a3577aec780b162874d118365fe3c6e84d7b08a","amp;dn":"Handbook+of+Optics%2C+Third+Edition+Volume+IV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a3577aec780b162874d118365fe3c6e84d7b08a","infoHashBuffer":{"type":"Buffer","data":[106,53,119,174,199,128,177,98,135,77,17,131,101,254,60,110,132,215,176,138]},"announce":[],"urlList":[]}}