{"title":"Evil Angel - Rocco's Abbondanza: Big Natural Boobs","uid":6706260,"size":8158199808,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6b1aa3d7e0b232852b3c186f06358def0146f10f&amp;dn=Evil+Angel+-+Rocco%5C%27s+Abbondanza%3A+Big+Natural+Boobs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1317177599,"description":"Evil Angel - Rocco's Abbondanza: Big Natural Boobs\n &lt;a href=&quot;\nhttp://popasa.ru/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://popasa.ru/&lt;/a&gt;\n\nDirected by: Rocco Siffredi\nCast: Sensual Jane, Mike Chapman, Rocco Siffredi, Dominno, Roxy Taggart, Franco Roccaforte, Mike Angelo, Veronika, Manuella, Tye, Abigaile Johnson, Amy, Tiana\n\nHugely hung porn legend Rocco Siffredi presents a bevy of outrageously busty beauties with titanic, swingin 'titties in &quot;Rocco's Abbondanza: Big Natural Boobs.&quot; The title spells it straight out, just in case you happen to get distracted by all this fine, fine sweater-meat on display! First, dark-haired bombshell Dominno seduces Rocco near his helicopter, while adorable and innocent young Abigaile Johnson gets serviced by the black cock of his mechanic, Mike Chapman. The two couples join together for a crazy butt-licking foursome that showcases Dominno's giant, bouncing jugs. After a rollicking music video starring four stacked party girls, Mike heads outdoors and enjoys a nasty anal session with the top-heavy Veronika, Manuella and Tye, making good use of their wobbly, pendulous breasts. Meanwhile, Rocco and ultra-voluptuous slut Sensual Jane have an intimate, tit-fucking good time. Jane rides Rocco's famous dick with mucho gusto, and his energetic banging climaxes with an ejaculation in Jane's amazing, soft cleavage. Naturally stacked babe Roxy Taggart receives an interracial ass fucking and a facial creaming from Franco Roccaforte's big, black boner. And finally, buxom farm girls Amy and Tiana get oiled up and throat-fucked by Rocco, who anally invades the busty bumpkins with his thick meat and splatters their cute faces with cock sauce. Now that's Italian! Rocco Siffredi's &quot;Rocco's Abbondanza: Big Natural Boobs&quot; is a single-disc DVD with behind-the-scenes footage, cumshot recap, photo galleries, cast list and filmographies.\n\nReleased: 2000\nIssued: Evil Angel\nLength: 2:31:52\nLanguage: English\nGenre: Gonzo, Big Tits, Anal, Group, Oral, Hardcore\n\nFormat: DVD Video\nQuality: DVD9\nVideo codec: MPEG2\nVideo: 720x480, 7500 kb / s\nSound: AC3, 2ch, 192 kb / s","torrent":{"xt":"urn:btih:6b1aa3d7e0b232852b3c186f06358def0146f10f","amp;dn":"Evil+Angel+-+Rocco%5C%27s+Abbondanza%3A+Big+Natural+Boobs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b1aa3d7e0b232852b3c186f06358def0146f10f","infoHashBuffer":{"type":"Buffer","data":[107,26,163,215,224,178,50,133,43,60,24,111,6,53,141,239,1,70,241,15]},"announce":[],"urlList":[]}}