{"title":"Xmas Specials 1 - Animated Christmas Specials pt. 1 of 5","uid":4588118,"size":3715104768,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6c1213cabcc286eb1b14598ee136156873f06c66&amp;dn=Xmas+Specials+1+-+Animated+Christmas+Specials+pt.+1+of+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"frit0","files":10,"time":1229715531,"description":"IF YOU WANT IT BY XMAS PLEASE DONT LIMIT UPLOAD SPEEDS AND PLEASE KEEP IT SEEDED FOR OTHERS!!!\n\nMERRY XMAS!!! - frit0\n\nPACK 1 CONTAINS:\n\n\n- A CHARLIE BROWN CHRISTMAS  (Charles Schulz/Mendelson-Melendez Prods./United Features Syndicate, 1965)  When Charlie Brown complains about the overwhelming materialism that he sees amongst everyone during the Christmas season, Lucy suggests that he become director of the school Christmas paegent.  Charlie Brown accepts, but it proves to be a frustrating struggle.  When an attempt to restore the proper spirit with a forlorn little fir Christmas tree fails, he needs Linus' help to learn what the real meaning of Christmas is.  Winner of both the Emmy and Peabody Awards.\n\n- A CHRISTMAS CAROL  (Richard Williams Productions, 1971)  Animation masters Richard Williams and Chuck Jones co-produced this Oscar-winning piece of the classic holiday tale.  This compelling version of Charles Dickens' masterpiece retells the familiar tale of Ebenezer Scrooge (played by Alastair Sim), the misterly merchant who doesn't make merry at Christmas.  One Christmas Eve in 1843 he is visited by the ghost of Christmas past, present and future, who persuade him to change his stingy ways.  The lovable cast of kindly Bob Cratchit, Tiny Tim and the rest all appear in this heart-warming classic.  Narrated by Michael Redgrave.\n\n- COSMIC CHRISTMAS  (Nelvana, 1977)  An animated film in which a town rediscovers the real spirit of Christmas, thanks to three visitors from outer space and a little boy named Peter.  Commercialism and greed seem to contradict the meaning of Christmas, and when Peter's pet goose is kidnapped, things look even worse.  An exciting rescue results in a new sense of caring and sharing.  One of Nelvana's first animated specials.\n\n- Dr. Suess' HOW THE GRINCH STOLE CHRISTMAS!  (Dr. Suess/MGM Television, 1966) Bitter and hateful, the Grinch is irritated at the thought of the nearby village having a happy time celebrating Christmas.  So disguised as Santa Claus, with his dog made to look like a reindeer, he raids the village to steal all the Christmas things.  The village is sure to have a sad Christmas this year.  Based on the book of the same name by Theodor &quot;Dr. Suess&quot; Geisel and directed by Chuck Jones.\n\n- FROSTY THE SNOWMAN  (Rankin-Bass/Videocraft International, 1969)  A discarded silk tophat becomes the focus of a struggle between a washed-up stage magician and a group of schoolchildren after it magically brings a snowman to life.  Realizing that newly-living Frosty will melt in spring unless he takes refuge in a colder climate, Frosty and a young girl who he befriends stow away on a freight train headed for the north pole.  Little do they know that the magician is following them, and he wants his hat back.  This animated short is based on the popular Christmas song of the same name.\n\n- MICKEY'S CHRISTMAS CAROL  (Walt Disney Productions, 1983)  It's the same old classic Charles Dickens story with an all star Disney cast. Uncle Scrooge McDuck is appropriately enough Scrooge and is visited by his dead partner and 3 spirits one night to remember the joys of Christmas.\n\n- MISTER MAGOO'S CHRISTMAS CAROL  (UPA Pictures, 1962)  Considered the first full-length animated Christmas special produced, featuring the music and lyrics of Bob Merrill and Jule Styne.\n\n- RUDOLPH, THE RED-NOSED REINDEER  (Rankin-Bass/Videocraft International, 1964) Sam the snowman tells us the story of a young red-nosed reindeer who, after being ousted from the reindeer games because of his beaming honker, teams up with Hermey, an elf who wants to be a dentist, and Yukon Cornelius, the prospector.  They run into the Abominable Snowman and find a whole island of misfit toys.  Rudoph vows to see if he can get Santa to help the toys, and he goes back to the North Pole on Christmas Eve. But Santa's sleigh is fogged in.  But when Santa looks over Rudolph, he gets a very bright idea...\n\n- THE SMALL ONE  (Walt Disney Productions, 1978)  A young boy must part with his beloved donkey, named &quot;small one&quot;. When he takes him into town to sell him, the only people who want to buy him are cruel. When all hope seems lost and small one leads his master back to the tanners shop where he is willing to sacrifice his life. A miracle happens...  Based on a book by Charles Tazewell and directed by Don Bluth.\n\n- THE SNOWMAN  (TVC/Channel 4/Snowman Enterprises Ltd., 1982)  An enchanted animated adventure about a young boy who makes a snowman one Christmas Eve, only for it to come to life that night and take him on a magical adventure to the North Pole to meet Santa Claus.  Based on Raymond Briggs' classic story, featuring the music of Howard Blake.\n\n\nALL THANKS TO OLDSKOOLFAN AND THE SPLEENERS!!!","torrent":{"xt":"urn:btih:6c1213cabcc286eb1b14598ee136156873f06c66","amp;dn":"Xmas+Specials+1+-+Animated+Christmas+Specials+pt.+1+of+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c1213cabcc286eb1b14598ee136156873f06c66","infoHashBuffer":{"type":"Buffer","data":[108,18,19,202,188,194,134,235,27,20,89,142,225,54,21,104,115,240,108,102]},"announce":[],"urlList":[]}}