{"title":"Deanna Durbin Sweetheart Pack - Three Smart Girls (1936) Xvid 1c","uid":10054738,"size":838901760,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6c6c2e0c21e0c8398ee0629bf5bcb055c4eec84c&amp;dn=Deanna+Durbin+Sweetheart+Pack+-+Three+Smart+Girls+%281936%29+Xvid+1c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1398647399,"description":"Deanna Durbin Sweetheart Pack - Three Smart Girls (1936) Xvid 1cd - Ray Milland [DDR]\n\nThree Smart Girls is a 1936 American musical comedy film directed by Henry Koster and starring Barbara Read, Nan Grey, Deanna Durbin, and Ray Milland. The film, Durbin's feature film debut, had a screenplay by Adele Comandini and Austin Parker, and is about three sisters who travel to New York City to prevent their father from remarrying. The three plot to bring their divorced parents back together again.\n\nIt began an eight-year era of successful Deanna Durbin musicals and spawned two sequels, Three Smart Girls Grow Up and Hers to Hold.\n\n    CAST:-\n    Deanna Durbin as 'Penny' Craig\n    Nan Grey as Joan Craig\n    Barbara Read as Kay Craig\n    Binnie Barnes as Donna Lyons\n    Charles Winninger as Judson Craig\n    Alice Brady as Mrs. Lyons\n    Ray Milland as Lord Michael Stuart\n    Mischa Auer as Count Arisztid\n    Ernest Cossart as Binns\n    Lucile Watson as Martha Trudel\n    John 'Dusty' King as Bill Evans (as John King)\n    Nella Walker as Dorothy Craig\n    Hobart Cavanaugh as Wilbur Lamb\n\nDirector: Henry Koster\nProducer: Joe Pasternak\nMusic: songs by Walter Jurmann &amp; Bronislau Kaper\nRunning time 84 minutes\n\nMOVIE REVIEW:- Three Smart Girls (1936)\nTeen singing sensation Deanna Durbin made her feature film debut in Three Smart Girls (1936), a romantic comedy about three sisters trying to reunite their divorced parents before Dad (Charles Winninger) marries a gold digger (Binnie Barnes). Along the way, the two older sisters (Nan Grey and Barbara Read) find romance, and the youngest, Durbin, shows off her operatic soprano in several songs. The film would save Universal from bankruptcy and establish the careers of Durbin, producer Joe Pasternak, and director Henry Koster.\n\nThe vocal talents of Canadian-born, California-bred Durbin were evident from an early age. She had voice training, and planned for an operatic career, until a talent agent recommended her to MGM, which signed her to a contract when she was just 14. Around the same time, the studio also signed another talented young singer, Judy Garland, and put the two teens into a short, Every Sunday (1936). Legend has it that studio chief Louis B. Mayer saw the film and told his underlings, &quot;Fire the fat one,&quot; meaning Garland, but they fired Durbin instead.\n\nPasternak had emigrated from Hungary to California as a teenager, and had begun his film career as a busboy and waiter at Paramount studios. By the mid-1920s, he was directing shorts at Universal, and a few years later returned to Europe to manage Universal's studios in Berlin. But by the mid-1930s, Hitler was on the rise, and Pasternak, a Jew, returned to America, taking with him the talented German director, Henry Koster, who was also Jewish. The two arrived to find the studio in dire financial straits, and their jobs in jeopardy. Setting up their offices in the studio stables, the two filmmakers began trying to figure out how they were going to make their first American film, Three Smart Girls, with a minuscule budget and a tight shooting schedule. They began casting, looking for a young actress to play the youngest sister, and envisioning a plucky Mary Pickford-type girl. When the casting director showed them Every Sunday and told them Durbin had been dropped by MGM, they immediately knew they had found their star. After Joseph Breen of the Production Code Administration enthusiastically endorsed the script, the budget was increased.\n\nVeteran character actors such as Charles Winninger, Alice Brady, Lucile Watson, and Mischa Auer brightened the cast. Perhaps the best known among the younger cast members was the fourth-billed Ray Milland. He had begun his career in England, and had arrived in the U.S. in 1930, steadily building a career playing second leads. He had only recently begun playing romantic leads. The success of Three Smart Girls boosted his career at his home studio, Paramount, where he had played a few minor roles and had been stuck working on screen tests of other young hopefuls.\n\nFilming of Three Smart Girls took a little over a month, and although Pasternak and Koster had always known they had something special, both they and the studio were pleasantly surprised when it became a huge hit. The film earned an OscarÂ® nomination as Best Picture, and for its sound recording and original story. There would be two sequels using the same characters, Three Smart Girls Grow Up (1939) and Hers to Hold (1943).\n\nFollowing the success of Three Smart Girls, Universal immediately demanded another Durbin picture, and the team came up with 100 Men and a Girl (1937), co-starring Durbin with famed conductor Leopold Stokowski and a symphony orchestra. It was also a hit. The Durbin-Pasternak-Koster team would make six films together, and Durbin and Pasternak would team on an additional four. Durbin's films would take Universal from near-bankruptcy to solvency. In 1938, Durbin was given a special OscarÂ® &quot;for bringing to the screen the spirit and personification of youth.&quot; But by the early 1940s, Durbin was anxious to grow up onscreen, and Pasternak and Koster were ready to move on. The two men went to MGM, where they became even more successful producing a series of lavish musicals with stars such as Kathryn Grayson and Jane Powell.\n\nIn 1949, Durbin moved to France with her third husband and disappeared from the public eye. In his autobiography, Pasternak wrote that they kept in touch over the years, and he always told Durbin that if she ever wanted to return to the screen, she should call him. She never did. In a rare interview with British film historian David Shipman in the early 1980s, Durbin said that every time he was in Paris, Pasternak would call her and ask, &quot;Are you still happy?&quot; Invariably, she would say she was, and he would say, &quot;Well, I'll try again next time,&quot; and hang up. Durbin said the only time she'd been tempted to return to show business was when she was offered the starring role in the original stage version of My Fair Lady (1956).\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 84 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 84 mins","torrent":{"xt":"urn:btih:6c6c2e0c21e0c8398ee0629bf5bcb055c4eec84c","amp;dn":"Deanna+Durbin+Sweetheart+Pack+-+Three+Smart+Girls+%281936%29+Xvid+1c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c6c2e0c21e0c8398ee0629bf5bcb055c4eec84c","infoHashBuffer":{"type":"Buffer","data":[108,108,46,12,33,224,200,57,142,224,98,155,245,188,176,85,196,238,200,76]},"announce":[],"urlList":[]}}