{"title":"Geoffrey Chaucer - The Canterbury Tales [96]","uid":7639631,"size":557466956,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6d2abe22b4e302049cc12f8f84671265b57876d3&amp;dn=Geoffrey+Chaucer+-+The+Canterbury+Tales+%5B96%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1347743582,"description":"Geoffrey Chaucer - The Canterbury Tales\n\nEdited by Michael Murphy, Narrated by various Recorded Books narrators\n\nWhen the host of the Tobard Inn suggested to the assembled Pilgrims that their journey to Canterbury will be more pleasant if they share stories along the way, he was also inventing the idea of audiobooks. Six hundred years later, Recorded Books saw the Tales as ideal for both audio production and the educational market. The catalyst for the project was a modernization of the Tales done by Michael Murphy. The absolutely stunning program which resulted has angered some scholars, brought praise from some teachers, and has made Chaucer more accessible for everyone. The General Prologue and twelve stories in this program are the most notable, showing interactions between some of the characters as well as the marriage debates in the tales of the Knight, the Wife of Bath, Clerk, and Franklin. Murphy expertly introduces each tale; the recordings involve some of Recorded Books's most notable narrators. Patrick Tull brings an appropriately earthy tone to his readings of the Miller's and Merchant's Tales; George Guidall a courtly quality to the Knight's and Friar's Tales; and Davina Porter a gentleness to the Prioress's Tale. The one disappointment in the program is that Barbara Rosenblat sounds too sophisticated for the Wife of Bath. But all of the readers deliver intelligent interpretations and infuse drama into their texts, which brings them to life despite difficult vocabulary. A commuter can enjoy this work as can a student following a written text with a good glossary. Obviously a special project for all involved, this program deserves very broad support. S.K. Winner of AUDIOFILE Earphones Award Â©AudioFile, Portland, Maine [Published: SEPT 93]\n\n4.5 hours This recording includes: The General Prologue read by John Franklyn-Robbins The Miller's Tale by Patrick Tull The Wife of Bath by Barbara Rosenblatt The Friar's Tale by George Guidall The Shipman's Tale by Ron Keith and The Nun's Priest Tale by John Rainer","torrent":{"xt":"urn:btih:6d2abe22b4e302049cc12f8f84671265b57876d3","amp;dn":"Geoffrey+Chaucer+-+The+Canterbury+Tales+%5B96%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d2abe22b4e302049cc12f8f84671265b57876d3","infoHashBuffer":{"type":"Buffer","data":[109,42,190,34,180,227,2,4,156,193,47,143,132,103,18,101,181,120,118,211]},"announce":[],"urlList":[]}}