{"title":"Fated for Love (Love in Bloom #16) by Melissa Foster (Perseu)","uid":10582614,"size":633797,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d5d2a66d8a7804ac91a30ab91077c3b25b81339&amp;dn=Fated+for+Love+%28Love+in+Bloom+%2316%29+by+Melissa+Foster+%28Perseu%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"perseu","files":-1,"time":1405707062,"description":"\nLibrarian Callie Barnes has visions of reading and relaxing-and maybe having a few too many drinks--on her girls' weekend away. Her hopes are crushed when her friends pull into a dude ranch instead of a spa, and she refuses to say longer than one night. That is...until she realizes the ranch is owned by sinfully sexy, and dangerously rugged, Wes Braden--the subject of her late-night fantasies.\n\nFearless rancher Wes Braden thinks he's the luckiest guy on the planet when the sweet, sexy librarian from his hometown shows up at his ranch. Their connection is white-hot, making it impossible for either to ignore their carnal desires. Wes is more than willing to convert sweet Callie from chick lit to a world of erotic romance, but Callie ties sex to love, and Wes avoids commitment like the plague.\n\nCallie is thrust into physically demanding activities that ignite her deepest fears. Luckily, Wes is as tender as he is strong, and he's there every step of the way to help her find her inner strength. With Callie's influence, Wes might even discover that he's been nursing a few fears of his own. Passion pulls Callie and Wes from their safe, comfortable lives into each other's arms, and they're about to find out just how alike they really are.\n\n\nFated for Love (Love in Bloom #16)\nBy: Melissa Foster\nLanguage: EN\nFormat: Epub\nPages: 516\nISBN13: 9781310583162","torrent":{"xt":"urn:btih:6d5d2a66d8a7804ac91a30ab91077c3b25b81339","amp;dn":"Fated+for+Love+%28Love+in+Bloom+%2316%29+by+Melissa+Foster+%28Perseu%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d5d2a66d8a7804ac91a30ab91077c3b25b81339","infoHashBuffer":{"type":"Buffer","data":[109,93,42,102,216,167,128,74,201,26,48,171,145,7,124,59,37,184,19,57]},"announce":[],"urlList":[]}}