{"title":"Death of a Dissident: The Poisoning of Alexander Litvinenko and ","uid":8642896,"size":952320,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ddc2870621ae600b674893ecdfc5e7581e1be0a&amp;dn=Death+of+a+Dissident%3A+The+Poisoning+of+Alexander+Litvinenko+and+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1372913645,"description":"*DJVU File*\n\nThe assassination of former Russian intelligence officer Alexander &quot;Sasha&quot; Litvinenko in November 2006 -- poisoned by the rare radioactive element polonium -- caused an international sensation. Within a few short weeks, the fit forty-three-year-old lay gaunt, bald, and dying in a hospital, the victim of a &quot;tiny nuclear bomb.&quot; Suspicions swirled around Russia's FSB, the successor to the KGB, and the Putin regime. Traces of polonium radiation were found in Germany and on certain airplanes, suggesting a travel route from Russia for the carriers of the fatal poison. But what really happened? What did Litvinenko know? And why was he killed?\n\nThe full story of Sasha Litvinenko's life and death is one that the Kremlin does not want told. His closest friend, Alex Goldfarb, and his widow, Marina, are the only two people who can tell it all, from firsthand knowledge, with dramatic scenes from Moscow to London to Washington. Death of a Dissident reads like a political thriller, yet its story is more fantastic and frightening than any novel.\n\nEver since 1998, when Litvinenko denounced the FSB for ordering him to assassinate tycoon Boris Berezovsky, he had devoted his life to exposing the FSB's darkest secrets. After a dramatic escape to London with Goldfarb's assistance, he spent six years, often working with Goldfarb, investigating a widening series of scandals. Oligarchs and journalists have been assassinated. Ukrainian presidential candidate Viktor Yuschenko was poisoned on the campaign trail. The war in Chechnya became unspeakably harsh on both sides. Sasha Litvinenko investigated all of it, and he denounced his former employers in no uncertain terms for their dirty deeds.\n\nDeath of a Dissident opens a window into the dark heart of the Putin Kremlin. With its strong-arm tactics, tight control over the media, and penetration of all levels of government, the old KGB is back with a vengeance. Sasha Litvinenko dedicated his life to exposing this truth. It took his diabolical murder for the world to listen. \n\n\n369 Pages\nPublisher \tThe Free Press; First Edition edition (May 22, 2007)\nLanguage \tEnglish\nISBN-10 \t1416551654\nISBN-13 \t978-1416551652\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Death-Dissident-Poisoning-Alexander-Litvinenko/dp/1416551654/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372906058&amp;sr=1-1&amp;keywords=Death+of+a+dissident%3A+the+poisoning+of+Alexander+Litvinenko+and+the+return+of+the+KGB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Death-Dissident-Poisoning-Alexander-Litvinenko/dp/1416551654/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372906058&amp;sr=1-1&amp;keywords=Death+of+a+dissident%3A+the+poisoning+of+Alexander+Litvinenko+and+the+return+of+the+KGB&lt;/a&gt;","torrent":{"xt":"urn:btih:6ddc2870621ae600b674893ecdfc5e7581e1be0a","amp;dn":"Death+of+a+Dissident%3A+The+Poisoning+of+Alexander+Litvinenko+and+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ddc2870621ae600b674893ecdfc5e7581e1be0a","infoHashBuffer":{"type":"Buffer","data":[109,220,40,112,98,26,230,0,182,116,137,62,205,252,94,117,129,225,190,10]},"announce":[],"urlList":[]}}