{"title":"Gwen Stefani feat. Damian Marley - Now That You Got It (2nafish)","uid":5345107,"size":162490372,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6e13884aac027195608090b95db305b92ff228cb&amp;dn=Gwen+Stefani+feat.+Damian+Marley+-+Now+That+You+Got+It+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265609323,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Now That You Got It&quot; is a song written by Sean Garrett and Gwen Stefani for Stefani's second album The Sweet Escape (2006). The song received mixed reviews from music critics. A remix and hybrid featuring reggae artist Damian Marley were produced for the song's release as the album's fourth single in September 2007.\n\nThe song's music video was directed by the Saline Project and was shot in in Puerto Rico and Jamaica. The video premiered on MTV's Total Request Live's September 4, 2007 episode.\n\nThe video opens up on a mountain saying - &quot;Gwen Stefani Presents&quot; and later another mountain says - &quot;Now That You Got It&quot;. Stefani is singing against a wall with Marley and later Stefani and the Harajuku Girls are riding along the road with scooters singing the first verse. The chorus begins and Stefani, Harajuku Girls and Marley and playing board games under a shelter near the lake side. Marley then begins to sing his part near two sheds while Stefani and Harjuku Girls are still on their scooters. During the second verse, Stefani sings against another girl and shows the Harajuku Girls singing on roof tops with the boy dancers from &quot;The Sweet Escape Tour&quot; (Flea, Legacy, Remedy and Steelo). During the second chorus, the video opens at the beach where Stefani is SMSing someone to come to the party at night. This leads the video to a party at night time where Stefani is stripping on stage with people dancing. The video concludes with Harajuku Girls and the boys doing strips on the roof, Stefani singing on the scooters and the ending of the party with Stefani doing one last strip.\n\nThe Sweet Escape is the second and last solo studio album by American pop and rock singer Gwen Stefani, released on December 5, 2006 by Interscope Records. Having originally intended to return to No Doubt after her 2004 solo album Love. Angel. Music. Baby., Stefani decided to record a second album as a way to release some of the material left over from the L.A.M.B. writing sessions. The album musically resembles its predecessor while exploring more modern pop sounds. It was released to generally mixed reviews from contemporary music critics, receiving criticism for its strong similarities to L.A.M.B.\n\nIt was preceded by the lead single &quot;Wind It Up&quot;, which charted moderately across the world, and produced the follow-up single &quot;The Sweet Escape&quot;, which proved more successful worldwide. The Sweet Escape reached the Canadian, U.S., and Australian top five and peaked inside the top twenty in the UK. The Sweet Escape Tour, started in April 2007, covered North America, Central America, Australia, Asia, and Europe.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:6e13884aac027195608090b95db305b92ff228cb","amp;dn":"Gwen+Stefani+feat.+Damian+Marley+-+Now+That+You+Got+It+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e13884aac027195608090b95db305b92ff228cb","infoHashBuffer":{"type":"Buffer","data":[110,19,136,74,172,2,113,149,96,128,144,185,93,179,5,185,47,242,40,203]},"announce":[],"urlList":[]}}