{"title":"Yenka Math Science Technology Computing Homeschool Educational S","uid":5371733,"size":208620709,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6e64620eb115085f251cb1504bc366dfd7a965a1&amp;dn=Yenka+Math+Science+Technology+Computing+Homeschool+Educational+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"cezen","files":3,"time":1266445201,"description":"This will not be free at their site forever.  They are only giving away 1,000 free copies and I'm not sure how much longer they will do this.  Included here are the Install files.\n\nIncluded:\n\n.exe for Windows (Network Installation: network installers are available for MSI and RM CC3 networks.  Located at: http://yenka.com/en/Network_Installers/  \nThere is also a registry patch at this location in case you are running this on a server.  \n\nYenka File Converter: Download and install the Yenka File Converter, (http://yenka.com/file/YK/Yenka_File_Converter.exe)  to open old electronics circuits saved as .cyt (Crocodile Technology) and .cyp (Crocodile Physics) files. Note: You do not need to install this file converter if you want to open .cxt and .cxp files. )\n\n.exe for Mac (PCB routing and PIC Programming: Please note that PCB routing and PIC/PICAXE Programming are not available in the Mac versions of Yenka.)\n\n.exe for Linux\n\nMAKE SURE TO JUST DOWNLOAD THE FILE THAT HAS YOUR PARTICULAR OS SYSTEM, OR ELSE YOU ARE WASTING YOUR BANDWIDTH.\n\nBoth teachers and students can use all of our Yenka software free of charge at home, as long as it's not for commercial purposes such as private tutoring.\n\nTo get your free Yenka home licence,\n\n   1. Download Yenka and install it on your computer.\n   2. When the installation is finished, run Yenka by double-clicking on the desktop icon.\n   3. Accept the end-user licence agreement, then at the bottom left of the Product Choose screen, click &quot;Your Yenka Licences&quot;\n   4. Under &quot;At Home&quot;, click the &quot;Use all products for free&quot; link.\n   5. Log in using your e-mail address - you only need to do this once, when you first run Yenka at home.\n   6. You can now start using Yenka!\n\nYenka is a powerful piece of software for schools, which lets you use - and edit - an ever-growing library of free lessons for mathematics, science, technology and computing.\n\nEqually at home on interactive whiteboards or when used by individual students, Yenka lets you learn by experimenting in a safe, accurate virtual world.\nHundreds of ready-made lessons\n\nTo get started, find a lesson. Browse our library of ready-made lessons, which have been set up to help you teach in Yenka's virtual world.\nCreate your own lessons\n\nYenka is based around a powerful, but easy-to-use, modeling engine.\n\nUnlike most educational software, this means you can modify our lessons as you wish. And you can even create your own lessons or activities from scratch, with just a few clicks.\n\nWWW.YENKA.COM\n\nTraining Videos to learn to use the software are: &lt;a href=&quot;\nhttp://www.yenka.com/content/search.action;jsessionid=4CD8C36DE6055F32A64AA51851866FDF#search&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.yenka.com/content/search.action;jsessionid=4CD8C36DE6055F32A64AA51851866FDF#search&lt;/a&gt;\n\nThis is awesome software!\n\nTheir main page, listing ALL their products &lt;a href=&quot;\nhttp://www.crocodile-clips.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.crocodile-clips.com/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6e64620eb115085f251cb1504bc366dfd7a965a1","amp;dn":"Yenka+Math+Science+Technology+Computing+Homeschool+Educational+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e64620eb115085f251cb1504bc366dfd7a965a1","infoHashBuffer":{"type":"Buffer","data":[110,100,98,14,177,21,8,95,37,28,177,80,75,195,102,223,215,169,101,161]},"announce":[],"urlList":[]}}