{"title":"Marvel 1997 July Upgrade","uid":4299089,"size":774392854,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6e6b0bbd60e17e9b69705fba5f24b2c0eb2099b6&amp;dn=Marvel+1997+July+Upgrade&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DieSmurfDie","files":65,"time":1216195954,"description":"This is a resubmission of the July 1997 Marvel torrent, corrected to address some flaws in the first attempt.  It contains corrections and upgrades to bring the July 1997 torrent up to the standard set by the recent chronology posts.  The revised torrent contains all of the scanned comics issued by Marvel with a July cover date that I was able to locate.  I&amp;#039;ve addressed the complaints/comments that were posted in the comments of the previous torrent.  Hopefully the responses will satisfy the critics.  The filenames have been altered to reflect the naming conventions used by MCC.  If you downloaded the earlier version, I suggest you load this one over the top of that one.\n\nJuly was the flashback month where many of the regular issues were replaced by issues numbered as -1 that fill in some pre-first issue backstory.\n\nTorrent Comment\n&quot;A few quick questions though, are these c2c or no-ads versions? Also, are you using the official scanned versions of the main titles (F4, Avengers, etc...) that [Citaltras] is uploading?&quot;\n\nWhere available c2c scans are now included.  All of Citaltras&amp;#039; c2c &amp;#039;Official&amp;#039; scans are now here.\n\nTorrent Comment\n&quot;Not bad, you only missed 4 issues for the month.&quot; \n\nAfter a lot of checking and cross checking, I believe the 4 titles in question came from this group:\n  Deadpool 7 is variously listed as July but has an August cover\n  Spectacular Spider-Man 248 is variously listed as July but has an August cover\n  Star Trek Unlimited 5 is variously listed as July but has a September Cover\n  Star Trek Deep Space Nine 9 is variously listed as July but has a September cover.\n  Daredevil/Deadpool Annual &amp;#039;97 is variously listed as July but is part of the September release group\n\nAlthough none of those issues actually belonged in July, in the interest of completeness I checked the April through July torrents for missing, misplaced or corrupted (after my Beast blunder was pointed out to me) titles.  The result was, I had a glass house and stones moment.\n\nFirst July:\n  The original torrent was missing these available books:\n    Silver Surfer Annual &amp;#039;97 (released as 14841 in June torrent)\n    Untold Tales of Spider-Man Annual &amp;#039;97\n    Gen 13 / Generation X crossover (intentionally skipped)\n    Doctor Who 254 (excerpt)\n  Corrupted issue:\n    Beast 3\n  Misplaced:\nThat is 3 errors (one intentional skip and one new discovery) out of a pool of 47 books.  I once again humbly beg your collective pardons for posting a corrupted comic.  As to the other three errors,  I took a look at the research methods used in the MCC torrents, and did a little digging to find accurate issue dates for the annuals.  I also added the Doctor Who excerpts because Marvel Vision lists the Doctor Who books as part of the Marvel regular release calender.  Anyhow, this re-release corrects the known errors.\n\nNow April through June:\n  The torrents were missing:\n    Journey Into Mystery 508-510 (3) (also missing issues 503-507)\n    Marvel Vision 16-18 (3)\n    Casper &amp; Friends 2\n    WildC.A.T.S./X-Men: The Silver Age (also missing Golden Age in February &amp;#039;97)\n    X-Force/Cable Annual &amp;#039;97\n    Amalgam crossover event issues (11) (intentional ?)\n    Doctor Who Magazine 248-251 (3) (intentional ?)\n  Misplaced:\n    The Amazing Spider-Man Annual &amp;#039;97 (June) should be September\n    Incredible Hulk Annual &amp;#039;97 (June) should be May\n    Silver Surfer Annual &amp;#039;97 (June) should be July\n    Star Trek: Deep Space Nine 8 (June) should be August\n    Wolverine Annual &amp;#039;97 (June) should be January &amp;#039;98 (Diamond pre-order data)\n    X-Men Annual &amp;#039;97 (June) should be May\n    Daredevil/Batman (Elseworlds) (May) should be March\n    X-Man Annual &amp;#039;97 (May) should be February &amp;#039;98 (Diamond pre-order data)\n    X-Men: Lost Tales 2 (May) should be April\nAs with the July torrent I am not sure I caught all of the errors.  Leaving intentionally skipped books aside, there are 18 verifiable errors in the April through June torrents.  That&amp;#039;s 18 out of 144 books issued or an error rate of 12.5% (15 of 141 and 10.6% if you leave out Marvel Vision).  In contrast the error rate for July was 6.4% (with this update it drops to 0.0%).\n\nThere is a fill directory containing the identified missing issues from April through June (also the Journey into Mystery October through February run and the WildC.A.T.S./X-Men Golden Age issue from February).\n\nTorrent Comment\n&quot;And then you miss a crucial part of the chronologies... the numbering scheme... &quot;\n\nUnless the data used to create a rigid numbering scheme is exhaustive, the numbering scheme is flawed.  Unless it references some external resource, it serves no particularly useful purpose.  Arbitrary numbering schemes make it more difficult to cleanly correct errors.  Its usage is a direct violation of the KISS principle.\n\nTorrent Comment\n&quot;If someone else is going to pick up the mantle and continue the chronology then all I ask is that they put into it the effort to make it complete.&quot;\n\nI believe this repost addresses the request to take the time to be complete (at least in regard to this one month).  Since others are continuing the chronology, I wanted to make sure this one torrent in between the January to June releases, and the August and forward releases was as complete a representation of the July releases as possible.\n\nIssues known to be missing (these have not yet been listed as scanned):\n Casper and Friends 3 (possibly a phantom book)\n Dinosaurs - A Celebration TPB (reprint)\n Thunderbolts - First Strike TPB (reprint)\n Star Trek Collectors Set (reprint)\n\nPanini reprint titles\n Astonishing Spider-Man 23\n Essential X-Men 23\n\n","torrent":{"xt":"urn:btih:6e6b0bbd60e17e9b69705fba5f24b2c0eb2099b6","amp;dn":"Marvel+1997+July+Upgrade","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e6b0bbd60e17e9b69705fba5f24b2c0eb2099b6","infoHashBuffer":{"type":"Buffer","data":[110,107,11,189,96,225,126,155,105,112,95,186,95,36,178,192,235,32,153,182]},"announce":[],"urlList":[]}}