{"title":"American Experience - The Great Fever","uid":10489682,"size":464096436,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6f3b142ce72e3511b55adeb7f9198cde8cda6c3c&amp;dn=American+Experience+-+The+Great+Fever&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":8,"uploader":"rambam1776","files":-1,"time":1404526945,"description":"American Experience - The Great Fever\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 443 MiB\nDuration                                 : 53mn 1s\nNominal bit rate                         : 1 000 Kbps\nWidth                                    : 718 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 16:9\nFrame rate                               : 29.970 fps\nColor space                              : YUV\nChroma subsampling                       : 4:2:0\nBit depth                                : 8 bits\nScan type                                : Progressive\nBits/(Pixel*Frame)                       : 0.097\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://image.bayimg.com/1763c971f5e2e01421946c4768a347f39d0a8ee9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/1763c971f5e2e01421946c4768a347f39d0a8ee9.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0883011/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0883011/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/amex/fever/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/amex/fever/&lt;/a&gt;\n\nOn September 13, 1900, thirty-four-year-old physician Jesse Lazear believed he was on the brink of a scientific breakthrough that would put an end to yellow fever, the worst epidemic scourge of nineteenth-century America.\n\nDr. Jesse Lazear, a member of the US Yellow Fever Board working in Havana, was working on a radical theory of transmission, which placed the lowly mosquito at the center of one science's most elusive riddles. Shortly after being bitten by a lab mosquito known to be infected with yellow fever, two of Lazear's co-workers had fallen ill. Encouraged by this success, the ambitious young surgeon put himself at risk, allowing an infected mosquito to bite him. In less than two weeks, after several days of delirium and black vomit, Jesse Lazear was dead.\n\nOn Monday, October 30, American Experience presents The Great Fever. From writer, producer and director Adriana Bosch (Fidel Castro, Reagan, Jimmy Carter), this one-hour film documents the groundbreaking research of intrepid Cuban scientist Carlos Finlay and the heroic efforts of Major Walter Reed and his medical team, some of whom-including Lazear-put their own lives on the line to eradicate yellow fever. &quot;This is a dramatic tale of human persistence, dedication and sacrifice,&quot; says Adriana Bosch. &quot;Doctors from different nations and different backgrounds gave their best to put an end to a horrid disease and a devastating epidemic.&quot;\n\nJaundice, liver failure, and massive bleeding-the devastating symptoms of yellow fever-heralded certain death. Almost every summer the epidemic struck America's southern states, sometimes with biblical force. In 1878, an epidemic that began in New Orleans quickly spread from the port to Mississippi, Alabama, Arkansas, Tennessee and Kentucky. Desperate citizens waged sanitation campaigns and helpless officials set up quarantines, but cases continued to multiply as fear and chaos devastated city upon city. By the time the Mississippi Valley epidemic ended, 120,000 had taken ill and 20,000 had died. The total cost was estimated at one hundred million dollars, making it the most costly epidemic the country had ever known. Like many other prior outbreaks, the 1878 epidemic was traced back to a cargo shipment from the island of Cuba where yellow fever was present year round.\n\nWhen US troops occupied Cuba in 1900, the end of the Spanish American War, American soldiers became vulnerable. In July of that year, a deadly outbreak of yellow fever threatened the lives of fifteen thousand military men. Army officers took action, establishing a board to investigate the infectious disease, naming Major Walter Reed, a US Army doctor, to head it. Reed set off for Havana with his friend, physician Major James Carroll. There, he added Major Jesse Lazear to his team.\n\nAt first, the team searched for a yellow fever germ. Unable to find it, the board paid a visit to Cuban scientist Carlos Finlay, who, twenty years earlier, had boldly suggested that yellow fever was spread by mosquitoes; at the time, his thesis was flatly rejected. &quot;It was a remarkable idea,&quot; says narrator Linda Hunt in the film. &quot;Perhaps too remarkable for its time.&quot; Now, Jesse Lazear picked up where Finlay had left off. He began to conduct human experiments, using mosquitoes to transmit yellow fever form sick to healthy patients, and ultimately to himself.\n\nWalter Reed was in Washington when he heard that Lazear had become a victim of the disease he sought to conquer. Returning to Cuba, convinced that mosquitoes transmitted yellow fever and committed to finishing Lazear's work, Reed pushed on, making an ironclad case for Lazear's theory. In Havana, the US Army sent &quot;mosquito brigades&quot; from house to house, covering cisterns with netting to prevent mosquitoes from laying eggs and pouring a small amount of kerosene in the water to suffocate larvae. Thanks to their efforts, in the year following the cleanup, yellow fever claimed just one life in the Cuban capital.\n\nThis new theory faced its most important test in 1905, when two suspicious deaths in New Orleans forebode a new outbreak. Built on the swampy backwater of the Mississippi River delta, the city was a perfect test case for mosquito control methods that had proved so effective in Havana. Racing against the clock, public health officials launched a major campaign against the mosquitoes, and by the first frost, just 452 deaths had been reported-a small fraction of the devastation wrought by earlier outbreaks.\n\nThe mosquito control measures that were put in place in 1905 New Orleans amounted to the United States' first major public health triumph of the twentieth century.\n\n&quot;The story of yellow fever reminds us just how dangerous and damaging epidemics can be to our nation, both socially and economically,&quot; says American Experience executive producer Mark Samels. &quot;It's a danger that is still very real today.&quot;","torrent":{"xt":"urn:btih:6f3b142ce72e3511b55adeb7f9198cde8cda6c3c","amp;dn":"American+Experience+-+The+Great+Fever","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f3b142ce72e3511b55adeb7f9198cde8cda6c3c","infoHashBuffer":{"type":"Buffer","data":[111,59,20,44,231,46,53,17,181,90,222,183,249,25,140,222,140,218,108,60]},"announce":[],"urlList":[]}}