{"title":"A Century of War 5 of 6 World War II","uid":6467920,"size":4784521402,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7052aaca30d6d240742c07bfd23ebd709be23a9c&amp;dn=A+Century+of+War+5+of+6+World+War+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"rambam1776","files":-1,"time":1308030307,"description":"A Century of War DVD 5 World War Two\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1217kbps \nDuration.............: 2:15:04\nResolution...........: 600*454 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 224 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 1,472,259,524 \n\n\n\n***Uploaders Note*** - This remarkable boxed set of over 85 films was released in 2009 by the United States National Archives. It consists of wartime footage, movie newsreels, and propaganda films made from World War I through the Vietnam Conflict. No subtitles are available. Furthermore, the majority of the DVDs were produced so that it was not possible to fully separate the films with normal ripping software. Therefore, many of the disks had to be ripped as one long AVI file; some containing multiple films. I have ripped every disk to the highest resolution possible, with an average bit pixel ratio of 1.50. I would have liked to have released it all as one huge torrent (I still might if the demand is high enough), but after all this work, I really do not want this to die an unseeded death, so I have decided to release it in 6 batches to keep the size down. The DVDs contained no special features of any kind. Several of these films were either nominated or even won Academy Awards back in the day, and are not commercially available in any other venue I am aware of. For each torrent, I will include the screenshots and technical stats for one representative film.\n\nRambam 1776\n\n &lt;a href=&quot;\nhttp://www.amazon.com/National-Archives-Century-War-None/dp/B002MD3UL4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/National-Archives-Century-War-None/dp/B002MD3UL4&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/kAImDAaDj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/kAImDAaDj&lt;/a&gt;\n\n\nDVD 17 (War in Europe)\n\nTarget for Tonight (1941) Footage of the actual planning and execution of a bombing raid on Germany.\nSan Pietro (aka The Battle of San Pietro) (1945) John Huston's controversial short on the human price paid for troop advancement.\n\nDVD 18 (World War II: Bloodiest Battles)\n\nD-Day (1944) the run-up to the Allied invasion of Normandy, including Eisenhower strategizing.\nSurrender in the Pacific (1945) events in the aftermath of the war, and the atomic destruction of Hiroshima and Nagasaki.\nInvasion of Poland by the German Army (1943) Footage shot by German troops and confiscated by Allied forces of an attack in Warsaw.\nFury in the Pacific (1945) The invasion of Peleliu Island and the joint US forces capturing Bloody Nose Ridge.\nThe battle for the Marianas (1944) United States Army, Navy, and Marines join forces to wrest control of the Pacific Islands.\n\nDVD 19 (World War II: Air War)\n\nThe Memphis Belle (1944) Director William Wyler's tautly effective documentary of the celebrated flying fortress.\nArmy Air Forces: Pacific (1944) AAF missions to Okinawa and Iwo Jima, featuring Gen. MacArthur and Ernie Pyle.\nThe Fleet That Came to Stay (1945) Footage of US and British naval forces fending off Japanese kamikaze air attacks.\nAir War in Europe (1943) bombings over Nazi-occupied territory. Includes film on board Thunderbolt aircrafts.\nThe Fight for the Sky (1945) Footage includes Gen. Jimmy Doolittle, air combat and a tribute to flyers killed in action.\n\nDVD 20 (World War II: In Color)\n\nThe Battle of Midway (1942) John Ford was seriously wounded during the filming of this Oscar-winning documentary.\nThunderbolt (1945) A point-of-view film of a P-47 narrated by James Stewart and Lloyd bridges.\nWith the Marines at Tarawa (1944) In exciting short film highlighting an amphibious landing by the Marines.\nChallenge for Democracy (1943) An examination of the living conditions at Japanese-American relocation centers.","torrent":{"xt":"urn:btih:7052aaca30d6d240742c07bfd23ebd709be23a9c","amp;dn":"A+Century+of+War+5+of+6+World+War+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7052aaca30d6d240742c07bfd23ebd709be23a9c","infoHashBuffer":{"type":"Buffer","data":[112,82,170,202,48,214,210,64,116,44,7,191,210,62,189,112,155,226,58,156]},"announce":[],"urlList":[]}}