{"title":"Statistics of Linear Polymers in Disordered Media","uid":14649174,"size":73155411,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:706376290edb8a439f3b70eb5224ec19aa7bd3cc&amp;dn=Statistics+of+Linear+Polymers+in+Disordered+Media&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463614626,"description":"Statistics of Linear Polymers in Disordered Media - Bikas K. Chakrabarti (Elsevier, 2005).pdf\r\n\r\nWith the mapping of the partition function graphs of the n-vector magnetic model in the n to 0 limit as the self-avoiding walks, the conformational statistics of linear polymers was clearly understood in early seventies. Various models of disordered solids, percolation model in particular, were also established by late seventies. Subsequently, investigations on the\r\nstatistics of linear polymers or of self-avoiding walks in, say, porous medium or disordered lattices were started in early eighties. Inspite of the brilliant ideas forwarded and extensive studies made for the next two decades, the problem is not yet completely solved in its generality. This intriguing and important problem has remained since a topic of vigorous and active research.\r\n\r\nThis book intends to offer the readers a first hand and extensive review of the various aspects of the problem, written by the experts in the respective fields. We hope, the contents of the book will provide a valuable guide for researchers in statistical physics of polymers and will surely induce further research and advances towards a complete understanding of the problem.\r\n\r\n· First book on statistics of polymers in random media.\r\n· Contents straight away from research labs.\r\n· Chapters written by foremost experts in the respective fields.\r\n· Theories, experiments and computer simulations extensively discussed.\r\n· Includes latest developments in understanding related important topics like DNA unzipping, Travelling salesman problem, etc.\r\n· Comprehensive index for quick search for keywords","torrent":{"xt":"urn:btih:706376290edb8a439f3b70eb5224ec19aa7bd3cc","amp;dn":"Statistics+of+Linear+Polymers+in+Disordered+Media","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"706376290edb8a439f3b70eb5224ec19aa7bd3cc","infoHashBuffer":{"type":"Buffer","data":[112,99,118,41,14,219,138,67,159,59,112,235,82,36,236,25,170,123,211,204]},"announce":[],"urlList":[]}}