{"title":"Dead of Night [1945] Michael Redgrave","uid":6732114,"size":736984955,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:70f34803cf452d4fef03f4f33d5b6d5e018bf434&amp;dn=Dead+of+Night+%5B1945%5D+Michael+Redgrave&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1318197704,"description":" &lt;a href=&quot;http://bayimg.com/LakkGaadG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/LakkGaadG&lt;/a&gt;\n\nDead of Night (1945) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0037635/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0037635/&lt;/a&gt;\n\nDead of Night (1945) is a British portmanteau (or compendium) horror film made by Ealing Studios, its various episodes directed by Alberto Cavalcanti, Charles Crichton, Basil Dearden and Robert Hamer. The film stars Mervyn Johns, Googie Withers and Michael Redgrave. The film is probably best-remembered for the ventriloquist's dummy episode starring Redgrave.\n\nDead of Night stands out from British film of the 1940s, when few genre films were being produced, and it had a huge influence on subsequent British horror films; most particularly, the anthology films produced by Amicus in the 1960s and early 1970s. Both of the segments by John Baines were recycled for later films, and the possessed ventriloquist dummy episode was adapted as an episode of the long-running CBS radio series Escape.\n\nAlthough Dead of Night (1945) wasn't the first horror anthology film the German silent Das Wachsfigurenkabinett (Waxworks, 1924) beat it to the punch by twenty years it is widely considered the granddaddy of this storied subset of fright films. Made at Ealing Studios, known for their early documentaries and later a string of witty and eminently British comedies (Passport to Pimlico [1949], Kind Hearts and Coronets [1949], The Lavender Hill Mob [1951]), Dead of Night is as different from those sophisticated spoofs as it is from the luridly-titled omnibus spookers (Dr. Terrors House of Horrors [1965], Torture Garden [1967], The House That Dripped Blood [1971]) that followed its example. \n\nAfter 1938, Ealing was run by Michael Balcon, one of the founders of Gainsborough Pictures, who had overseen several early films by Alfred Hitchcock. When Gainsborough was absorbed by the rival Gaumont Film Company, Balcon worked with MGM for a brief, unhappy period before hiring on at Ealing. Dead of Night was an atypical choice for Ealing and for Balcon, who favored droll comedies and &quot;important&quot; social dramas, but the nature of the production as a group effort was a way for the studio to show off its talents during the postwar period. In the past, macabre flourishes had been employed to bestow upon certain films an allegorical gravitas. In The Halfway House (1944), a group of travelers (a staple of the nascent horror anthology subgenre) decamps at a Welsh inn where the newspapers are a year out of date and the proprietor (Mervyn Johns) casts no shadow. Their time out of time allows each sojourner respite to work out his or her character-defining personal kink before an upbeat conclusion closer in spirit to Brigadoon (1954) than Tales from the Crypt (1972).\n\nBetween them, Halfway House directors Basil Dearden and Alberto Cavalcanti helmed four of the six vignettes comprising Dead of Night, their slack being picked up by Charles Crichton and Robert Hamer (a studio editor making his directorial debut). However the portmanteau film (so named for a type of traveling bag allowing the storage of many small items) may have been thought to condescend to supernatural motifs for their own sake, the project's direct inspirations were largely literary, deriving two of their tales from writings by H. G. Wells and E. F. Benson. While Wells' jocular &quot;Golfing Story&quot; (in which rivals for the love of a woman settle their score on the fairway, with fatal results) is considered the film's weakest link, the melancholy &quot;Christmas Party&quot; (in which Sally Ann Howes stumbles upon a strange little boy during a holiday game of hide-and-seek), &quot;The Hearse Driver&quot; (a tour de force for character actor Miles Malleson, for whom &quot;Room for one more&quot; became a trademark phrase) and &quot;The Haunted Mirror&quot; are all regarded (and rightfully so) as enduring classics of the cinematic ghost story. Nevertheless, it's John Baines' &quot;Ventriloquist's Dummy&quot; that has had the most lasting impact. The vignette stars Michael Redgrave as cabaret entertainer Maxwell Frere, who's comically abusive dummy &quot;Hugo&quot; seems to be the one pulling the strings. Even in 1945, this concept was not original; The Great Gabbo (1929) starred Erich von Stroheim as a ventriloquist entirely too dependent on his own little man. Nonetheless, it was Dead of Night that begat the killer doll subgenre, whose lineage extends directly to the classic Twilight Zone episode &quot;Dummy&quot; (1962), Lindsay Shonteff's Devil Doll (1964), Richard Attenborough's Magic (1978) and Dead Silence (2007), and indirectly to the likes of Child's Play (1988) and Saw (2004) and their respective sequels.\n\nMichael Redgrave was the only son of itinerant stage performer Roy Redgrave and his second wife, actress Margaret Scudamore. Trained for a career as a teacher, Michael Redgrave forfeited the steady income for an uncertain but romantic life in the arts. After making his London stage debut in 1936, he enjoyed successful seasons as a repertory player with the Old Vic. Redgrave landed on the map of moviegoers with a role in Hitchcock's The Lady Vanishes (1938) and matured into something like the face of British cinema in such national classics as The Importance of Being Earnest (1952), The Night My Number Came Up (1955), The Loneliness of the Long Distance Runner (1962) and The Go-Between (1970). He had not yet finished work for Anthony Asquith on The Way to the Stars (1945) when he was approached by Ealing to appear in Dead of Night. More interested in playing a schizophrenic than in the supernatural ramifications, Redgrave mastered the art of throwing his voice with the coaching of Peter Brough, a popular ventriloquist on British radio. (Yes, you read that correctly.) Director Cavalcanti had wanted &quot;Hugo&quot; modeled after Redgrave but the finished product bore a greater resemblance to Brough's basswood nemesis &quot;Archie Andrews.&quot; (A 25-year-old dwarf named John McGuire was used for moments when &quot;Hugo&quot; was needed to ambulate on his own.) \n\nIt's worth considering that part of the popularity of this ber-creepy tale is due to the fact that prints of Dead of Night screened in the United States were missing both Crichton's &quot;Golfing Story&quot; and Hamer's &quot;The Haunted Mirror,&quot; which many critics believed then and continue to assert are superior to &quot;Ventriloquist's Dummy.&quot; If the truncated release did give Cavalcanti's vignette a leg up with audiences, subsequent TV prints, VHS tapes and DVD releases on both sides of the Atlantic have been complete, leaving it up to the viewer to decide ultimately which works best when viewed alone, in the dead of night. \n\nProducer: Michael Balcon\nDirectors: Alberto Cavalcanti (segments &quot;Christmas Party&quot; and &quot;The Ventriloquist's Dummy&quot;), Charles Crichton (segment &quot;Golfing Story&quot;), Basil Dearden (segments &quot;Hearse Driver&quot; and &quot;Linking Narrative&quot;), Robert Hamer (segment &quot;The Haunted Mirror&quot;)\nScreenplay: John Baines (and stories &quot;The Haunted Mirror&quot; and &quot;The Ventriloquist's Dummy&quot;), Angus MacPhail (and story &quot;Christmas Party&quot;); T.E.B Clarke (additional dialogue); H.G. Wells (story &quot;Golfing Story&quot;), E.F. Benson (story, &quot;Hearse Driver&quot; and linking narrative)\nCinematography: Jack Parker, Stan Pavey, Douglas Slocombe\nArt Direction: Michael Relph\nMusic: Georges Auric\nFilm Editing: Charles Hasse\nCast: Mervyn Johns (Walter Craig), Roland Culver (Eliot Foley, linking narrative), Mary Merrall (Mrs. Foley, linking narrative), Googie Withers (Joan Cortland, segment &quot;Haunted Mirror&quot;), Frederick Valk (Dr. van Straaten, segment &quot;Ventriloquist's Dummy&quot;), Antony Baird (Hugh Grainger, segment &quot;Hearse Driver&quot;), Sally Ann Howes (Sally O'Hara, segment &quot;Christmas Party&quot;), Robert Wyndham (Dr. Albury, segment &quot;Hearse Driver&quot;), Judy Kelly (Joyce Grainger, segment &quot;Hearse Driver&quot;). \nBW-102m.\n\nby Richard Harland Smith\n\nSources:\nEnglish Gothic: A Century of Horror Cinema by Jonathan Rigby\nMichael Balcon Presents... A Lifetime of Films by Michael Balcon\nIn My Mind's I by Michael Redgrave\nEaling Studios by Charles Barr\nFifty Classic British Films 1932-1982 by Anthony Slide\n","torrent":{"xt":"urn:btih:70f34803cf452d4fef03f4f33d5b6d5e018bf434","amp;dn":"Dead+of+Night+%5B1945%5D+Michael+Redgrave","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70f34803cf452d4fef03f4f33d5b6d5e018bf434","infoHashBuffer":{"type":"Buffer","data":[112,243,72,3,207,69,45,79,239,3,244,243,61,91,109,94,1,139,244,52]},"announce":[],"urlList":[]}}