{"title":"Hanya Aku Cinta Kau Seorang PPVRip","uid":7418198,"size":392085956,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:70f5832ec9fbf3428fcfa00acfa4c4ec8185477c&amp;dn=Hanya+Aku+Cinta+Kau+Seorang+PPVRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zaini711","files":-1,"time":1341589172,"description":"Release Date: 21 June 2012\n\nLanguage: Malay\n\nSubtitle: None\n \nGenre: Romance\n\nRunning Time: 1 Hour 24 Minutes\n\nDirector: Ahmad Rusli Khadri\n\nCast: Mont Ryanti, Aeril Zafril, Nuremy Ramli, Fezrul Khan and Shima Anuar\n\nStory about MURNI, a girl who seeks her soulmate. She was forced by her bestfriends, STACY and MUKHLIS to join an online dating websites, 'Meet Soulmate'. Though she did not believe any man she knows in that websites but STACY and MUKHLIS still force her to go on a blind date. MURNI likes MUKHLIS but she thought he is a homosexual and in relationship with AYIM. Then, MURNI goes on a blind date with IQWAL, a man she met from the dating website. MURNI feels comfortable with IQWAL. She starting to like him until she found out that IQWAL is with ZIZI. MURNI started to feel frustrated with men more over when her best friend STACY is having a problem with his husband, FELIX. ZIZI, turns out to be IQWAL's sister tried to find MURNI and explain everything. ZIZI tells MURNI that IQWAL really likes MURNI. At the same time, AYIM tells a big secret to MURNI. MUKHLIS is not a homosexual like everyone thinks. MUKHLIS is actually likes MURNI and afraid to tell the truth. MURNI confused with her feelings. When she found out that IQWAL has a cancer, MURNI choose to take care of IQWAL. Urfortunately, MUKHLIS involved in big accident and passed away. Before he died, he signed as an organ donor and his heart was donored to IQWAL. For MURNI and IQWAL, MUKHLIS is always live inside their hearts.\n\n(Source: METROWEALTH)\n\nscreen capture : http://i.imgur.com/jGWto.jpg\n\nPlease visit website HTTP://JIKA1.COM to show support","torrent":{"xt":"urn:btih:70f5832ec9fbf3428fcfa00acfa4c4ec8185477c","amp;dn":"Hanya+Aku+Cinta+Kau+Seorang+PPVRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70f5832ec9fbf3428fcfa00acfa4c4ec8185477c","infoHashBuffer":{"type":"Buffer","data":[112,245,131,46,201,251,243,66,143,207,160,10,207,164,196,236,129,133,71,124]},"announce":[],"urlList":[]}}