{"title":"Jesus the Bridegroom (Unabridged Audiobook) by Dr. Brant Pitre","uid":10754901,"size":177793496,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:71082fe42629a233216bcb53dea46f24462802d8&amp;dn=Jesus+the+Bridegroom+%28Unabridged+Audiobook%29+by+Dr.+Brant+Pitre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ancapcatholic","files":-1,"time":1407919363,"description":"Jesus the Bridegroom: The Greatest Love Story Ever Told (Unabridged Audiobook)\n\nWritten by: Brant Pitre\nNarrated by: Mel Foster\nFiletype: 4 MP3s totaling 6 hours (split to Audio CD size with 20-second overlaps)\n\nThe eBook is also included in a ZIP file in EPUB/MOBI/PDF formats.\n\nIn Jesus the Bridegroom, Brant Pitre once again taps into the wells of Jewish Scripture and tradition, and unlocks the secrets of what is arguably the most well-known symbol of the Christian faith: The cross of Christ. In this thrilling exploration, Pitre shows how the suffering and death of Jesus was far more than a tragic Roman execution. Instead, the Passion of Christ was the fulfillment of ancient Jewish prophecies of a wedding, when the God of the universe would wed himself to humankind in an everlasting nuptial covenant. To be sure, most Christians are familiar with the Apostle Paul's teaching that Christ is the &quot;Bridegroom&quot; and the Church is the &quot;Bride.&quot; But what does this really mean? And what would ever possess Paul to compare the death of Christ to the love of a husband for his wife? If you would have been at the Crucifixion, with Jesus hanging there dying, is that how you would have described it? How could a first-century Jew like Paul, who knew how brutal Roman crucifixions were, have ever compared the execution of Jesus to a wedding? And why does he refer to this as the &quot;great mystery&quot; (Ephesians 5:32)? As Pitre shows, the key to unlocking this mystery can be found by going back to Jewish Scripture and tradition and seeing the entire history of salvation, from Mount Sinai to Mount Calvary, as a divine love story between Creator and creature, between God and Israel, between Christ and his bride-a story that comes to its climax on the wood of a Roman cross. In Jesus the Bridegroom, dozens of familiar passages in the Bible - the Exodus, the Song of Songs, the Wedding at Cana, the Woman at the Well, the Last Supper, the Crucifixion, and even the Second Coming at the End of Time - are suddenly transformed before our eyes. Indeed, when seen in the light of Jewish Scripture and tradition, the life of Christ is nothing less than the greatest love story ever told.\n\n\n\nSee also:\n\n--Dr. Brant Pitre - Jesus the Bridegroom (abridged 1 hour audio lecture)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10177302&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10177302&lt;/a&gt;\n\n--Dr. Brant Pitre - Jesus and the Jewish Roots of the Eucharist (1 hour audio lecture)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10177016&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10177016&lt;/a&gt;\n\n--Dr. Scott Hahn: The Lamb's Supper (Unabridged Audiobook + epub/mobi)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10645369&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10645369&lt;/a&gt;\n\n--Dr. Scott Hahn - A Father Who Keeps His Promises (Unabridged + book)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10548781&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10548781&lt;/a&gt;\n\n--Dr. Scott Hahn - Swear to God (Unabridged Audiobook + epub/mobi/pdf)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10713760&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10713760&lt;/a&gt;\n\n--G.K. Chesterton - The Innocence of Father Brown (Unabridged)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10548797&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10548797&lt;/a&gt;\n\n\n\nPlease seed!\n\nMore: https://thepiratebay.se/user/ancapcatholic/\n\nTips: https://bit.co.in/ancapcatholic\t","torrent":{"xt":"urn:btih:71082fe42629a233216bcb53dea46f24462802d8","amp;dn":"Jesus+the+Bridegroom+%28Unabridged+Audiobook%29+by+Dr.+Brant+Pitre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71082fe42629a233216bcb53dea46f24462802d8","infoHashBuffer":{"type":"Buffer","data":[113,8,47,228,38,41,162,51,33,107,203,83,222,164,111,36,70,40,2,216]},"announce":[],"urlList":[]}}