{"title":"A Short History of Nearly Everything","uid":5322073,"size":137744408,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:71421ccea549cd2e4c8d04261de2eea8ff24b493&amp;dn=A+Short+History+of+Nearly+Everything&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wafwot","files":1,"time":1264892433,"description":"In A Short History of Nearly Everything, Bill Bryson takes his ultimate journey - into the most intriguing and consequential questions that science seeks to answer. It's a dazzling quest, as this insatiably curious writer attempts to understand everything that has transpired from the Big Bang to the rise of civilization.\n\nTo that end, Bill Bryson apprenticed himself to a host of the world's most profound scientific minds, living and dead. His challenge is to take subjects like geology, chemistry, paleontology, astronomy, and particle physics and see if there isn't some way to render them comprehensible to people, like himself, made bored (or scared) stiff of science by school.\n\nOn his travels through space and time, Bill Bryson encounters a splendid gallery of the most fascinating personalities ever to ask a hard question. In their company, he undertakes a sometimes profound, sometimes funny, and always supremely clear and entertaining adventure in the realms of human knowledge. Science has never been more involving, and the world we inhabit has never been more full of wonder and delight.","torrent":{"xt":"urn:btih:71421ccea549cd2e4c8d04261de2eea8ff24b493","amp;dn":"A+Short+History+of+Nearly+Everything","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71421ccea549cd2e4c8d04261de2eea8ff24b493","infoHashBuffer":{"type":"Buffer","data":[113,66,28,206,165,73,205,46,76,141,4,38,29,226,238,168,255,36,180,147]},"announce":[],"urlList":[]}}