{"title":"Elk Stopped Play: And Other Tales from Wisden's Cricket","uid":14476373,"size":2288337,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71f905e68ade77efa3562f1f28a62fca9fda7269&amp;dn=Elk+Stopped+Play%3A+And+Other+Tales+from+Wisden%27s+Cricket+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":1,"time":1461947982,"description":"There are few parts of Wisden Cricketers' Almanack that embody the magic and appeal of the game more than Cricket Round the World. Elk Stopped Play is a carefully-chosen selection of stories from twenty years of one of Wisden's most-loved sections. Combining the highlights of two decades of the Almanack's coverage of the game's further reaches, as well as original material that places the stories in context and expands upon the incidents and personalities involved, it is an original and eccentric examination of the sport's enduring worldwide appeal.\r\n\r\nThere are extraordinary matches, great individual performances, stories of exceptional pioneering dedication and quirky incidents from all over the world, from games staged on tiny, far-flung Pacific islands to the frozen wastes of the Antarctic, from cricketers dodging mortars in Baghdad to Indonesian mud wickets on converted buffalo paddocks via fractured French skulls, Antarctic barbecues and untimely interruptions by Finnish elk. The perfect book to dip into either during the cricket season or during the long wait for the end of April to come round again, Elk Stopped Play, edited by Charlie Connelly, is a fantastic addition to the Wisden bookshelf","torrent":{"xt":"urn:btih:71f905e68ade77efa3562f1f28a62fca9fda7269","amp;dn":"Elk+Stopped+Play%3A+And+Other+Tales+from+Wisden%27s+Cricket+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71f905e68ade77efa3562f1f28a62fca9fda7269","infoHashBuffer":{"type":"Buffer","data":[113,249,5,230,138,222,119,239,163,86,47,31,40,166,47,202,159,218,114,105]},"announce":[],"urlList":[]}}