{"title":"F. Scott Fitzgerald - Bernice Bobs Her Hair (1976) Shelley Duval","uid":6577492,"size":473692892,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:722ac53ea22845da3daf71c0bd00a90ba39b39dc&amp;dn=F.+Scott+Fitzgerald+-+Bernice+Bobs+Her+Hair+%281976%29+Shelley+Duval&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1312271956,"description":"Bernice Bobs Her Hair - Dramatization of Classic Short Story (1976) Shelly Duvall\n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1193kbps \nDuration.............: 45:10.061\nResolution...........: 600*458 \nFramerate............: 23.976 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \nFilesize.............: 473,081,046 \n &lt;a href=&quot;\nhttp://bayimg.com/CAJhHAaDG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CAJhHAaDG&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0074200/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0074200/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Bernice_Bobs_Her_Hair&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Bernice_Bobs_Her_Hair&lt;/a&gt;\n\n\nBernice Bobs Her Hair is a short story by F. Scott Fitzgerald, written in 1920 and first published in the Saturday Evening Post in May of that year. It appeared shortly thereafter in the collection Flappers and Philosophers.\n\nThe story was based on letters Fitzgerald sent to his younger sister, Annabel, advising her on how to be more attractive to young men. The original text was much longer, but Fitzgerald cut nearly 3000 words and changed the ending to make the story more attractive to publishers.\n\nPlot summary\n\nThe story concerns Bernice, a wealthy girl from Eau Claire, Wisconsin, who goes to visit her cousin Marjorie for the month of August. Marjorie feels that Bernice is a drag on her social life, and none of the boys want to dance with Bernice. \n\nBernice overhears a conversation between Marjorie and Marjorie's mother where the younger girl complains that Bernice is socially hopeless. The next day, Bernice threatens to leave town, but when Marjorie is unfazed, Bernice relents and agrees to let Marjorie turn her into a society girl. Marjorie teaches Bernice how to hold interesting conversations, how to flirt with even unattractive or uninteresting boys to make herself seem more desirable, and how to dance. Bernice's best line is teasing the boys with the idea that she will soon bob her hair and they will get to watch.\n\nThe new Bernice is a big hit with the boys in town with her new attitude, especially with Warren, a boy Marjorie keeps around as her own but neglects. When it becomes clear that Warren has shifted his interest from Marjorie to Bernice, Marjorie sets about humiliating Bernice, tricking her into going through with bobbing her hair. When Bernice comes out of the barbershop with the new hairdo, her hair is flat and strange and the boys suddenly lose interest in her, and Bernice realizes she's been tricked.\n\nMarjorie's mother points out that Bernice's haircut (which at the time was only seen on &quot;liberated&quot; women) would cause a scandal at an upcoming party held in her and Marjorie's honor. After the family has gone to bed, Bernice packs her trunk and intends to leave on a train at 1 a.m. Before she goes, she sneaks into Marjorie's room and cuts off her cousin's two pigtails, taking them with her on her run to the station and throwing them onto Warren's porch.\n\nMythological basis\n\nThe name of the protagonist echoes that of Berenice, whose sacrifice of her golden tresses resulted in the victory of her husband in war, and the honor given to her by the gods. Her tresses were placed into the heavens as the Constellation Coma Berenices.","torrent":{"xt":"urn:btih:722ac53ea22845da3daf71c0bd00a90ba39b39dc","amp;dn":"F.+Scott+Fitzgerald+-+Bernice+Bobs+Her+Hair+%281976%29+Shelley+Duval","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"722ac53ea22845da3daf71c0bd00a90ba39b39dc","infoHashBuffer":{"type":"Buffer","data":[114,42,197,62,162,40,69,218,61,175,113,192,189,0,169,11,163,155,57,220]},"announce":[],"urlList":[]}}