{"title":"The Christmas Choir (2008) 2Lions-Team","uid":5224279,"size":4168569434,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:729046b78168a63da6b318542f9cf374d64dd60b&amp;dn=The+Christmas+Choir+%282008%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"JUULTJE","files":-1,"time":1261057112,"description":"The Christmas Choir (2008)       \n\nCanada\nDrama\n90 minuten\n\ngeregisseerd door Peter Svatek\nmet Tyrone Benskin, Marianne Farley en Jason Gedrick\n\nPeter Brockman is een succesrijke, maar geestelijk opgebrande boekhouder, wiens leven op zijn kop wordt gezet wanneer hij vrijwilligerswerk in een tehuis voor daklozen aanneemt en dat gerund wordt door de norse, wrokkige zuster Agatha. Verbaasd door de muzikale begaafdheid van sommige bewoners, stelt Peter hen voor om een koor te op te richten en vakantiedeuntjes te gaan zingen in een plaatselijk metrostation. Hoewel de zangers en Peter elk door hun eigen persoonlijke moeilijkheden gaan, beginnen zij langzaam meer zelfvertrouwen te krijgen door hun muzikale optredens.\n\n\n\nEnglish\n\nBased on a true story, The Christmas Choir is the inspiring account of how one man can make a remarkable difference simply by giving of himself. Workaholic accountant Peter Andrews (Jason Gedrick) has overlooked Christmas, friends and even his fiancÃƒÂ© for far too long. As a result, his life begins to fall apart. But a chance encounter with a homeless man named Bob (Tyrone Benskin) changes everything and inspires Peter to start a choir that eventually goes on to enormous success. With the help of the unconventional Sister Agatha (Rhea Perlman) and his newfound friends at the shelter, Peter learns that Christmas is not a season but a state of mind and that everyone deserves a second chance at life and love. \n\n\nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nAudio : English\nMenu: YES\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\n \nWeblink : http://www.moviemeter.nl/film/61764\nWeblink : http://www.imdb.com/title/tt1285239\n\n***************************************** \n\nBrought to you by\n\n\n2Lions Team \n\n\n \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!! \n\n \n \n \n","torrent":{"xt":"urn:btih:729046b78168a63da6b318542f9cf374d64dd60b","amp;dn":"The+Christmas+Choir+%282008%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"729046b78168a63da6b318542f9cf374d64dd60b","infoHashBuffer":{"type":"Buffer","data":[114,144,70,183,129,104,166,61,166,179,24,84,47,156,243,116,214,77,214,11]},"announce":[],"urlList":[]}}