{"title":"Reasons for and Advantages of Breathing by Lydia Peelle  (retail","uid":11005011,"size":5503548,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7296db3c83915c7f5edf97dc985b1bf85d6a6198&amp;dn=Reasons+for+and+Advantages+of+Breathing+by+Lydia+Peelle++%28retail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1410210795,"description":"With its quick pace, modern society leaves scant time for us to pause and take a deep breath of fresh air, to watch the clouds move across the sky, or to appreciate the earth and its cycles of birth and death. Once out of the fray -- far from our cubicles and the relentless rat race -- and back into nature, we find time to ponder bigger questions. \n\nPeelle has crafted eight stories that capture these moments: summers riding horses, life as a carnival worker, kidding season on a farm. Quiet and telling, her stories are filled alternately with supreme joy and with deep sorrow, desperation and longing, dreams born and broken -- set in landscapes where the clock ticks more slowly. Her landscapes are the kind of places you want to run away from, or to which you wish you could return, if time hadn't irrevocably changed them. A single thread runs through each of these stories, the unspoken quest to answer one of life's most primal questions: Who am I?\n\nPeelle's writing is calm and smooth on the surface -- even soothing in its descriptions of daily life on a farm, for example -- but her words can hardly contain the depth of emotion that lies beneath them. So make some time and find a big tree to sit beneath, take a deep breath, and dive into this quietly impressive collection.","torrent":{"xt":"urn:btih:7296db3c83915c7f5edf97dc985b1bf85d6a6198","amp;dn":"Reasons+for+and+Advantages+of+Breathing+by+Lydia+Peelle++%28retail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7296db3c83915c7f5edf97dc985b1bf85d6a6198","infoHashBuffer":{"type":"Buffer","data":[114,150,219,60,131,145,92,127,94,223,151,220,152,91,27,248,93,106,97,152]},"announce":[],"urlList":[]}}