{"title":"Rise Of The Ravager (v1.0) -[GIBZ]","uid":9137744,"size":171885432,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:72fd25876cedd582e9c50be57bbfb69ea0451c5a&amp;dn=Rise+Of+The+Ravager+%28v1.0%29+-%5BGIBZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prototype.06","files":-1,"time":1383446061,"description":"This is: Rise Of The Ravager (v1.0)\n\nIiiiiiiiii guessssssss this is like &quot;a blending of Guitar Hero and Missile Command&quot;. Some other shite some other dude said: &quot;The game itself beams with the high quality presentation that developers such as PopCap Games are able to deliver. If you are looking for a new shmup that's out of the ordinary then this will definitely be something worth getting into.&quot; Seems cool... just install and go for it!\n--------------------------------------\n\nDescription:\nRise of the Ravager is arcade action best described as a blending of Guitar Hero and Missile Command. A god desires to be reborn, an event that would signal the End of Times. In Rise of the Ravager, seek favor from the Old Ones to prevent his avatar from destroying all. Play alone, or invite up to three friends to blast hordes of enemies utilizing a unique combat system based on color. Large boss fights, multiple landscapes, unfolding mythology - preventing the End of Time is an entertaining challenge. \n\n\nFeatures:\n-Unique arcade action based on color combat \n-Single player campaign unfolding an engaging original myth \n-Up to 4 players for local co-op play with scaled difficulty \n-Challenging boss fights \n-Upgrade system with refundable points allowing you tackle stages with different builds \n-Hand drawn art inspired by Mesoamerican cultures \n-New Game Plus invites you to play again with a higher difficulty and all your upgrades \n-In-game achievements to unlock \n\n\n\n--------------------------------------\n*Absolutely 100% clean and working!*\n*My upload ain't the best, but I'll seed this forever!*\n*BUY the games you reallllly dig!!!*\n\n**Check my profile for more TPB-exclusive indie games!!!**","torrent":{"xt":"urn:btih:72fd25876cedd582e9c50be57bbfb69ea0451c5a","amp;dn":"Rise+Of+The+Ravager+%28v1.0%29+-%5BGIBZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72fd25876cedd582e9c50be57bbfb69ea0451c5a","infoHashBuffer":{"type":"Buffer","data":[114,253,37,135,108,237,213,130,233,197,11,229,123,191,182,158,160,69,28,90]},"announce":[],"urlList":[]}}