{"title":"Bob Wills - Faded Love (14 CD Box Set)(BCD 16550)","uid":11808085,"size":1369286394,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:738d9a9913d34cb0ec756b19a81e1f42259729e3&amp;dn=Bob+Wills+-+Faded+Love+%2814+CD+Box+Set%29%28BCD+16550%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BaboonDave","files":388,"time":1428671504,"description":"Bob Wills Faded Love 1947-73 (13-CD/1-DVD) Bear Family Box Set catalog number: BCD16550\n\nThis is a repack of this set with some spelling corrections.\nThe original is no longer indexed on some sites. These are 192kbps VBR MP3 Files.\n &lt;a href=&quot;\nhttps://www.bear-family.com/wills-bob-faded-love-1947-73-13-cd/1-dvd.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.bear-family.com/wills-bob-faded-love-1947-73-13-cd/1-dvd.html&lt;/a&gt;\n\nBear Family's stunning, comprehensive 13 CD/1 DVD follow up to its first Bob Wills box set, 'San Antonio Rose.' Â·\tEvery surviving commercial track that Wills cut between 1947 and his final recordings of 1973. Â·\tClassic tracks like Faded Love, Bubbles In My Beer, Boot Heel Drag and My Shoes Keep Walking Back To You. Â·\tPreviously unissued performances, including the legendary 1971 reunion session teaming Bob Wills &amp; his Playboys with superstar Merle Haggard. Â·\tAll of his recordings with Johnny 'Running Bear' Preston. Â·\tDozens of previously unpublished photos, a full discography by Bob Pinson &amp; Kevin Coffey and a biography by Bob Wills authority and acclaimed country music historian Rich Kienzle. Now we are thrilled to announce the release of the companion volume. 'Faded Love' picks up where 'San Antonio Rose' closed. Just as essential, it covers the remainder of Bob Wills' amazing career. We see Bob Wills coming to terms with changing times. The end of the western swing era, the onslaught of rock 'n' roll, and then the revival beginning to take shape in the years before Bob Wills' death....thanks to Merle Haggard and newcomers like Asleep At The Wheel. The new collection begins with Bob Wills' first sessions for MGM in 1947 and continues to his last sessions of 1973 for United Artists. In between, it covers all of Bob Wills' recordings for Decca, Liberty, Longhorn and Kapp, including the justly acclaimed reunion records with Tommy Duncan. It also includes hits and timeless classics like Faded Love, Bubbles In My Beer, Ida Red Likes The Boogie, Heart To Heart Talk, and Bob Wills' terrific original recording of My Shoes Keep Walking Back To You. In addition to every surviving commercial recording and a number of tracks never before released, there are unissued songs from the original safety tapes of Bob Wills' final recording session, which produced his classic 'For The Last Time' album. There are also twenty tracks from the amazing 1971 reunion session between Bob Wills and his Playboys orchestrated by and featuring Merle Haggard. 'Faded Love', 13 CDs plus 1 DVD of Wills' 1951 Snader Telescriptions, is an essential and important release. It boasts the usual impeccable sound quality that is the hallmark of Bear Family, and includes a XXX page hardcover-book that contains dozens of classic photos, many of them never before published, a comprehensive, newly researched discography by Bob Pinson and others, and a detailed, insightful history of the period penned by Rich Kienzle","torrent":{"xt":"urn:btih:738d9a9913d34cb0ec756b19a81e1f42259729e3","amp;dn":"Bob+Wills+-+Faded+Love+%2814+CD+Box+Set%29%28BCD+16550%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"738d9a9913d34cb0ec756b19a81e1f42259729e3","infoHashBuffer":{"type":"Buffer","data":[115,141,154,153,19,211,76,176,236,117,107,25,168,30,31,66,37,151,41,227]},"announce":[],"urlList":[]}}