{"title":"Jesu - Conqueror (FLAC)","uid":3761235,"size":405571494,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:747b374f12a5050d4caa53a0f89ef697229b9fac&amp;dn=Jesu+-+Conqueror+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neonblack77","files":12,"time":1186106917,"description":"Jesu - Conqueror\n\nFull-length, Hydra Head Records\nFebruary 2nd, 2007 \t\n\n\n1.\tConqueror\t08:10\t\n2.\tOld Year\t05:46\t\n3.\tTransfigure\t05:59\t\n4.\tWeightless &amp; Horizontal\t10:07\t\n5.\tMedicine\t07:22\t\n6.\tBrighteyes\t07:20\t\n7.\tMother Earth\t07:16\t\n8.\tStanlow\t05:58\t\n\nTotal playing time\t57:58\n\n\nFor the country that invented the genre in the first place, the UK metal scene is dead. The majority of metal bands you&amp;#039;ll find on these shores are trying to relive the NWOBHM years or just joining the international community of incredibly generic bands, of any genre. With a couple of notable exceptions, there are no British metal bands at the moment doing anything fresh or original. That is, until you encounter Jesu.\n\nHailing from Birmingham (the home of many legendary bands down the years), Jesu are a three piece, led by songwriter, vocalist and guitarist Justin K. Broadrik (a man who&amp;#039;s been involved in thousands of musical projects, most notably Godflesh). They play industrial ambient music, with obvious influences from &amp;#039;post metal&amp;#039; bands such as Pelican and Isis. However, you couldn&amp;#039;t name one artist who plays industrial, ambient or &amp;#039;post metal&amp;#039; music that sound anything like Jesu. They&amp;#039;ve created their own sound, and it works incredibly.\n\nI think the first thing that hits you about Jesu is the vocals. They&amp;#039;re entirely clean, and while quite frequent, they aren&amp;#039;t at all the most important aspect of the music, more a vehicle for expressing the lyrics and themes. Justin has a very good voice, even though you rarely get to hear it on its own without any effects (don&amp;#039;t worry though, there&amp;#039;s no Cynic vocals here, just some delay and echoes). Most of the time his vocal lines are very droning, but they&amp;#039;re never monotonous, just simple melodies repeated frequently. Don&amp;#039;t let this put you off though, because as I said, Justin isn&amp;#039;t a &amp;#039;frontman&amp;#039;, there&amp;#039;s no spotlight-grabbing in the vocal department, and even if you don&amp;#039;t like them (which I doubt anyway) they&amp;#039;re easily ignored.\n\nAs the vocals are simply there to accommodate Justin&amp;#039;s lyrics, they certainly need to be noticed. The lyrics are incredibly cryptic, but they will always stick in your head, as the words are always used sparingly, and are made to count. The way I see it, the album deals with experiences all people go through, and why they are truly important to our development, and in, I suppose &amp;#039;conquer&amp;#039; life. The aspects of life that I see Justin talking about include love, home, youth, modesty and respect. The lyrics are definitely open to interpretation, but however you view them, they are memorable and worth thinking about past the time you&amp;#039;re listening to the album.\n\nThe synthesisers are applied in a way which you see often in famous British bands. They have pop sensibility, and know how to make melodies work so that they make the whole song remain in your head without any particular &amp;#039;hooks&amp;#039; that make them memorable (or, in all fairness, irritating). They are certainly more prominent than in Jesu&amp;#039;s earlier work, but they combine with the other instruments very well.\n\nThe guitars and bass are, I suppose, the only things which really makes Conqueror a metal album. On Jesu&amp;#039;s self titled debut full length, the guitars were the driving force behind the music, with droning doomy riffs keeping a sense of direction. This time around they are strictly in the background, only creating a palette for the synths and vocals to paint with. There are a few guitar leads (and I think I hear a few solos too), but they aren&amp;#039;t particularly different from the synth melodies throughout the album. The guitar tone and production is absolutely perfect, very fuzzy and low, but not so much that it dominates any one of the songs. However, their presence can be subconsciously felt. For example, halfway into the opening title track, the guitar changes to some strange effects while the rest of the band continues in the same fashion. You can tell that only a small change has been made but instantly the layered atmosphere of the music goes away. Of course it&amp;#039;s only temporary but it indicates what importance the guitar and bass still has, even if they aren&amp;#039;t the most important factor anymore.\n\nMuch like the guitars, the drums are not meant to be flashy. Almost completely devoid of fills, or anything else which shows Ted Parsons&amp;#039; artist mettle for that matter, the drums simply keep the beat, but it works. The drumming helps keep your emotions indecisive, as the tempo and backing of the music is incredibly depressing, but the melodies are almost entirely in major keys. Only on &amp;#039;Transfigure&amp;#039; do the drums have any particular speed to them, it works there also, and it only proves what I said about deciding what emotion they&amp;#039;re giving off, as &amp;#039;Transfigure&amp;#039; is one of the most uplifting songs on the album.\n\nJesu&amp;#039;s first album was good. It was industrial drone and it was effective at expressing the feelings Justin had. Then, their next EP &amp;#039;Silver&amp;#039; was a change in sound and a step up, people were getting their hopes up and Conqueror delivers. It&amp;#039;s essentially one long piece as all of the tracks have the same atmosphere, and it should be considered as a work in itself, not a collection of works. From start to finish Jesu are modest about what they do, and there are no buildups, no standout moments, no standout tracks, just an immense soundscape, and you know what? It&amp;#039;s a breath of fresh air into this style of music and this country&amp;#039;s music. It&amp;#039;s beautiful.","torrent":{"xt":"urn:btih:747b374f12a5050d4caa53a0f89ef697229b9fac","amp;dn":"Jesu+-+Conqueror+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"747b374f12a5050d4caa53a0f89ef697229b9fac","infoHashBuffer":{"type":"Buffer","data":[116,123,55,79,18,165,5,13,76,170,83,160,248,158,246,151,34,155,159,172]},"announce":[],"urlList":[]}}