{"title":"Windows Entertainment Pack: Volume One","uid":3872851,"size":1639030,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:74dc56c146fa05c56195b460271cfb2780c8d9e2&amp;dn=Windows+Entertainment+Pack%3A+Volume+One&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"preservedforposterity","files":12,"time":1194202690,"description":"Microsoft Entertainment Pack for Windows (PfP)\nWindows Entertainment Pack: Volume One\nA Preserved for Posterity Release\nNovember 1, 2007, Revised November 4,2007\n\nAs the name implies, Preserved for Posterity exists for the sole\npurpose of preserving the past, well into the future. When PfP began,\nwe weren\\&amp;#039;t too certain as to the best method of achieving this goal.\nAs a result, there are a few PfP releases floating around out there in\ncyberspace that should probably be deleted and forgotten due to their\nextreme inelegance and awful design. In fact, any PfP release prior to\nOctober 1, 2007 should be considered Recycle Bin fodder! Uninstall and\ndelete those old releases and keep an eye out for much improved\nreplacements - You will not be disappointed!\n\nOur intent is to locate old software, which is no longer available for\nsale (this is typically referred to as Abandonware, Orphanware, or\nsome other such moniker) and create new setups (installers) which\nallow these blasts from the past to function correctly on modern PC\\&amp;#039;s.\nTo achieve this, we make the best possible use of tools such as\nDOSBox, VDMSound and the ever present Windows Command Interpreter\n(when working with MS-DOS applications). Improved installers are\ncreated for older Windows based applications.\n\nThis release contains the original Microsoft Windows Entertainment\nPack for Windows 3.1. The original setup (installer) doesn\\&amp;#039;t do a very\ngood job of installing on anything later than Windows 3.11. In fact,\nthe copy that we have doesn\\&amp;#039;t even install the program group in the\nstart menu on Windows 95 or later. To solve this problem, we have\ncreated this 32-bit installer that should be compatible with all\n32-bit versions of Windows (untested on Vista). Remember, this is\n16-bit software, even though our installer is 32-bit. This may prevent\nthe software from being compatible with Vista, as we have heard that\nVista doesn\\&amp;#039;t support legacy 16-bit sofware, however, we are at present\nunsure of this. We don\\&amp;#039;t currently use Vista, and have no immediate\nplans to migrate to it. This software should function with Windows 9x,\nME, NT and XP without problems. Eventually, we will support Vista. In\nfact, we could launch DOSBox within Vista, Install Windows for\nWorkgroups 3.11 (or other 3.x Windows) into DOSBox and install the\noriginal Windows Entertainment Pack Two into that environment and it\nwould work. We have tested this method with DOSBox on Windows XP and it\nworks well and should also work with Vista as DOSBox is a 32-bit\napplication (this method is also possible within Linux using the Linux\nversion of DOSBox). Just thought we would give you a few hints on using\nlegacy 16-bit Windows software with Vista and Linux, in case the use of\nDOSBox to run Windows 3.1 had not occurred to you.\n\nThis setup creates the following DIRectories (folders):\nMy Documents\\\\Inno Setup Scripts\nMy Documents\\\\Disk Images\\\\Floppy\\\\1.44M\nMy Documents\\\\Disk Images\\\\Floppy\\\\1.2M\nMy Documents\\\\Disk Images\\\\Floppy\\\\720K\nProgram Files\\\\Microsoft Games\\\\WEP\n\nThe WEP folder is the folder where the Windows Entertainment Pack is\ninstalled. The 1.44M, 1.2M &amp; 720K folders exist as part of our goal of\npreserving the original software for posterity. Within the 720K folder\nis a floppy diskette image of the original Windows Entertainment Pack\nthat we have. It was created using WinImage 8.10.8100 directly from\nthe original floppy diskette. The 1.44M folder contains a 1.44Mb image\nof the Windows Entertainment Pack that we created from the 720Kb\ndiskette (we thought it would be convenient to have an image that\ncould be directly written to currently available floppy media without\ntoo much hassle). Both diskette images are named WEP.IMZ and require\nWinImage or other diskette image tool for manipulation. We also located\na 1.2Mb diskette of Entertainment Pack for Windows : Volume One, thus\nyou will also find a WEP.imz in the 1.2M folder. The Inno Setup\nScripts folder will contain the script used to generate this installer\nvia Jordan Russell\\&amp;#039;s Inno Setup software. This installer has been\ndesigned to completely remove itself when uninstalled, with the\nexception of the Disk Images and Inno Setup Scripts folders. These\nfolders may be safely deleted at any time, should you have no need or\ndesire for the diskette images of the original 16-bit installer and/or\nsetup scripts.\n\nThe following program group will be created:\nSTART&gt;PROGRAMS&gt;MICROSOFT GAMES&gt;WINDOWS ENTERTAINMENT PACK&gt;1\nwhich will contain the following icons (games):\nTetris (The Classic Soviet Game of blocks)\nMinesweeper (Mind Game to avoid Mines)\nCruel (Card Game)\nGolf (Card Game)\nTicTactics (Three-D Tic Tac Toe)\nTaipei (Oriental Game of Chance)\nIdleWild (Keeps your monitor looking cool)\nPegged (HI-Q Solitare Game)\nReversi 1.01 (Othello) [Microsoft Windows 1.01 Reversi -  added by PfP]\nPaint 1.01 (Microsoft Windows 1.01 Paint - added by PfP)\n\nWe are certain that it will probably annoy some people that we are\nincluding original disk images with these distributions. Other people\nwill be ecstatic. We would just like to say that in order to fulfill\nour goal, the diskette images MUST be included. Certainly, some may be\nannoyed that we are including the Paint and Reversi applications from\nWindows 1.01, Windows 2.03, Windows 3.0 and Windows 3.1. ToastyTech.com\nsucceeded in patching the Windows 1.01 and 2.03 applications so that\nthey would function with later versions of Windows. The Windows 3.x\napplications work with all later versions of Windows out of the box. We\ndecided it would be cool to include the Paint 1.01 and Reversi 1.01\nwith Entertainment Pack 1, Paint 2.03 and Reversi 2.03 with\nEntertainment Pack 2, Paint and Reversi from Windows 3.0 with\nEntertainment Pack 3 and Paint and Reversi from Windows 3.11 with\nEntertainment Pack 4 (Note: Reversi 3.11 was NOT included with Windows\n3.11, but was offered as a download from Microsoft, which is where we\ngot it).\n\nInstall and Enjoy these classic games on your modern PC! Look for more\nPfP releases, with Entertainment Pack #2 following next.\nPfP - November 1, 2007, Revised November 4, 2007\n\nThe following information is from WikiPedia:  \n\nMicrosoft Entertainment Pack\nFrom Wikipedia, the free encyclopedia\n\nDeveloper(s) \tMicrosoft\nPublisher(s) \tMicrosoft Game Studios\nDistributor(s) \tMicrosoft\nDesigner(s) \tRobert Andrews\nSeries \t        Entertainment Pack\nRelease date(s) 1990\nGenre(s) \t\nMode(s) \tSingle-player\nPlatform(s) \tWindows 3.x\n\nThe original Microsoft Windows Entertainment Pack (WEP) was a\ncollection of simply-designed computer games for Windows. These games\nwere somewhat unusual for the time, in that they would not run under\nMS-DOS. Many of the games were later released in the Best of Windows\nEntertainment Pack. There were four Entertainment Packs in the original\nseries.\n\nList of games\nHere is a complete list of the original Microsoft Windows Entertainment Pack titles:\n    * Chess\n    * Chip\\&amp;#039;s Challenge\n    * Cruel (a card game)\n    * Dr. Black Jack\n    * FreeCell (a card game)\n    * Fuji Golf\n    * Go Figure!\n    * Golf (a card game)\n    * IdleWild (a screensaver program)\n    * JezzBall\n    * Jigsawed\n    * Klotski\n    * Life Genesis (based on the Life simulation by John Horton Conway)\n    * Maxwell\\&amp;#039;s Maniac\n    * Pegged\n    * Pipe Dream (by LucasArts)\n    * Rattler Race\n    * Rodent\\&amp;#039;s Revenge\n    * SkiFree\n    * Stones\n    * Taipei\n    * Tetravex\n    * Tetris (Windows version)\n    * Tic Tac Drop (basically a Connect Four clone)\n    * TicTactics\n    * TriPeaks (a card game)\n    * Tut\\&amp;#039;s Tomb (a card game)\n    * WordZap\n\nGameSampler\nA version of the Entertainment Pack called the Gamesampler, small\nenough to fit on a single high-density disk, was shipped as the 11th\ndisk in a ten-pack by Verbatim for much of the early 1990s, allowing\nmany users to acquire them as a freebie. Games on the sampler included\nJezzball, Rodent\\&amp;#039;s Revenge, Tetris, and Skifree. A \\&quot;Best of\\&quot; disk of\nseveral of the games was also available at times as a mail-in premium\nfrom Kellogg\\&amp;#039;s cereals.\n\n    * Microsoft Entertainment Pack: The Puzzle Collection - a later\n      collection for Windows 95:\n     &lt;a href=&quot; http://en.wikipedia.org/wiki/Microsoft_Entertainment_Pack:_The_Puzzle_Collection&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Microsoft_Entertainment_Pack:_The_Puzzle_Collection&lt;/a&gt;\n    * Microsoft Arcade\n     &lt;a href=&quot; http://en.wikipedia.org/wiki/Microsoft_Arcade&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Microsoft_Arcade&lt;/a&gt;\n    * Best of Microsoft Entertainment Pack\n     &lt;a href=&quot; http://en.wikipedia.org/wiki/Best_of_Microsoft_Entertainment_Pack&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Best_of_Microsoft_Entertainment_Pack&lt;/a&gt;\n\n\nEntertainment Pack for Windows (PfP) a.k.a. Windows Entertainment Pack (WEP)\n","torrent":{"xt":"urn:btih:74dc56c146fa05c56195b460271cfb2780c8d9e2","amp;dn":"Windows+Entertainment+Pack%3A+Volume+One","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74dc56c146fa05c56195b460271cfb2780c8d9e2","infoHashBuffer":{"type":"Buffer","data":[116,220,86,193,70,250,5,197,97,149,180,96,39,28,251,39,128,200,217,226]},"announce":[],"urlList":[]}}