{"title":"The Occult History of the Third Reich - The Enigma of the Swasti","uid":4772177,"size":523718371,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:74fa92ff7fb51b9b34a11f11cc28b6a26874ee96&amp;dn=The+Occult+History+of+the+Third+Reich+-+The+Enigma+of+the+Swasti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zecarlos","files":2,"time":1237080192,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0228660/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0228660/&lt;/a&gt;\n\nIt's the second part of the documentary.\n\nThe documentary contains mainly black and white as well as some color archival footage, with narration explaining the influences of alternative belief systems (occult, paganism, mysticism, etc) on the Nazi ideology and Hitler's personal philosophy. It also documents the history and development of the ideas and symbols that would be used along with eugenicist racial politics to perpetrate the murder and oppression of millions during World War II.\n\nIn the early 20th century, the young Adolf Hitler was just one of many German-speaking people attracted by a new Germanic mythology that combined ancient legends and esoteric cosmologies with cutting-edge theories of genetic science. In the hands of the Nazis, the result was a new ideology that saw racial purity as the key to human destiny.\n\nThis was a belief-system of arcane rituals and potent symbols, with the ancient swastika appropriated for the Nazi cause. By the time of the Third Reich, Hitler and the Nazis had evolved an entirely new faith, complete with holy book, venerated relics and a priestly elite in the form of Himmler's SS. It was a religion based on obedience, power, and the cult of the leader, with Hitler himself conceived in Messianic terms.","torrent":{"xt":"urn:btih:74fa92ff7fb51b9b34a11f11cc28b6a26874ee96","amp;dn":"The+Occult+History+of+the+Third+Reich+-+The+Enigma+of+the+Swasti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74fa92ff7fb51b9b34a11f11cc28b6a26874ee96","infoHashBuffer":{"type":"Buffer","data":[116,250,146,255,127,181,27,155,52,161,31,17,204,40,182,162,104,116,238,150]},"announce":[],"urlList":[]}}