{"title":"The Monkees - Missing Links, Vol. 3 (1996)","uid":8428625,"size":300827757,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:757702b3318657f52983a37d02b7e1ddbd87479c&amp;dn=The+Monkees+-+Missing+Links%2C+Vol.+3+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":31,"time":1367428462,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nThe Monkees - Missing Links, Volume 3 (1996)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/5167QA5XHZL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/5167QA5XHZL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Mark Deming):\n\n&quot;Hey hey, we are the Monkees/You know we love to please/A manufactured image/With no philosophies.&quot; In 1968, the Monkees addressed their own reputation in the song &quot;Ditty Diego (War Chant),&quot; which summed up the bad rap they'd received in the music press since they first emerged in the summer of 1966. The Monkees were talented singers, musicians, and songwriters who made a handful of the finest pop singles of their day (as well as a few first-rate albums) and delivered exciting, entertaining live shows. But at a time when rock music was becoming more self-conscious and &quot;serious,&quot; the hipper echelons of the music press often lambasted the Monkees, largely because they didn't come together organically but through the casting process for a television series, and they initially didn't write the bulk of their own material or play all the instruments on their records. The fact they later took creative control of their music was often overlooked, and the quality of their music, which featured the work of some of the finest session players and songwriters of the 1960s, often seemed to be beside the point. Time has ultimately vindicated the Monkees, and their music still sounds fresh and engaging decades after it was recorded, but in some circles they never fully shook being branded as &quot;the Pre-Fab Four,&quot; no matter how far they moved from the circumstances that brought them together.\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/the-monkees-p4940/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/the-monkees-p4940/biography&lt;/a&gt;\n\nAll Music Album Review (by Richie Unterberger):\n\nRhino treats the Monkees' catalog with a seriousness akin to the Beatles' Anthology series, but it's nonsense to pretend that the group's outtakes and rarities are deserving of such fanatical scrutiny. There are a lot more than anyone suspected, though, and Missing Links, Vol. 3 presents 24 more, again proving that the bottom of the Monkees' barrel has the same mixture of fun and boredom as hiding in a barrel as a stowaway. There are too many trivial cuts here from the late '60s -- that goes for both the slight pop/rockers and Nesmith's less slight country-rockers. On the other hand, there are some good 'uns, like the Dolenz-sung acoustic 1967 demo &quot;She'll Be There,&quot; which recalls early British Invasion acts like Peter &amp; Gordon; different/rare mixes/takes of &quot;Circle Sky&quot; (one of Nesmith's best compositions), Jeff Barry's &quot;She Hangs Out,&quot; and Neil Diamond's &quot;Love to Love&quot;; &quot;How Insensitive,&quot; Nesmith's imaginative country rearrangement of an Antonio Carlos Jobim (!) standard; and &quot;Merry Go Round&quot; and &quot;Zor and Zam,&quot; insanely experimental outings for a teeny bopper group. Thrown into the mix are novelties like commercials and an Italian version of the Monkees' theme: icing the cake with an inconsistency that makes the nearby presence of a CD remote button a necessity.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/missing-links-vol-3-r233079/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/missing-links-vol-3-r233079/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B0000033MS&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B0000033MS&lt;/a&gt;\n\nTrack List:\n\n01. Theme From The Monkees (TV Version - Mono)\n02. Kellogg's Jingle (Mono)\n03. We'll Be Back In A Minute (Stereo)\n04. Through The Looking Glass (Alternate Version - Stereo)\n05. Propinquity (I've Just Begun To Care) (Stereo)\n06. Penny Music (Stereo)\n07. Tear The Top Right Off My Head (Mono)\n08. Little Red Rider (Stereo)\n09. You're So Good (Stereo)\n10. Look Down (Stereo)\n11. Hollywood (Stereo)\n12. Midnight Train (Demo Version)\n13. She Hangs Out (Single Version - Mono)\n14. Shake 'Em Up (Stereo)\n15. Circle Sky (Studio Version - Alternate Mix - Mono)\n16. Steam Engine (TV Version - Mono)\n17. Love To Love (Alternate Mix - Stereo)\n18. She'll Be There\n19. How Insensitive (Stereo)\n20. Merry Go Round (Mono)\n21. Angel Band (Stereo)\n22. Zor And Zam (TV Version - Mono)\n23. We'll Be Back In A Minute #2 (Stereo)\n24. Tema Dei Monkees (Italian Version - Mono)\n","torrent":{"xt":"urn:btih:757702b3318657f52983a37d02b7e1ddbd87479c","amp;dn":"The+Monkees+-+Missing+Links%2C+Vol.+3+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"757702b3318657f52983a37d02b7e1ddbd87479c","infoHashBuffer":{"type":"Buffer","data":[117,119,2,179,49,134,87,245,41,131,163,125,2,183,225,221,189,135,71,156]},"announce":[],"urlList":[]}}