{"title":"Knightfall (Complete) (No ads)","uid":7826521,"size":255463242,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:75b46bc735e1788009019be9f468d3c8e9a607cb&amp;dn=Knightfall+%28Complete%29+%28No+ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1352941151,"description":"Knightfall is the title given to a major Batman story arc published by DC Comics that dominated Batman-related serial comic books in the spring and summer of 1993. Knightfall is also an umbrella title for the trilogy of storylines that ran from 1993 to 1994:  Knightfall; Knightquest; and KnightsEnd. Collectively, they are unofficially known as the KnightSaga.\n\nThe Knightfall story takes place over approximately six months. Bruce Wayne (Batman) suffers burnout and is systematically assaulted and crippled by a super steroid-enhanced genius named, Bane. Wayne is replaced as Batman by an apprentice named Jean-Paul Valley, who becomes increasingly violent and unstable, tarnishing Batman's reputation. Eventually, Wayne is healed through paranormal means, and reclaims his role as Batman.\n\nKnightfall resulted in long-term ramifications for the Batman mythos, as Batman's trust from the police, the public, and fellow superheroes had to be rebuilt. Additionally, Wayne realizes the peril and burden of attempting to work in solitude, leading to the eventual creation of the modern incarnation of the Batman family. The events of Knightfall also led to the resignation of Wayne's loyal butler, Alfred Pennyworth.\n\nThis torrent was created to honor a request.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and authors/artists/publishers,) please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:75b46bc735e1788009019be9f468d3c8e9a607cb","amp;dn":"Knightfall+%28Complete%29+%28No+ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75b46bc735e1788009019be9f468d3c8e9a607cb","infoHashBuffer":{"type":"Buffer","data":[117,180,107,199,53,225,120,128,9,1,155,233,244,104,211,200,233,166,7,203]},"announce":[],"urlList":[]}}