{"title":"Mind Games Pro v2.2.0 (Ad free)","uid":13695571,"size":12535721,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:76712a93ddba71b8261a6aa2cf7ef0388f10dcb3&amp;dn=Mind+Games+Pro+v2.2.0+%28Ad+free%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1456690038,"description":"Exercise Your Brain! \r\n\r\nMind Games is a great collection of games based in part on principles of cognitive psychology to help you practice different mental skills. This app includes all of Mindware’s brain exercising games. All games include your score history and graphs of your progress. The main app shows a summary of your best games and today’s scores on all games. Using some principles of standardized testing, your scores are also converted to a comparison scale so that you can see where you need work and excel. The Training Center selects games for you to play in order to maximize your progress and enjoyment. \r\n\r\nMind Games Pro is intended to be brain challenging entertainment. No scientific research has yet been conducted to determine if this app has cognitive benefits. Many users of the app report finding it helpful and challenging as you can see in the user comments.\r\n\r\nDescription of Games and Theorized Abilities:\r\n\r\nAbstraction - Exercise your ability to quickly differentiate between words with a concrete vs. abstract meaning.\r\n\r\nAttention Training Game - Exercise your brain's attention. Based on the flanker attention task. Practice your ability to ignore competing information and processing speed.\r\n\r\nAnticipation - Practice your ability to anticipate and respond rapidly.\r\n\r\nChanging Directions - Practice your attention, concentration, processing speed, and mental flexibility.\r\n\r\nDivided Attention I - Practice your ability to divide your attention and respond rapidly.\r\n\r\nFace Memory - Memorize a group of faces and then see if you can recall them.\r\n\r\nMath Star - Practice your basic arithmetic skills.\r\n\r\nMemory Racer - Practice for your brain's working memory and processing speed.\r\n\r\nMemory Span - Practice your verbal and nonverbal working memory to increase the span of your immediate memory.\r\n\r\nMemory Flow - Practice your visual and verbal memory for the flow of events.\r\n\r\nMemory Match - Practice your memory for completed tasks.\r\n\r\nMental Categories - Practice your processing speed and quick categorization skills.\r\n\r\nMental Flex - Practice your cognitive flexibility and ability to ignore competing information.\r\n\r\nPath Memory - Practice your ability to memorize and reproduce paths.\r\n\r\nSerial Memory - Learn a series of 10 numbers and faces in as few trials as you can.\r\n\r\nSelf-Ordered Learning for Objects - Memorize a sequence of objects using a sequence you determine.\r\n\r\nSpatial Memory - Memorize the locations of the tiles that flip over with increasing numbers of tiles.\r\n\r\nSpeed Trivia - Test and improve your knowledge of general trivia and information.\r\n\r\nVocabulary Star - Improve your vocabulary and spelling skills.\r\n\r\nVocabulary Power - An un-timed multiple choice vocabulary task.\r\n\r\nVisual Memory - Test and practice your visual memory skills.\r\n\r\nWord Memory - Memorize 30 words and see if you can remember them.\r\n\r\n\r\nThis is the unlimited, ad-free, version of the hit brain training app. \r\n\r\nMind Games Pro is also available on iPhone/iPad, Windows 8.1, and Windows Phone 8.\r\n\r\nLanguages available: English, Portuguese, Spanish, French, German, Arabic, Russian.\r\n\r\nWhat’s new:\r\nExercise Your Brain!\r\n2.2.0 Russian language translation added.\r\n2.1.9 Stay up to day with latest news on brain research with the new Brain News feature (English only).\r\n2.1.8 Challenge yourself with the exciting new game called Changing Focus in this release. Also added new age ranges and the ability to turn off comparison scores.\r\n\r\nRequired Android O/S : 2.2+","torrent":{"xt":"urn:btih:76712a93ddba71b8261a6aa2cf7ef0388f10dcb3","amp;dn":"Mind+Games+Pro+v2.2.0+%28Ad+free%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76712a93ddba71b8261a6aa2cf7ef0388f10dcb3","infoHashBuffer":{"type":"Buffer","data":[118,113,42,147,221,186,113,184,38,26,106,162,207,126,240,56,143,16,220,179]},"announce":[],"urlList":[]}}