{"title":"VOX (Alpha v0.40) -[GIBZ]","uid":9156949,"size":39270009,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:76d4045b4770c6eeeda9c106242dd461708a5d0c&amp;dn=VOX+%28Alpha+v0.40%29+-%5BGIBZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prototype.06","files":-1,"time":1383793313,"description":"This is - VOX (Alpha v0.40)\n\n&quot;Finally after months, the new Vox update is available and contains a MASSIVE amount of new features and content and upgrades. Most notable is the overhauled GUI and HUD and vast improvements to the crafting system.&quot;\n--------------------------------------\n\nDescription:\nA voxel based adventure and RPG. Vox is a highly customizable game where you can create, destroy, edit and build anything you desire. The whole world, every item and object within it, and even the characters and inhabitants of Vox are created using a custom 'Voxel Engine' that allows for an unparalleled level of creativity. Come and explore your imagination!\n\n&quot;NOTE: This game is not a clone/ripoff of Minecraft, Cube World, InfiniMiner or any other voxel based game. It is an original game being developed using the voxel/block style of rendering and features some voxel/block based gameplay.&quot;\n\n\n\n\nHere is the (MASSIVE) list of the full patch notes:\n\nNew Features:\nFog rendering for far distances.\nBetter biome generation.\nBetter enemy and item spawning.\nEnemies can spawn in different biomes.\nProper 'Alive times' on tombstones.\nPulldown menu for particle effects in the creation editor.\nAdd fire status effect to weapons and attacks\nEnemy sonar shots (purple concentric rings).\nBats now fire sonar projectiles as an attack.\nNPCs attack back enemies that are harassing them.\nBetter trees and scenery for intro.\nInclude seconds on tombstones.\nMultiplayer Lobby screen.\nMultiplayer coding - threads and sockets.\nMultiplayer configuration IP/port/etc added to configuration manager.\nAdd support for UDP as well as TCP communications.\nGame chat available once joined a multiplayer game from the lobby.\nPlayer Idle flag. Dont do same idle animation if we are already idle\nOnline player nameplates.\nProper animations used by online players.\nBlock explosions sent over multiplayer.\nSending shots across the network in multiplayer.\nDon't spawn block items on clients.\nBetter fire wand accuracy.\nDamage and respawning sent over the network.\nBetter creating and freeing of OnlinePlayer class data.\nBetter respawn handling for players joining an existing game.\nDon't send refresh request to serverlist if we are not in the multiplayer lobby.\nAdd a leave game button to the multiplayer lobby.\nBetter world seeding for multiplayer synch support.\nSending game params over multiplayer games.\nRendering Online Players on the minimap.\nDropped collection blocks are scaled sensibly.\nCollectable blocks dont stay in the world forever - disappear after a time.\nReduce the magic cost of fire wand.\nRemove combat slow time during jump attacks.\nAdd equip change support for multiplayer.\nRemove chat textbox focus when we leave the lobby.\nAllow reset focus functionality on master GUI class.\nAlso add helmet and shoulder items to online players.\nAdd scale and offset to online player body and weapon/item rendering.\nSend health for online players that have already spawned.\nBuilding with world blocks in multiplayer!\nSpawn block explode particle effects when other online players destroy blocks.\nAdd arrows to multiplayer.\nSend velocity with shots.\nAllow clients to update shot velocity.\nBetter player disconnection handling.\nHandle clients crashing out of a game.\nHandle server disconnecting from the clients point of view.\nScenery objects get dropped when world scenery is destroyed.\nScenery creation over multiplayer.\nTyping into the chat window from within the game.\nEnter key to start typing a message.\nArrows and shots disappear on the client after a delay of no data being sent from host.\nAdd items to multiplayer traffic.\nClient items created on host when clients drop them from inventory.\nSend interact presses from online players.\nOnline players HUD display render.\nProper scale x,y,z offsets for network sent items.\nProper tombstones on clients and hosts.\nPicking up items on the client during a multiplayer game now works.\nSending melee attackings over multiplayer games.\nRemoving items from clients when the host erases them, for whatever reason.\nBombs in multiplayer.\nDynamic texture support for icons in the GUI - paperdoll.\nQuest GUI improvements, Rewards, Quest tabs, Quest text.\nHealth up animation as player is respawning.\nQuest rewards and reward information on quest GUI.\nBetter quest journal. only record the last 5 quests in proper completed order.\nCastle parts are now made out of stone block types.\nProper animation state for using the rocket boots.\nUnderground indestructable blocks at bottom of world.\nBetter shadow rendering, additional simplified meshes for shadows.\nMirror mode in creation editor.\nNPC set type in constructor.\nSupport for idle miner NPCs.\nRemove item interaction code for NPCs.\nArrow buttons for model rotation on the character GUI paperdoll.\nSmooth player facing rotations, twist and turn when changing direction of movement.\nMake the create custom character screen use the creation GUI - shared code.\nAdd coins and money display to the new GUI design.\nCreate dropped item from quest reward, if inventory is full.\nRandom ore rotation.\nVapid Mask and Indie Beard cameo items added to random loot.\nReduce actionbar slots to 6.\nRemove all transition animations from the HUD.\nUse proper SSAO rendering for dynamic textures in the HUD - characters, portraits, item icons, etc.\nSSAO rendering for companion HUD portraits.\nItems and bombs get affected by blast radiuses.\nReset button in the weapon editor.\nDrag items to the Weapon editor window for quick editing.\nAllow crafting GUI to be opened from the inventory.\nCrafting recipes when openeing the crafting GUI from the inventory\nBetter primitive block types for wood, stone, grass, sand, dirt, rock.\nCactus blocks.\nLeaf blocks.\nSnow blocks.\nExploding arrows now make an explosion sound effect when blowing up.\nImprovements to the create character screen.\nBetter common button icons.\nImproved GUI and HUD textures and functionality - Offsets and label colour changes.\nBetter popups for select world screen.\nConfirm/cancel on delete world button.\nTutorial and introduction help guide added for new characters.\nTutorial prompt added to select world screen.\nCompleted tutorial stat added to player profile.\nBetter world create screen.\nDifferent World types - tutorial, story, creative, hardcore.\nRe-enable depth of field renderer.\nAllow non-SSAO rendering.\nBetter shadow and SSAO rendering.\nVastly improved item library screen, proper scrollbar for items.\nMove characters directory out of export folder, for better item library functionality.\nChange terminology for left/right weapons to left/right hands.\nSort out proper left and right handedness.\nEquipment highlight icon shown on paperdoll screen to show where to equip.\nEquipment highlight also shown from lootGUI.\nProper edit and delete background textures.\nAllow 10 letters for character name, up from 8.\nAdd folder display to the item library.\nAdd folder and up folder icons to item library screen.\nFaster 'reload' time when placing scenery - allows faster placement of multiple scenery.\nWhen crafting items with a full inventory, items get dropped on ground.\nRemove HUD buttons for inventory, character stats and quest journal.\nCrafting GUI - improved handling of draggable buttons and button label management.\nAdd crafting bench.\nNew crafting recipes added to all crafting stations.\nMake sure to remove crafting items before adding to inventory.\nBetter GUI rendering, allow for more depth for GUI Windows!\nSupport for connecting and disconnecting to the server list.\nAllow multiplayer games to be created and hosted even when not connected to server list.\nAllow for joining games via direct IP address entered.\nOpen chatGUI when connected to multiplayer games.\nChat GUI in the multiplayer lobby screen.\nConnect To IP window and controls on multiplayer lobby screen.\n'Other' window on create character screen for other character params.\nReset default button added - Create character screen.\nRandomzie button added - Create character screen.\nPresets pulldown added - Create character screen.\nIncrease fidelity of create character sliders.\nAdd snow biome and snow world objects.\nBetter tress and more variety of trees generated.\nTree stumps.\nBetter block detection for creation mode - More precision on mouse cursor.\nBetter loading screen - Graphics and progress bar improvements.\nRemove front-end transition animations.\nDon't spawn NPCs and quests givers in multiplayer games.\nAdd create game dialog box popup to multiplayer lobby screen.\nDifferent game modes and server params when creating multiplayer games.\nAdd gametype and max players to server game param data send.\nAdd the filename textbox to the voxel editor in ItemLibrary.\nMake new directories if not exists when saving voxel objects.\nShow the filename textbox if we are using the voxel editor from the item library.\nNew crafting items - Slime jelly, bones, bee wings and bat fangs.\nMake sure to use shadow shader on frontend graphics.\nLots of new audio effects and tidy up lots of sound effects.\nPlayer hit sound effects - different for sword skeletons.\nBetter organisation of GUI windows opening and closing.\nStop intro music when launching multiplayer games.\nUse proper character name, or multiplayer name in chat GUI.\nClear biome data on game mode changes.\nOnly erase when wing animation has finished on flyign enemies.\nMax load distance value used in the chunk manager.\nBetter load and draw distance management for chunks.\nAdd max load distance to the options menu.\nIf in multiplayer game return the multiplayer name as the player name.\nSnow/Tundra scenery flowers and grass.\nDont import or export chunk data in multiplayer games.\n\n+ TONS OF BUGFIXES!!!!!\n\n\n\nMinimum Requirements:\nOS : Windows XP \nProcessor: 1.6 Ghz \nMemory : 1GB RAM \nGraphics : DX9.0c compatible graphics card, capable of running shaders. \nDirectX : 9.0c or Greater \n\n\n--------------------------------------\n*Absolutely 100% clean and working!*\n*My upload ain't the best, but I'll seed this forever!*\n*BUY the games you reallllly dig!!!*\n\n**Check my profile for more TPB-exclusive indie games!!!**","torrent":{"xt":"urn:btih:76d4045b4770c6eeeda9c106242dd461708a5d0c","amp;dn":"VOX+%28Alpha+v0.40%29+-%5BGIBZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76d4045b4770c6eeeda9c106242dd461708a5d0c","infoHashBuffer":{"type":"Buffer","data":[118,212,4,91,71,112,198,238,237,169,193,6,36,45,212,97,112,138,93,12]},"announce":[],"urlList":[]}}