{"title":"Don Henley - Inside Job (2000)  FLAC","uid":4322383,"size":487811067,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:76e32bfa574140834f34ef88cb8869869922042d&amp;dn=Don+Henley+-+Inside+Job+%282000%29++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eastern876","files":14,"time":1217555914,"description":"**********  PLEASE HELP SEED WHEN YOUR DOWNLOAD IS COMPLETE.  **********\n\nEditorial Reviews\nAmazon.com\nOften taken to task for the maudlin mellowness of his back catalog, Don Henley&amp;#039;s viewpoint on Inside Job is frequently as astringent as any of the best of his solo work, if refreshingly more stylistically diverse. Whether skewering the self-absorbed target of &quot;Nobody Else in the World but You&quot; with some welcome funk or lambasting the corporate co-opting of Mother Nature in &quot;Goodbye to a River,&quot; Henley still wears his heart proudly on his sleeve. But the changes in his life have also blunted a previous propensity for self-righteousness into something more akin to subtle, resigned irony, and this album wears it well, especially on strangely downbeat &quot;celebrations&quot; like &quot;For My Wedding.&quot; Featuring a typically all-star cast of guest musician pals (including Stevie Wonder, Randy Newman, Glenn Frey, and Heartbreakers Mike Campbell and Benmont Tench), coproducer Stan Lynch (formerly of Tom Petty&amp;#039;s Heartbreakers) has helped Henley fashion a more timeless, deftly shaded production envelope that should age better than most. Though he still can&amp;#039;t help lament his world&amp;#039;s hardening and loss of innocence (to the point of &quot;They&amp;#039;re Not Here, They&amp;#039;re Not Coming,&quot; echoing Randy Newman&amp;#039;s &quot;Trouble in Paradise&quot; nostalgic plea to &quot;bring back the Duke of Earl&quot;), Henley does it here with a subtle grace that may just win him a few new, late-blooming fans. It&amp;#039;s an album that underscores how quickly life&amp;#039;s fine wine can unexpectedly turn to vinegar. --Jerry McCulley\n\n**********  PLEASE HELP SEED WHEN YOUR DOWNLOAD IS COMPLETE.  **********\n","torrent":{"xt":"urn:btih:76e32bfa574140834f34ef88cb8869869922042d","amp;dn":"Don+Henley+-+Inside+Job+%282000%29++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76e32bfa574140834f34ef88cb8869869922042d","infoHashBuffer":{"type":"Buffer","data":[118,227,43,250,87,65,64,131,79,52,239,136,203,136,105,134,153,34,4,45]},"announce":[],"urlList":[]}}