{"title":"Sexually Broken--Tiny little Penny Pax huge black cock Matt Will","uid":9252177,"size":923422946,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:76f39244de52a767b70cffd92bbdf1b7aa882288&amp;dn=Sexually+Broken--Tiny+little+Penny+Pax+huge+black+cock+Matt+Will&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"merzedes","files":-1,"time":1385483802,"description":"Tiny little red head, Penny Pax takes on huge black cock, brutal deep throating massive orgasms! | Penny Pax | Matt Williams\n\nNovember 25, 2013\n\n\nMP4 only.\n\n\nLittle Penny Pax returns to the pages of the hottest Bondage and Rough Sex (BaRS) site in the world, Sexually Broken. This tiny redhead with huge natural breasts is one of our favorites. Today, Penny is going to get her tight little throat fucked without mercy by two hard cocks.\n\nPenny is bound to a chair, legs spread, hair tied back, neck tied down, with arms trapped behind her. Her bondage pushes her forward so much that her mouth is at a perfect height for a brutal skull fucking. She can't move forward or back, her throat is completely helpless. \n\nThe first thing we do is hold her tongue out of her mouth with a Japanese tongue trap. Now it is just a straight shot into her mouth and down her throat with 2 big cocks. Starting slow, we fuck her face and build until Penny is a drooling, dazed, crosseyed slut. We skull fuck Penny into subspace, controlling her air intake with cock. She gets air when we want her to, it doesn't take long for Penny's eyes to glass over with that &quot;completely helpless&quot; look. We push our cock all the way down her throat, all she can do is beg with her pretty blue eyes for air.\n\nWe yank Penny out of the chair and bind her to the floor, legs spread and neck tied back. We get on top and continue the brutal face fucking. Penny is just a mindless drooling mess while cock rams the back of her throat over and over. A vibrator locked directly on to her clit keeps her coming. The sound a girl makes cumming while she has a cock jammed deep in her throat is the most wonderful sound on the planet. It is a desperate sound of helplessness, despair and panic, all wrapped in gut wrenching animalistic guttural sound of bliss. It's just wonderful. \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/11_25ppax5/SexuallyBroken-Penny-Pax-Matt-Williams-Tiny-little-red-head-Penny-Pax-takes-on-huge-black-cock-brutal-deep-throating-massive-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/11_25ppax5/SexuallyBroken-Penny-Pax-Matt-Williams-Tiny-little-red-head-Penny-Pax-takes-on-huge-black-cock-brutal-deep-throating-massive-orgasms.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:76f39244de52a767b70cffd92bbdf1b7aa882288","amp;dn":"Sexually+Broken--Tiny+little+Penny+Pax+huge+black+cock+Matt+Will","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76f39244de52a767b70cffd92bbdf1b7aa882288","infoHashBuffer":{"type":"Buffer","data":[118,243,146,68,222,82,167,103,183,12,255,217,43,189,241,183,170,136,34,136]},"announce":[],"urlList":[]}}