{"title":"World of Tanks - EU - v0.7.3 - Full Client","uid":7252050,"size":3017550982,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:785cb139861ac27c84a4179e1c26719741a32b18&amp;dn=World+of+Tanks+-+EU+-+v0.7.3+-+Full+Client+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_vole","files":1,"time":1336435931,"description":"List of changes between versions 7.2 and 7.3:\n\n*  Two new maps Dragon's Ridge (first Asian map) and South Coast (a Crimea resort place) have been added.\n*  KV-3 moved from tier 6 to tier 7 as a Soviet heavy tank, and rebalanced.\n*  T-150 substitutes KV-3 as a Soviet heavy tank tier 6.\n*  KV-4 added as a Soviet tier 8 heavy tank.\n*  ST-I added as a Soviet tier 9 heavy tank.\n*  IS-4 moved from tier 9 to tier 10 in Soviet tech tree and rebalanced.\n*  IS-8 substitutes IS-4 as a Soviet tier 9 heavy tank.\n*  KV divided into KV-1 and KV-2. KV-2 becomes a Soviet tier 6 heavy tank.\n*  Added previously tested French premium vehicles to the game store: tier 3 tank destroyer FCM 36 Pak 40 and tier 4 SPG 10.5 ?m leFH18 B2.\n*  Fixed and reworked visual models of T25/2, PzKpfw VI Tiger, KV-3, T32, T30, T-46, KV-5, Object 704.\n*  Fixed and reworked damaged models of M18 Hellcat, T32, T30, Ferdinand, KV-5, T-43, T-54.\n*  Fixed some errors in the IS-4 damaged model: the gun mantlet thickness was increased from 200mm to 250mm, the glacis (upper frontal armor plate) slope was increased from 58 degrees to 61 degrees.\n*  Combat levels for tier 5 heavy tanks reduced by 1.\n*  Fixed the display of M103 front armour in the game interface.\n*  Fixed the undersized research cost of T49 from M8A1.\n*  Fixed the cost of suspension in TD T82.\n*  Fixed the incorrect cost of radio station FuG 37.\n*  Fixed a rare bug with base capture proceeding even though a shell falls between the two tanks capturing the base.\n*  Fixed a rare bug with where incorrect experience was distributed amongst crew members during active &quot;Accelerate crew training&quot; option.\n*  Fixed the bug when a skill pop-up hint disappeared, if the skill is 0% trained.\n*  Fixed the &quot;black terrain&quot; graphics display for back issue Radeon video cards.\n*  Fixed minor interface errors in the tank company window.\n*  Extended text descriptions of perks and skills.\n*  Fixed names of several American HE shells.\n*  Added clan logos display on tanks.\n*  Fixed the issue with non-destruction of antitank hedgehogs (Komarin map) when hit with HE shells in some cases.\n*  Fixed non-receipt of Fadin's Medal for tanks with autoloader mechanism.\n*  Added view of ammunition rack explosion to vehicle over target markers.\n*  Fixed several bugs with crew training.\n*  Fixed mouse inversion operation in SPG view mode.\n*  Fixed disappearance of indicator showing distance to a vehicle in reticle.\n*  Removed some special modules for top tanks from store.","torrent":{"xt":"urn:btih:785cb139861ac27c84a4179e1c26719741a32b18","amp;dn":"World+of+Tanks+-+EU+-+v0.7.3+-+Full+Client+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"785cb139861ac27c84a4179e1c26719741a32b18","infoHashBuffer":{"type":"Buffer","data":[120,92,177,57,134,26,194,124,132,164,23,158,28,38,113,151,65,163,43,24]},"announce":[],"urlList":[]}}