{"title":"RailWorks 3 - Class 86","uid":7190616,"size":74402687,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:789e334ad9422ee993d2f273105de563d54b6520&amp;dn=RailWorks+3+-+Class+86&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SH0CK90","files":-1,"time":1334606092,"description":"The Class 86 is a powerful locomotive from the early days of electric main line traction in Britain. Originally known as AL6 (the 6th design of AC locomotives) under the earlier BR classification, the Class 86 was built to operate on the then newly-electrified West Coast Main Line, and formed part of the effort replace steam locomotives by 1968. Throughout the 1970s the Class 86 was used on express passenger services as well as freight but with the demand for electric locomotives increasing, by the 1980s the need for a standard fleet saw all the Class 86s fitted with improved suspension giving them greater operational flexibility. In the late 1980s to early 1990s the majority of Class 86/4s were dedicated to freight activity and the majority of Class 86s are now owned by Freightliner. The Class 86 for RailWorks 3 comes with two Freightliner liveries as well as RailFreight Grey, Rail Express Services and BR Blue liveries. Also included are new FSA flat wagons and Mk2 coaches. PLEASE NOTE that in order to play the scenarios in this add-on, you must already have the West Coast Main Line Expansion Pack (available separately). The Class 86 locomotive can be operated on any line with overhead electrification, and the Mk2 coaches and FSA wagons can be used on any line, by adding them via the editor on the route you wish to run them on.\n\n\nIncludes:\nClass 86 locomotive in Freightliner Green livery\nClass 86 locomotive in Freightliner Powerhaul livery\nClass 86 locomotive in Rail Express Systems livery\nClass 86 locomotive in RailFreight Grey livery - 6 different sectors\nClass 86 locomotive in BR Blue livery\nBritish Rail Mk2 First Corridor, Second Open and Brake Second Open coaches\nFSA container bogie wagons\n\n6 West Coast Main Line scenarios including 3 Career System scenarios. Players must already have the West Coast Main Line Expansion Pack (available separately) in order to play the scenarios in this pack.","torrent":{"xt":"urn:btih:789e334ad9422ee993d2f273105de563d54b6520","amp;dn":"RailWorks+3+-+Class+86","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"789e334ad9422ee993d2f273105de563d54b6520","infoHashBuffer":{"type":"Buffer","data":[120,158,51,74,217,66,46,233,147,210,242,115,16,93,229,99,213,75,101,32]},"announce":[],"urlList":[]}}