{"title":"Craig Armstrong &amp; AR Rahman - Elizabeth: The Golden Age (Mus","uid":8414809,"size":116671459,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:78a79239f5cb09ff7708c3bebaa253995f8242ba&amp;dn=Craig+Armstrong+%26amp%3B+AR+Rahman+-+Elizabeth%3A+The+Golden+Age+%28Mus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rassouli5","files":-1,"time":1367003800,"description":"Elizabeth: The Golden Age: Music From The Motion Picture is the original soundtrack of the 2007 film Elizabeth: The Golden Age directed by Shekhar Kapur starring Cate Blanchett and Geoffrey Rush. The original score was composed by A. R. Rahman and Craig Armstrong.\n\nRahman and Armstrong worked on the score after jamming sessions in the studio. The score was recorded in Scotland, in Armstrong's studio in Glasgow. Kapur was thrilled to have both Armstrong and Rahman working together on the music, saying it was fascinating to watch &quot;two people with totally different backgrounds and cultures&quot; interact.\n\nCate Blanchett had travelled to India in the early 2000s, coming away with several Indian sounds, and badgered Kapur to get Rahman to score Hollywood movies. Antonio Pinto was mentioned as being a collaborator during production, but later Armstrong joined the project. In January 2009, he expressed regret that other compositions from A. R. Rahman were not used in the film, feeling that the score of Golden Age was not half as good as it could have been. He expressed hope to hear these pieces appear in another project.\n\n&quot;Opening&quot; from the score was used in the BBC's coverage of the Single's Finals at the 2008 Wimbledon Championships. &quot;Storm&quot; was used in the trailer of Man of Steel (film).\n\nBitrate: 320kbps","torrent":{"xt":"urn:btih:78a79239f5cb09ff7708c3bebaa253995f8242ba","amp;dn":"Craig+Armstrong+%26amp%3B+AR+Rahman+-+Elizabeth%3A+The+Golden+Age+%28Mus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78a79239f5cb09ff7708c3bebaa253995f8242ba","infoHashBuffer":{"type":"Buffer","data":[120,167,146,57,245,203,9,255,119,8,195,190,186,162,83,153,95,130,66,186]},"announce":[],"urlList":[]}}