{"title":"PC Ã‚Â» CALL OF DUTY 7 - BLACK OPS directplay by globe@","uid":5948501,"size":4707259029,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:78dcccb9ea37a4021e0b2732105937189a912ad6&amp;dn=PC+%C3%82%C2%BB+CALL+OF+DUTY+7+-+BLACK+OPS+directplay+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"globeplus","files":-1,"time":1289456021,"description":"* Hello PC games fans ...\n\n\n* Play the new Call Of Duty game ...\n\n\n* The freeware FREEARC is needed to extract the arc file\n\n\n* FILE INFO : COMPLETE SINGLE PLAYER , NO MULTIPLAYER OR ZOMBIES WORKING\n\n\n* Overview : [text extracted from wikipedia] *\n\nBlack Ops is a first-person shooter. The player assumes the role of a foot soldier and thus has access to various firearms, of which two at a time can be \ncarried, as well as explosives such as grenades and other equipment to fight enemies. When players are close enough to an enemy, they can perform a melee \nattack which ensures a one-hit-kill. A character can be positioned in one of the three stances: standing, crouching, or prone; each affecting the character's rate \nof movement, accuracy, and stealth. The player can directly dive prone from a standing position. The player can momentarily run faster before getting tired. \nWhen the character has taken damage, the screen glows red. Health regenerates by avoiding damage. When the character is within the blast radius of a live grenade, a marker indicates the direction of the grenade, helping the player to either flee or throw it back. The game features a variety weapons such as crossbows (with alternative explosive ammunition), Dragon's Breath rounds and ballistic knives.\n \n* Campaign : *\n \nThe player assumes the role of various characters during the single-player campaign, changing perspectives throughout the story. The playable characters are special forces operatives conducting black operations behind enemy lines. In this way, the player's characters have their own traits such as voices and shadows. Each mission features a series of objectives that are displayed on the heads-up display, which marks the direction and distance towards and from such objectives. The player is accompanied by friendly troops who cannot be issued orders. Although primarily a first-person shooter, the player pilots a Hind helicopter and guides friendly troops from a SR-71 Blackbird reconnaissance aircraft.The campaign is filled with scriptedcinematic moments. One of them is a bullet time effect during the &quot;Victor Charlie&quot; level, activated when the player fires toward the last enemy of a Viet Cong squad .\n\n\n\nMinimum System Requirements:\n============================\n\n- OS: Windows Vista/XP/7\n- Processor: Intel Core2 Duo E6600 or AMD Phenom X3 8750 or better\n- Memory: 2GB\n- HDD: 12GB\n- Video: Shader 3.0 or better 256MB NVIDIA GeForce 8600GT/ATI Radeon X1950Pro or better\n- Sound: DirectX 9.0c-compatible\n- DirectX: 9.0c\n\n\n\n\n\n* enjoy ... *\n","torrent":{"xt":"urn:btih:78dcccb9ea37a4021e0b2732105937189a912ad6","amp;dn":"PC+%C3%82%C2%BB+CALL+OF+DUTY+7+-+BLACK+OPS+directplay+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78dcccb9ea37a4021e0b2732105937189a912ad6","infoHashBuffer":{"type":"Buffer","data":[120,220,204,185,234,55,164,2,30,11,39,50,16,89,55,24,154,145,42,214]},"announce":[],"urlList":[]}}