{"title":"Legends.of.Dawn-SKiDROW","uid":8620879,"size":7908047897,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7943b9aeb728f7f8334e50a369289973e14523aa&amp;dn=Legends.of.Dawn-SKiDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"Mr.Stifmeister","files":-1,"time":1372367329,"description":"\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nLegends of Dawn (c) DreaMatrix\n\n27-06-2013......Release Date - Protection.................Steam\nRPG................Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nFresh out of the lair of Dreamatrix Game Studios, Legends of Dawn\ninvites players to the brutal northerly reaches of Narr. Survival\ndepends on you, your magic and your sword.\nWhat sets Legends of Dawn apart, is the freedom of play expressed in\nseveral key attributes that are rarely seen in typical RPG genres. We\nhave poured our passion and creativity into taking you on an\nenthralling ride away from wearisome reality, by providing you with\nthe choice to be whatever your heart desires, in Legends of Dawn.\n\nOf course, the choices you make during game play does not prevent you\nfrom trying something else later, or simultaneously if you wish. You\ncould combine the sword and the magic, be a powerful crafter or\nanything else. Legends of Dawn liberates from class restrictions\nunlike real life. Class, race and differences exist within the game\nbut after choosing your own race and gender, all else can be altered\nwithout restarting the game.\n\nAnother quality that makes Legends of Dawn interesting, is the freedom\nof direction and movement. Most games force a player to follow the main\nstoryline and forbid any deviation, or significant veering off the set\ncourse. Legends of Dawn is more sympathetic to your playing needs. You\nare free to wander wherever tickles your fancy within the continent,\nwithout limitations, under one condition. Stay alive. We have been\ncareful to ensure that the quests only suggest, rather than impose\ndirection of movement. Your journey is in your hands alone.\n\nIn addition to all those remarkable features already mentioned, you\nare bound to notice another cool thing about Legends of Dawn. The\nabsence of loading screen. It would have been so much easier to create\na game that would constantly force you to wait before the screen while\nnew contents load, but Dreamatrix is aware that your time is too\nvaluable to waste. We put our heads together and created our very own\nengine that discreetly streams content in the background, in real time.\nYou are free to enter houses, caves, dungeons, temples, new regions and\nso much more, without those pesky loading screens interrupting your\nplaying pleasure.\n\nIn order to provide you with such blissful range of possibilities,\nwe had to create a rather large world called Narr. The world of Narr\nin Legends of Dawn, spans across continents through stunning\npicturesque landscape that stimulates the mind. There are magical\nregions where the mountains and hills defy gravity, buoyant as\nballoons. We have also created countless dungeons awaiting for you\nto discover what mysteries lie within their cold depths, as well as\ncamps, impressive docks and grim fortresses that bear silent witness\nto battles. Mausoleums and cemeteries also await your exploration.\nThe hikes over unforgiving mountains and canyons are sure to thrill\nthe most ardent explorer. Graceful flying islands and mystical swamps\ninstil a sense of awe that could nudge you to cross the threshold of\nthe serene temples and shrines to pay your respects to the gods of\nthe land. With so much more on offer than is mentioned here, there is\nno reason why Legends of Dawn should not become your favourite RPG.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy the cracked content from the SKIDROW folder and into the main\ninstall folder and overwrite\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy\n\nADDITIONAL NOTES\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix  irokos\ntitan artdivision\n\n","torrent":{"xt":"urn:btih:7943b9aeb728f7f8334e50a369289973e14523aa","amp;dn":"Legends.of.Dawn-SKiDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7943b9aeb728f7f8334e50a369289973e14523aa","infoHashBuffer":{"type":"Buffer","data":[121,67,185,174,183,40,247,248,51,78,80,163,105,40,153,115,225,69,35,170]},"announce":[],"urlList":[]}}