{"title":"China O'Brien 1-2","uid":8563799,"size":7720474697,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7960b29e2f9635b1282b4d3066da2c3b0307f3d7&amp;dn=China+O%27Brien+1-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"anzuqka","files":-1,"time":1370909281,"description":"China O'Brien (1990) \nChina O'brien; big city police woman; martial arts trainer, is forced to hand in her badge and head home to her father and the small town where she grew up. The peaceful town she knew is now struggling against the clutches of organized crime. When her father, the town sheriff, is killed China decides to run for his position and clean up the town. The poll results spark a series of confrontations that finally decide who runs the town . . .\n\nChina O'Brien 2 (1991)\nChina O'Brien II picks up about two years after part 1 leaves off. While China has cleaned up her small town, a big time drug dealer has escaped from prison, and the guy who sent him away just happens to be living in witness protection in her town, with his wife and her daughter, the former who happens to be China's friend, and the latter who happens to be dating Dakota (Keith Cooke). It's just the drug dealer's dumb luck that of all the small towns in all the world, the guy who ratted on him and made off with his $5 million dollars would choose the one that has Rothrock, Cooke, and Norton as its police force.","torrent":{"xt":"urn:btih:7960b29e2f9635b1282b4d3066da2c3b0307f3d7","amp;dn":"China+O%27Brien+1-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7960b29e2f9635b1282b4d3066da2c3b0307f3d7","infoHashBuffer":{"type":"Buffer","data":[121,96,178,158,47,150,53,177,40,43,77,48,102,218,44,59,3,7,243,215]},"announce":[],"urlList":[]}}