{"title":"Teena Marie - Beautiful (2013) [FLAC] vtwin88cube","uid":8048465,"size":442951167,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:79cff2d1f77b6bbcedf159f52222cd9117d304f0&amp;dn=Teena+Marie+-+Beautiful+%282013%29+%5BFLAC%5D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1358802931,"description":"\n\n\nTeena Marie\nBeautiful (2013)\n\n\n\n\n\nBefore her untimely death at the age of 54, Teena Marie, known as the Ivory Queen of Soul or simply Lady Tee and as one of the only white artists ever signed to Motown Records, was working on her 14th and latest album, Beautiful. Recorded at her home studio and finished except for final mixes, Beautiful was seen through to its conclusion by Teena's 20-year-old daughter Alia Rose, who sings with her Mom on two tracks, a cover of Curtis Mayfield's &quot;Give Me Your Love&quot; and &quot;Rare Breed,&quot; which she co-wrote (Alia co-wrote two more songs on the album, &quot;Sweet Tooth&quot; and the title song). The first single, &quot;Luv Letter,&quot; is an homage to Teena's Motown roots, with nods to Stevie Wonder's &quot;Signed, Sealed, Delivered I'm Yours,&quot; and a dedication to Alia's father, who just happened to be a postman, like in the Marvelettes' song of the same name.\n\nBeautiful is a mother's gift to her daughter, who returns the gesture the only way she knows how, by completing it. The end result is a true labor of love.\n\n\nNo white artist sang R&amp;B more convincingly than Teena Marie, whose big, robust vocals were so black-sounding that when she was starting out, some listeners wondered if she was a light-skinned African-American. Marie grew up in west Los Angeles in a neighborhood that was nicknamed &quot;Venice Harlem&quot; because of its heavy black population. The singer/songwriter/producer was in her early twenties when, around 1977, she landed a job at Motown Records. It was at Motown that she met her mentor and paramour-to-be, Rick James, who ended up doing all of the writing and producing for her debut album of 1979, Wild and Peaceful. That LP, which boasted her hit duet with James, &quot;I'm Just a Sucker for Your Love,&quot; didn't show Marie's picture -- so many programmers at black radio just assumed she was black. When her second album, Lady T, came out, much of the R&amp;B world was shocked to see how fair-skinned she was. But to many of the black R&amp;B fans who were eating her music up, it really didn't matter -- the bottom line was she was a first-rate soul singer whose love of black culture ran deep. \n\n\n\n\n\nAudio Quality:\t\tPerfect (Lossless)\nAudiochecker:\t\t99.92% CDDA\nLabel:\t\t\tUME\nCatalogue #\t\tB0016983-02\t\t\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nAudio-Info:\n\n\n01.Luv Letter\n02.Sweet Tooth\n03.Rare Breed (Feat. Alia Rose &amp; Ty James)\n04.Love Starved\n05.Definition Of Down\n06.Maria Bonita (For My Mother)\n07.Beautiful (For Alia)\n08.The Long Play\n09.Carte Blanche\n10.Give Me Your Love (Feat. Alia Rose)\n11.Wild Horses\n12.The Perfect Feeling\n\n\n\n\n\n\n\n\n\n                            ****Thanks For Seeding!****\n                                     \n                                   ***Enjoy!***\n\n\n","torrent":{"xt":"urn:btih:79cff2d1f77b6bbcedf159f52222cd9117d304f0","amp;dn":"Teena+Marie+-+Beautiful+%282013%29+%5BFLAC%5D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79cff2d1f77b6bbcedf159f52222cd9117d304f0","infoHashBuffer":{"type":"Buffer","data":[121,207,242,209,247,123,107,188,237,241,89,245,34,34,205,145,23,211,4,240]},"announce":[],"urlList":[]}}