{"title":"Church of Tiamat (8 PDF Books)","uid":13882195,"size":12315010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a1c6580ce3a35b5099cee596afa19fedcfdecce&amp;dn=Church+of+Tiamat+%288+PDF+Books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mendesius","files":8,"time":1458166575,"description":"(This is a Collection of 8 pdf books about Vampirism, Witchcraft, Magick and Occultism.)\r\n\r\n-------------------------------\r\nWelcome to the Church of Tiamat\r\n-------------------------------\r\n\r\nTiamat is the mother of all Real Vampires. She is the Dragon-God who created all things. She is also known as Lilith, Aset, Isis.\r\n\r\nA real vampire is not defined by the elements found in fiction, myth and lore. Being a vampire is a definitive condition of the soul. It is marked by a non-human spirit within a human body. An immortal soul in a mortal shell. Vampirism is often linked with the draining of vital force, known as Ka in Ancient Egyptian, but the need for energy alone is not enough to describe a living vampire. The metaphysical practices and techniques behind vampirism are not exclusive to vampires, given that other beings can also summon the elements, interact with energy and may learn the ability to drain and manipulate life force. This does not qualify them as vampires, when they are only humans practicing the arts of vampirism.\r\n\r\nThe Vampire is the next step in human evolution. If you are ready, the Church of Tiamat is Here to empower you. Here, you will find Eight Books about REAL VAMPIRISM. All files are in PDF format.\r\n\r\n1 - Tiamat Bible :\r\n\r\nThe essential Nightside practices of the Vampire religion to include: the secrets of Vampirism to draw Lifeforce from human beings, why Vampires never harm others and are barred from criminal acts, how to perform the ancient rites of the Calling of the Undead Gods in magical ritual, and more. \r\n\r\n2 - Tiamat Predator Bible ::\r\n\r\nThe advanced Nightside Vampiric techniques of Sealing, Extending and Seizing the Astral are taught. Additionally, the highly practical Dayside instruction in the Use of Reason in Vampirism as well as detailed information regarding the creation and mastery of the Vampiric Will. \r\n\r\n3 - Tiamat Priesthood Bible :::\r\n\r\nThe Nightside Teaching of Opening the Astral Gate for out-of-body experience, and the use of the Necromanteion, an ancient passage to Communion. For the Dayside, a careful examination of the Vampiric God and Vampiric Philosophy. \r\n\r\n4 - Tiamat Sorcery Bible ::::\r\n\r\nThe Nine Laws of Magic are outlined and explained with examples for application. These Teachings can be viewed either as an application of the Nightside Vampiric cosmology or a treatise on the manipulation of human psychology. \r\n\r\n5 - Tiamat Adept Bible :::::\r\n\r\nThis Capstone of the Vampiric Teachings focuses on the detailed explanation of The Four-Dimensional Model of All Possible Worlds. By revealing the hidden symbolic map of the truncated Great Pyramid, the Grand Trapezohedron, the Vampire can recognize the full expression of elevation to the Fifth Circle as a Vampire Master Adept.\r\n\r\n6 - Revelations of Tiamat ::::::\r\n\r\nRevelations leads you to understand the Tiamat Bible by answering the questions you are most likely to have just as others have. Step by step, the words of the Tiamat Bible are explained, clarified, amplified, and made more practical for you to use. Revelations may help you grasp the scope and seriousness of what we do.\r\n\r\n7 - Dayside Mastery :::::::\r\n\r\nThe Dayside Mastery draws together in a single volume the collected secrets of earthly mastery.\r\n\r\n8 - Grimoire of Tiamat ::::::::\r\n\r\nTiamat is the Primal Dragon Goddess, the first one, who gave birth to the gods of the universe, the Mother of Everything, the self procreating womb, the source of all life and all manifestation. The work described in this book was inspired by the Babylonian epic known as the Enuma Elish, one of the oldest Creation myths in the world. Rituals described in this book were performed and tested, and their results have been verified to prove their efficacy.\r\n\r\n(This Torrent is Created by Mendesius.)\r\nEnjoy, Seed and Share your Lifeforce with the Undead Gods. Thank you!","torrent":{"xt":"urn:btih:7a1c6580ce3a35b5099cee596afa19fedcfdecce","amp;dn":"Church+of+Tiamat+%288+PDF+Books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a1c6580ce3a35b5099cee596afa19fedcfdecce","infoHashBuffer":{"type":"Buffer","data":[122,28,101,128,206,58,53,181,9,156,238,89,106,250,25,254,220,253,236,206]},"announce":[],"urlList":[]}}