{"title":"Pink Floyd - In London 1966-67 (MPEG Video) - Syd Barrett","uid":3323217,"size":203051913,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7a2a6386838515b53738abc04d5060c2fa6bd4c5&amp;dn=Pink+Floyd+-+In+London+1966-67+%28MPEG+Video%29+-+Syd+Barrett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"karotechia","files":2,"time":1114788271,"description":"Pink Floyd - In London 1966-1967\n\nRecorded at Sound Techniques, London, England on January 11 &amp; 12, 1967.\nThis live recording provides a fascinating glimpse into the inner workings of one of the  most innovative ensembles in rock history. There's a CD-ROM featuring a live video of Syd  Barrett-era Floyd performing its barnstorming signature tune, Interstellar Overdrive, as  well as some additional period footage of the '60s Swinging London scene in which the  group was immersed. The audio disc also features Interstellar Overdrive as well as another extended instrumental piece called Nick's Boogie. \n\nIt's important to remember that at the time of this performance--January 1967--the  psychedelic revolution was still in its embryonic state, and progressive rock was years  away. This makes what Floyd was doing all the more groundbreaking. Both pieces included here  are epic-length improvisatory pieces that shift from spacy ambience to full-blown freakout  and back again, using very basic tools. Synthesizers hadn't come on the scene yet, so Rick  Wright relies strictly on his snake-charmer organ riffs to enhance the spooky, ethereal  mood. Barrett utilizes pure, acid-drenched weirdness to make the most unearthly sounds possible with very little electronic enhancement. Legions of groups would take their cue  from the advances made by Pink Floyd during this time, and IN LONDON makes it easy to see  why. \n\nFeaturing The Pink Floyd: \n\nSyd Barrett - Guitar\nNick Mason - Drums\nRichard Wright - Keyboards\nRoger Waters - Bass\n\n\nRelease Information: Pink Floyd at their recording session on January 11th and 12th, 1967,  at Sound Techniques in London. They are seen playing Interstellar Overdrive and Nick's  Boogie. Additional footage shows them performing live at the UFO Club in London 1967. This  video also shows footage from the 14 Hour Technicolour Dream concert at the Alexandra Palace  in 1967, although there are no shots of Pink Floyd at this concert.\n\nVideo Information: A film by Peter Whitehead dedicated to Syd Barrett. Produced by Colin  Miles and Mark Rye. \n\nTracks: \n   \n1 Pink Floyd video: Interstellar Overdrive","torrent":{"xt":"urn:btih:7a2a6386838515b53738abc04d5060c2fa6bd4c5","amp;dn":"Pink+Floyd+-+In+London+1966-67+%28MPEG+Video%29+-+Syd+Barrett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a2a6386838515b53738abc04d5060c2fa6bd4c5","infoHashBuffer":{"type":"Buffer","data":[122,42,99,134,131,133,21,181,55,56,171,192,77,80,96,194,250,107,212,197]},"announce":[],"urlList":[]}}