{"title":"Martinez - Fredagskväll  2015","uid":12504151,"size":98978033,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7a4ad5b50ebb609a2a812b647eca47a40d249261&amp;dn=Martinez+-+Fredagskv%26auml%3Bll++2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RoffeTheCoolMan","files":14,"time":1443424930,"description":"Sällan har ett medlemsbyte gjort så gott för ett band som det gjorde för Martinez när Sandra Estberg gick med i bandet för tre år sedan. Efter hennes entré så har bandets popularitet ökat för varje turné och skiva. Hennes charm, röst och karisma är otrolig och hon har blivit en profil för hela branschen. \r\n\r\nI slutet av 2012 satte sig Martinez ner och diskuterade vilken väg de skulle ta musikaliskt. Resultatet kom att bli &quot;Fram och tillbaka&quot; från 2013 - vilket också blev Sandras debutplatta - och efter den har deras karriär gått spikrak uppåt. De är idag ett av de absolut mest bokade banden ute på dansbanorna med en bra bit över 150 gig per år på sitt schema! Det roliga för Martinez är att de blivit ett band som fungerar i hela Sverige och Martinez har inte varit såhär populära sedan de var som störst i början på 90-talet då de hade flera hits på Svensktoppen. \r\n\r\n- Man skall höra direkt att det är Martinez. Vår identitet är otroligt viktig säger bandets kapellmästare Danne Strandberg.\r\n- Tommys gitarrspel är en viktig del. Han är unik i branschen, och Sandras fantastiska scennärvaro och röst är unik fortsätter Danne.\r\n\r\nOch det är bara att hålla med.\r\n\r\nPå nya skivan &quot;Fredagskväll&quot; blandar bandet nyskrivet material med en del välkända covers som fräschats upp och Martinifierats... \r\n\r\n- Vi lyssnar mycket på vad vår publik tycker, säger Danne. Vi har märkt att de gillar när vi sneglar på 50- och 60-talet så därför har vi med en del material från den tiden. Samtidigt står Martinez för ett lite modernare sound och det vill vi också värna om vilket man hör på det nyskrivna materialet.\r\n\r\nDetta är nog en stor del i förklaringen av bandets popularitet. Publiken får en unik mix av uppfräschade äldre covers blandat med ett nyare sound på de nyskrivna låtarna. \r\nMed albumet &quot;Fredagskväll&quot; tar Martinez steget vidare och det närmaste året innehåller inte många semesterdagar för bandet.\r\n\r\n- Men vad gör det säger Danne - Spelglädjen och att få vara tillsammans på en scen nära våra fans är det bästa som finns. Det finns inget bättre jobb och då är det lätt att åka 50 mil för ett gig.\r\n\r\n\r\n\r\nLÅTLISTA\r\n\r\n1. Innan natten tagit slut\r\n2. Hjärtat har ett eget språk\r\n3. Lika blå som dina ögon\r\n4. Rock My World\r\n5. Fredagskväll\r\n6. Håll om mig nu\r\n7. One Track Mind\r\n8. Build Me Up Buttercup\r\n9. En man i mina rum\r\n10. Måste hinna till kyrkan i tid\r\n11. I Write You A Love Song\r\n12. En sommar jag minns\r\n13. Sakta vi gå genom stan","torrent":{"xt":"urn:btih:7a4ad5b50ebb609a2a812b647eca47a40d249261","amp;dn":"Martinez+-+Fredagskv%26auml%3Bll++2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a4ad5b50ebb609a2a812b647eca47a40d249261","infoHashBuffer":{"type":"Buffer","data":[122,74,213,181,14,187,96,154,42,129,43,100,126,202,71,164,13,36,146,97]},"announce":[],"urlList":[]}}