{"title":"Lose Your Mummy Tummy","uid":8482132,"size":1468694528,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7a4e9c3a43b1eec220a957869b602d23a9059896&amp;dn=Lose+Your+Mummy+Tummy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"saturnelf","files":1,"time":1368762361,"description":"Lose Your Mummy Tummy introduces the Tupler Technique, a ground-breaking set of simple abdominal exercises that decrease the diastasis and result in a firmer, flatter, stronger belly and a reduction or elimination of back pain... no matter when you had a baby, even if it was decades ago. These exercises can be incorporated into your activities of daily living and your exercise routine.\n\nWhat is groundbreaking about these exercises is that it deals with the underlying condition of the mummy tummy - diastasis recti. Pregnancy naturally separates the outermost abdominal muscles to make room for her growing uterus. Called a diastasis, this separation does not close up in most new moms. With each pregnancy this separation gets larger, which is why women show earlier with each pregnancy.\n\nWhen the muscles separate the connective tissue that joins them stretches sideways and becomes thinner. The mummy tummy is thus the protruding organs against this thin connective tissue. To lose the mummy tummy it is necessary to close this separation so the muscles are supporting the organs - not the thin connective tissue!\n\nYou will learn a lot, and see real results from following the routine for six weeks - just 20-30 minutes a day! ","torrent":{"xt":"urn:btih:7a4e9c3a43b1eec220a957869b602d23a9059896","amp;dn":"Lose+Your+Mummy+Tummy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a4e9c3a43b1eec220a957869b602d23a9059896","infoHashBuffer":{"type":"Buffer","data":[122,78,156,58,67,177,238,194,32,169,87,134,155,96,45,35,169,5,152,150]},"announce":[],"urlList":[]}}