{"title":"LimeWire Pro v5.5.8 + crack[bigup16]","uid":5538130,"size":53530343,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7b1ed0705861af03490955fdad31e66b371fb5ee&amp;dn=LimeWire+Pro+v5.5.8+%2B+crack%5Bbigup16%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thegrimreaper123","files":1,"time":1273141587,"description":"[IMG]http://appzkeygen.com/images/limewire-5-1-4-full-final-version.jpg[/IMG]\n\n\nLimeWire is a software package which enables individuals to search for and share computer files with anyone on the internet.\n\nLimeWire is compatible with the Gnutella file-sharing protocol and can connect with anyone else running Gnutella-compatible software. \n\nAt startup, the LimeWire program will connect, via the internet, to the LimeWire Gateway, a specialized intelligent Gnutella router, at startup to maximize the user's viewable network space.LimeWire is a tool that allows you to share files over the internet. \n\nFurther, the most recent version of Lime Wire enables Group functionality, so that users can connect to other people interested in sharing the same kinds of files that they are.\n\nHere are some key features of &quot;LimeWire&quot;:\n\nÃ‚Â· Integration with AVG Anti-Virus for real-time protection (PRO version only)\n\nFirewall to Firewall Transfers:\nÃ‚Â· Since about 60% of users are currently firewalled, this feature greatly increases the amount of content on the network.\n\nFaster network connections:\nÃ‚Â· Using new &quot;UDP Host Caches&quot;, LimeWire starts up and connects faster then ever before!\n\nUniversal Plug 'N Play:\nÃ‚Â· UPnP support allows LimeWire to find more search results and have faster downloads.\n\niTunes Integration:\nÃ‚Â· Windows users can now take advantage of LimeWire's iTunes integration.\n\nCreative Commons Integration:\nÃ‚Â· LimeWire now recognizes OGGs and MP3s licensed under a Creative Commons License.\n\nWhat's New? feature:\nÃ‚Â· Users can browse the network for the most recent content additions.\n\nSearch drill down results:\nÃ‚Â· Searches in LimeWire now immediately display the artists, albums and other information that fully describes files.\n\nProxy support:\nÃ‚Â· Users can now use web proxies to route their downloads to protect their identity.\n\nSupport for International searches and International groups:\nÃ‚Â· Users can now search in any language, and LimeWire ensures that a user will be connected to other users with their own language to aide international users to receive search results in their native language and to find content from sources that are close to home.\n\nÃ‚Â· Ease of use - just install, run, and search\nÃ‚Â· Ability to search by artist, title, genre, or other metainformation\nÃ‚Â· Elegant multiple search tabbed interface\nÃ‚Â· Swarm&quot; downloads from multiple hosts help you get files faster\nÃ‚Â· iTunes integration for Mac users\nÃ‚Â· Unique &quot;ultrapeer&quot; technology reduces bandwidth requirements for most users\nÃ‚Â· Integrated chat\nÃ‚Â· Browse host feature--even works through firewalls\nÃ‚Â· Added Bitzi metadata lookup\nÃ‚Â· International versions: Now available in many new languages.\nÃ‚Â· Connects to the network using GWebCache, a distributed connection system\nÃ‚Â· Automatic local network searches for lightning-fast downloads. If you're on a corporate or university network, download files from other users on the same network almost instantaneously!\nÃ‚Â· Support for MAGNET links that allow you to click on web page links that access Gnutella.\n\n\nRequirements:\n\nÃ‚Â· Java 6\n\n\nWhat's New in This Release: \n\nÃ‚Â· Add a Smart Search component to make finding files more convenient.\nÃ‚Â· Update the audio and video player to handle all codec formats which are available on a system.\nÃ‚Â· Made various sort relevance improvements for search results.\nÃ‚Â· Add bandwidth controls for individual torrents.\nÃ‚Â· Add torrent magnet link support.\nÃ‚Â· Include REST APIs which allows external access to LimeWire if enabled (Tools &gt; Options, Advanced).\nÃ‚Â· Fix a bug reported on the forum in which a Browse Host of a host sharing a lot of files would lock up LimeWire.\nFrom Open Source Developer Misagh Moayyed:\nÃ‚Â· Use real email address parser for the Friends feature.\nÃ‚Â· Notify the user if he failed to set either the username, and, or the password when he selected to log into Friends at LimeWire startup).\nÃ‚Â· Fix a bug in which the volume in the media player would momentarily jump in the wrong direction when using the Home/End key.\n\n\nReasons why this program is marked as ad-supported:\n\nÃ‚Â· Offers to change the homepage for web browsers installed in the system\nÃ‚Â· Offers to change the default search engine for web browsers installed in the system\nÃ‚Â· Offers to download or install software or components (LimeWire toolbar) that the program does not require to fully function\n \n\n\n[IMG]http://img2.pict.com/64/97/15/2262239/0/enjoyflameed2.gif[/IMG]","torrent":{"xt":"urn:btih:7b1ed0705861af03490955fdad31e66b371fb5ee","amp;dn":"LimeWire+Pro+v5.5.8+%2B+crack%5Bbigup16%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b1ed0705861af03490955fdad31e66b371fb5ee","infoHashBuffer":{"type":"Buffer","data":[123,30,208,112,88,97,175,3,73,9,85,253,173,49,230,107,55,31,181,238]},"announce":[],"urlList":[]}}