{"title":"Ceramic Technology and Processing - Alan G. King","uid":12756048,"size":13356518,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b815dcd920b13adde00e645be532459bf4996f9&amp;dn=Ceramic+Technology+and+Processing+-+Alan+G.+King&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1447451178,"description":"Ceramic Technology and Processing - Alan G. King (Noyes, 2002).pdf\r\n\r\nISBN: 0815514433\r\n\r\nPerfect for the new technician or engineer entering the ceramics industry as well as for the &quot;&quot;old hand&quot;&quot; who needs an update on some aspect of ceramics processing, this resource provides practical laboratory-oriented answers to such typical processing problems as particle segregation, agglomeration, contamination, pressure gradients, adherence to tooling, and temperature gradients during drying and firing. \r\nThe author examines the difficulties of practical testing and processing in the ceramic laboratory, such as vast differences in scale and equipment, and shows how to evaluate results taking such variables into account. Once the laboratory work is satisfactorily completed, the rest of the book explores serious issues involved in transferring technology from the lab bench to the plant floor and then to the customer. The author gives advice on dealing with real-life problems such as allocating human and capital resources and overcoming customer wariness of being first to try new procedures and processes. \r\nEach section contains practical, hands-on suggestions on performing and sometimes avoiding certain tasks, bringing to the reader key information that is at best sparsely available in the industry. As the author states, &quot;&quot;Laboratory skills are gained by hands-on experience. The intent of this book is to accelerate the process.&quot;&quot;","torrent":{"xt":"urn:btih:7b815dcd920b13adde00e645be532459bf4996f9","amp;dn":"Ceramic+Technology+and+Processing+-+Alan+G.+King","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b815dcd920b13adde00e645be532459bf4996f9","infoHashBuffer":{"type":"Buffer","data":[123,129,93,205,146,11,19,173,222,0,230,69,190,83,36,89,191,73,150,249]},"announce":[],"urlList":[]}}