{"title":"Hall &amp; Oates - Method Of Modern Love (2nafish)","uid":5731155,"size":209797124,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7ba577593692154ae48c9fa0308993dfed42c023&amp;dn=Hall+%26+Oates+-+Method+Of+Modern+Love+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1280651913,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Method of Modern Love&quot; is a single by the American duo Hall &amp; Oates. It was released as the second single from their 1984 album, Big Bam Boom. The song reached number five on the Billboard Hot 100 in February 1985.\n\nBig Bam Boom was an album by Daryl Hall &amp; John Oates  that was released on RCA late in 1984. BMG Heritage released a remastered version in July 2004 with four bonus tracks. The song &quot;Out Of Touch&quot; (the first single) was a number 1 pop hit, and charted in several other areas (#24 Hot Black Singles, #1 on both Adult Contemporary  &amp; dance charts, #48 in the UK). Another song taken from the album, the Daryl Hall/Janna Allen-penned &quot;Method Of Modern Love&quot; reached a high point of number 5.\n\nBig Bam Boom peaked at #5 and sold over three million copies worldwide.\n\nDaryl Hall &amp; John Oates (often shortened to Hall and Oates) are an American pop music duo who achieved their greatest fame in the late 1970s and early to mid-1980s. Both sing and are multi-instrumentalists. They specialized in a fusion of rock and roll and rhythm and blues styles, which they dubbed &quot;rock and soul.&quot; Critics Stephen Thomas Erlewine and J. Scott McClintock write, &quot;at their best, [Hall &amp; Oates'] songs were filled with strong hooks and melodies that adhered to soul traditions without being a slave to them by incorporating elements of new wave and hard rock.&quot; On some tours and dates, established soul and blues artists were known to perform in the duo's band.\n\nThey are best known for their six #1 hits on the Billboard Hot 100: &quot;Rich Girl&quot;, &quot;Kiss on My List&quot;, &quot;Private Eyes&quot;, &quot;I Can't Go for That (No Can Do)&quot;, &quot;Maneater&quot;, and &quot;Out of Touch&quot;, as well as many other songs which charted in the Top 40. They last reached the pop charts top 40 in 1990 and slowly faded from public view, though they did not formally break up. They have continued to record and tour with some success. In total, the act had 34 singles chart on the US Billboard Hot 100. Hall and Oates have seven RIAA platinum albums, along with six RIAA gold albums.\n\nA greatest hits compilation was released in 2001 by RCA/BMG. The BMG collection was expanded in 2004 and reissued the following year, after BMG merged with Sony Music Entertainment. In 2003, Daryl Hall and John Oates were inducted into the Songwriters Hall of Fame.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:7ba577593692154ae48c9fa0308993dfed42c023","amp;dn":"Hall+%26+Oates+-+Method+Of+Modern+Love+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ba577593692154ae48c9fa0308993dfed42c023","infoHashBuffer":{"type":"Buffer","data":[123,165,119,89,54,146,21,74,228,140,159,160,48,137,147,223,237,66,192,35]},"announce":[],"urlList":[]}}