{"title":"Velvet Underground - Squeeze (Never re-released album 1973 @224)","uid":3362128,"size":52069081,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7bfed205e0f6b43422040b361a000185887b9e50&amp;dn=Velvet+Underground+-+Squeeze+%28Never+re-released+album+1973+%40224%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"test78","files":14,"time":1122534437,"description":"Search for test78 if you want to find my other uploads.\n\n\nA lot of V.U. fans will probably hate me for uploading this ^_^ Its a controversial album to say the least. I spared myself the trouble of explaining the whole saga behind this album by copying the following from wikipedia:\n\n\n&quot;The Velvet Underground ? which at that time consisted of Doug Yule (vocals/guitar), Willie Alexander (keyboards/vocals), Walter Powers (bass guitar) and Maureen Tucker (drums) ? had toured the United Kingdom and The Netherlands in 1971 to support its latest album, Loaded. The plan was to record a second and final album for their record company, Atlantic Records, afterwards, but Atlantic had lost faith and decided to issue an archive recording from 1970 featuring Lou Reed, Live at Max's Kansas City, instead.\n\nAfter the tour, band manager Steve Sesnick managed to get a recording deal with Polydor UK to record a final Velvet Underground album. Alexander, Powers and Tucker were sent back to the United States by Sesnick, however, presumably to retain maximum control over the finished product. This made Yule the only Velvet to actually play on the album.\n\nThe eleven songs that make up Squeeze were recorded with the help of Deep Purple drummer Ian Paice and occasional saxophone and backing singer assistance. They range from Beatles-like whimsy (&quot;Crash&quot;) via pop to typical 70s rock (&quot;Mean Old Man&quot;).\n\nSqueeze, whose title supposedly reflects Sesnick's stranglehold on Yule or the barrel-scraping efforts to squeeze maximum revenue out of the band name, was recorded in the autumn of 1972 and released in February 1973 in the United Kingdom, France and Spain. No singles were taken off it and the album did not chart. The album saw a number of re-issues in France during the 1970's and early 1980's. It has been out of print since, and has not been issued on compact disc.\n\nYule assembled a backing band consisting of Rob Norris (guitar), George Kay (bass guitar) and Mark Nauseef (drums) to tour the United Kingdom in November and December 1972 to promote the upcoming album; a live recording from this tour is included on the 2001 live box set Final V.U. 1971-1973. After the tour, during which they were deserted by Sesnick, Yule also called it quits, bringing the Velvet Underground to an end.&quot;\n\n224kbs\nCover included.\n\nTracklist:\n\n\n01. Little Jack\n02. Crash\n03. Caroline\n04. Mean Old Man\n05. Dopey Joe\n06. Wordless\n07. She'll Make You Cry\n08. Friends\n09. Send No Letter\n10. Jack and Jane\n11. Louise\n\nEnjoy !","torrent":{"xt":"urn:btih:7bfed205e0f6b43422040b361a000185887b9e50","amp;dn":"Velvet+Underground+-+Squeeze+%28Never+re-released+album+1973+%40224%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bfed205e0f6b43422040b361a000185887b9e50","infoHashBuffer":{"type":"Buffer","data":[123,254,210,5,224,246,180,52,34,4,11,54,26,0,1,133,136,123,158,80]},"announce":[],"urlList":[]}}