{"title":"Judas Priest - Redeemer Of Souls (2014) by susan1973","uid":10468688,"size":150803082,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7c4ab3c250a823a1cb6ee5022a38063c430ae06b&amp;dn=Judas+Priest+-+Redeemer+Of+Souls+%282014%29+by+susan1973&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"susan1973","files":14,"time":1404230637,"description":"Judas Priest are an English heavy metal band formed in Birmingham, England in 1969.[1] Known for twin lead guitars, a wide operatic vocal style, and for introducing the S&amp;M leather-and-studs look into heavy metal, they have sold over 50 million albums worldwide. The band is widely recognised as one of the finest and most original heavy metal bands of all time, with many artists within the genre having cited them as a major influence.[2][3][4] MTV ranked them the second &quot;Greatest Metal Band&quot; of all time.[5]\n\nDespite an innovative and pioneering body of work in the late 1970s, the band struggled with indifferently-produced records, repeated changes at the drummer position, and a lack of major commercial success or attention until 1980 when they adopted a more simplified sound on the album British Steel, which helped shoot them to rock superstar status. In 1989, they were named as defendants in an unsuccessful lawsuit alleging that subliminal messages on their albums had caused the suicide attempts of two young men.[6]\n\nThe band's membership has seen much turnover, including a revolving cast of drummers in the 1970s, and the temporary departure of singer Rob Halford in the early 1990s. The current line-up consists of lead vocalist Rob Halford, guitarists Glenn Tipton and Richie Faulkner, bassist Ian Hill, and drummer Scott Travis. The band's best-selling album is 1982's Screaming for Vengeance featuring their most commercially successful line-up, featuring Halford, Tipton, Hill, K. K. Downing (guitar), and Dave Holland (drums).\n\nThey were a major influence on multiple genres of metal, including but not limited to power metal and thrash metal.[7] Their influence, while mainly Rob Halford's operatic vocal style (widely considered as one of the most unique vocalists in the genre) and the twin guitar sound of K.K. Downing and Glenn Tipton, has been adopted by many bands. Their image of leather, spikes, and other taboo articles of clothing were widely influential during the glam metal era of the 1980s.[8] Their 1980 album, British Steel, has been referred to as the &quot;record that, more than any other, codified what we mean by &quot;heavy metal&quot;.[9] Despite a decline in exposure during the mid 1990s, the band has once again seen a resurgence, including worldwide tours, being inaugural inductees into the VH1 Rock Honors in 2005, receiving a Grammy Award for Best Metal Performance in 2010, and their songs featured in video games such as Guitar Hero and the Rock Band series.","torrent":{"xt":"urn:btih:7c4ab3c250a823a1cb6ee5022a38063c430ae06b","amp;dn":"Judas+Priest+-+Redeemer+Of+Souls+%282014%29+by+susan1973","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c4ab3c250a823a1cb6ee5022a38063c430ae06b","infoHashBuffer":{"type":"Buffer","data":[124,74,179,194,80,168,35,161,203,110,229,2,42,56,6,60,67,10,224,107]},"announce":[],"urlList":[]}}