{"title":"Inside the Painter's Studio[Team Nanban]tmrg","uid":7427417,"size":10410492,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c8c962bd835f54a2d55751d8d6fa5b7de660912&amp;dn=Inside+the+Painter%27s+Studio%5BTeam+Nanban%5Dtmrg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"594mgnav","files":-1,"time":1341845683,"description":" &lt;a href=&quot;http://img24.imageshack.us/img24/4564/sstudioteamnanbantmrg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img24.imageshack.us/img24/4564/sstudioteamnanbantmrg.jpg&lt;/a&gt;\n\nInside the Painter's Studio[Team Nanban]tmrg\n\nJoe Fig | 2009 | 240 Pages | ISBN: 1568988524 | PDF | 10 MB\n\nDESCRIPTION:\n\nInside an art gallery, it is easy to forget that the paintings there are the end products of a process involving not only creative inspiration, but also plenty of physical and logistical details. It is these &quot;cruder,&quot; more mundane aspects of a painter's daily routine that motivated Brooklyn artist Joe Fig to embark almost ten years ago on a highly unorthodox, multilayered exploration of the working life of the professional artist. \nDetermined to ground his research in the physical world, Fig began constructing a series of diorama-like miniature reproductions of the studios of modern art's most legendary painters, such as Jackson Pollock and Willem de Kooning. A desire for firsthand references led Fig to approach contemporary artists for access to their studios. \nArmed with a camera and a self-made &quot;Artist's Questionnaire,&quot; Fig began a journey through the workspaces of some of today's most exciting contemporary artists.\n\nInside the Painter's Studio collects twenty-four remarkable artist interviews, as well as exclusive visual documentation of their studios. Featured artists were asked a wide range of questions about their day-to-day creative life, covering everything from how they organize their studios to what painting tools they prefer. \nArtists open up about how they set a creative mood, how they choose titles, and even whether they sit or stand to contemplate their work. Also included are a selection of Fig's meticulously detailed miniatures. \nIn this context Fig's diminutive sculpturesreproducing minutiae of the studio, from paint-tube labels and paint splatters on the floor to the surface texture of canvasesbecome part of a fascinating new form of portraiture as diorama. Inside the Painter's Studio offers a rare look into the self-made universe of the artist's studio. \nInside the Painter's Studio features interviews with Gregory Amenoff, Ross Bleckner, Chuck Close, Will Cotton, Inka Essenhigh, Eric Fischl, Barnaby Furnas, April Gornik, Jane Hammond, Mary Heilmann, Bill Jensen, Ryan McGinness, Julie Mehretu, Malcolm Morley, Steve Mumford, Philip Pearlstein, Matthew Ritchie, Alexis Rockman, Dana Schutz, James Siena, Amy Sillman, Joan Snyder, Billy Sullivan, and Fred Tomaselli.\n\n\nPLZ SEED WHILE AND AFTER DOWNLOADING...\n\n&quot;SHARING IS CARING&quot;\n\n\nvisit me on Facebook - Google &quot;TEAM NANBAN TPB&quot;\n      &lt;a href=&quot;\nhttp://torrent-stats.info/751d/db9ffb61.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://torrent-stats.info/751d/db9ffb61.png&lt;/a&gt;\n\nTO JOIN TMRG ON FACEBOOK\nTMRG IS TORRENT MAFIA RELEASE GROUP","torrent":{"xt":"urn:btih:7c8c962bd835f54a2d55751d8d6fa5b7de660912","amp;dn":"Inside+the+Painter%27s+Studio%5BTeam+Nanban%5Dtmrg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c8c962bd835f54a2d55751d8d6fa5b7de660912","infoHashBuffer":{"type":"Buffer","data":[124,140,150,43,216,53,245,74,45,85,117,29,141,111,165,183,222,102,9,18]},"announce":[],"urlList":[]}}