{"title":"Malliswari Telungu comedy movie","uid":8567639,"size":657833582,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7cd69bc3b781a402b71f59e67be8c9971cdb35cf&amp;dn=Malliswari+Telungu+comedy+movie+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"svprasad","files":2,"time":1371063586,"description":"Malliswari:The Princess telungu comedy movie 2004\n\n\nMalliswari (Katrina Kaif) is the heiress of Raja of Mirjapur. Her deceased father wrote in his will that she would inherit the property worth 750 crores after she becomes major at the age of 21. The entire property is under the care-taking of Bhavani Shankara (Kota Srinivasa Rao), who wants to inherit the entire property by killing her. As he hatches the plans to eliminate Malliswari, she is sent to Vizag to a relative's place as a normal girl so that she can live with anonymity. Prasad (Venkatesh) works as bank accountant in Andhra Bank at Vizag. He is a bachelor who has been desperately seeking for marriage alliance for the past seven years. He would be looking at every unmarried girl with dreams in his eyes. Just call him 'Pellikaani Prasad' and he would get instantly irritated. He accidentally meets Malliswari and falls deeply in love with her. Malliswari is traced by the goons in Vizag and they start running after her. Prasad escorts her and drops her safely in Hyderabad. The rest of the story describes what happens next and the eventual conclusion of the plot.","torrent":{"xt":"urn:btih:7cd69bc3b781a402b71f59e67be8c9971cdb35cf","amp;dn":"Malliswari+Telungu+comedy+movie+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cd69bc3b781a402b71f59e67be8c9971cdb35cf","infoHashBuffer":{"type":"Buffer","data":[124,214,155,195,183,129,164,2,183,31,89,230,123,232,201,151,28,219,53,207]},"announce":[],"urlList":[]}}