{"title":"fdbasecd-test.iso","uid":6518610,"size":12797952,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:7d8da3f9f92a4cc790647358af7995ca5f695773&amp;dn=fdbasecd-test.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cestpasgagne2","files":1,"time":1309918659,"description":"FreeDOS is a free DOS-compatible operating system for IBM-PC compatible systems. FreeDOS is made of up many different, separate programs that act as &quot;packages&quot; to the overall FreeDOS Project.\nWe welcome new users to FreeDOS. You can contribute to the FreeDOS Project by downloading our latest release and telling us what you think. We have a bug tracking system that helps you report problems and submit requests, and otherwise tell us how to improve FreeDOS. By participating in the development and debugging process, you help everyone.\n &lt;a href=&quot;\nhttp://www.freedos.org/freedos/about/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freedos.org/freedos/about/&lt;/a&gt; &lt;a href=&quot;\nhttp://sourceforge.net/news/?group_id=5109&amp;id=301680&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sourceforge.net/news/?group_id=5109&amp;id=301680&lt;/a&gt;\n\nFreeDOS 1.1 - TEST RELEASE - RELEASE CANDIDATE\nTHIS IS A TEST RELEASE - THIS IS NOT THE FINAL FREEDOS 1.1 DISTRIBUTION!\nPLEASE ONLY DOWNLOAD THIS VERSION IF YOU INTEND TO TEST AND PROVIDE\nFEEDBACK. DO NOT DOWNLOAD IF YOU ARE LOOKING FOR A STABLE VERSION.\nFreeDOS is a free DOS-compatible operating system for IBM-PC\ncompatible systems. FreeDOS is made of up many different, separate\nprograms that act as &quot;packages&quot; to the overall FreeDOS Project.\nRight now the main use is running old games and software, but you\nmight encounter it on some freshly sold computers, motherboard setup\nCDs, BIOS flashing diskettes, embedded hardware and other uses.\nWhile FreeDOS itself is basically just the DOS-C kernel as created by\nPat Villani, over the years many people have added programs (often\nlicensed as GPL, other times as freeware, public domain or a custom\nlicense) to form a distribution so you actually get some additional\ndrivers and programs to run.\nWhat's new since 1.0 (2006):\n FreeDOS kernel 2040 (Bart Oldeman, Jeremy Davis and others. Should\n  fix fat32 file corruption).\n mtcp (Michael Brutman), a suite of high-performance TCP/IP\n  applications for any x86 computer.\n an initial attempt at USB controller support (Bret Johnson). So far\n  only UHCI (Intel/Via USB1.1 12mbit/1.5mbit).\n new Syslinux features (see installation notes, below) including free\n  CD-driver for non-emulation booted CD/ISO.\n generic PCI IDE cache/cdrom driver (Jack R. Ellis) including\n  PIO/UDMA modes for (P)ATA/SATA harddisks and CD.\n new installation menu when starting from CD, intended to reduce\n  amount of menus you have to respond to.\n universal BIOS backup program, see http://www.flashrom.org .\n updated memory drivers (HMA&amp;XMS, UMB&amp;EMS) with many thanks to\n  Japheth, Jack, Michael Devore and Tom Ehlert\n 4DOS 8.00 command interpreter has been added, many thanks to\n  Luchezar Georgiev for updating JPSOFT's code\n installation scripts have been streamlined.\n very limited USB flash disk support (often showing up as C: )\n many new versions of many programs. Features and fixes as usual.\n ..\nRemoved:\n LBAcache, as UIDE now takes over read-ahead caching. Hopefully not\n  only covers 586+ but also 386/486.\n CDRcache, as UIDE now takes over read-ahead caching. Hopefully not\n  only covers 586+ but also 386/486.\n Unstable kernel 2039. Replaced by 2040.\nInstallation notes:\n the FreeDOS 1.1 distribution itself is stored as a single (ISO9660\n  CD-image) file on CD.\n right now the only way to install is to boot the CD, then select\n bottom option.  this loads the entire collection of FreeDOS 1.1\n installation files in system memory.  Only now you select option 1\n (installing FreeDOS).\n Should you wish to keep things really simple, get a bootdisk and\n  perform the following commands:\n  1) FDISK (to create an active primary partition which should use the\n  FAT16 or FAT32 filesystem)\n  2) FORMAT C: (creates an empty filesystem on C:, also erases all\n  previous software/data)\n  3) SYS C: (writes bootsector to C: and copies kernel and shell)\n  4) Whatever you'd like to do next.\nInstallation issues:\n due to there being an ISO on the CD, without the Memdisk/ISO method\n you'll need to boot the small diskette image and/or a bootdisk, then\n locate the CD, then mount the ISO file before continuing. General\n commands to do so:\n SHSUCDHD /F:D:\\ISOLINUX\\FDBOOTCD.ISO\n (or whatever your CD drive is, instead of D: )\n SHSUCDX /D:SHSU-CDH\n Then switch to the newly added drive and type SETUP\n You can copy the inner ISO to harddisk or USB flash drive if you\n  like and mount it there\n Bootdisk menu currently not working\n ..\nLimitations:\n Only the BASE set has been packaged, thus meaning the LiveCD\n  environment is missing completely.\n If installing from USB flash drive, be careful. Your flash drive\n  might show up as C: ..\n ..\nTODO:\n updating ODIN directory (ready to run binaries)\n adding sources for BASE set (GPL requirements)\n adding additional sets\n adding useful programs\n creating disksets\n fixing bootdisks\n ..\n","torrent":{"xt":"urn:btih:7d8da3f9f92a4cc790647358af7995ca5f695773","amp;dn":"fdbasecd-test.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d8da3f9f92a4cc790647358af7995ca5f695773","infoHashBuffer":{"type":"Buffer","data":[125,141,163,249,249,42,76,199,144,100,115,88,175,121,149,202,95,105,87,115]},"announce":[],"urlList":[]}}