{"title":"Life Blown Open Discography","uid":6933336,"size":432227238,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7db05a607d489120701bd313136c1cb5a2788de9&amp;dn=Life+Blown+Open+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"just_in_ross","files":54,"time":1325739464,"description":"Life Blown Open Discography\n\nThe Blue Bedroom (2004)\n\nGoodbye Heart (2006)\n\nThe Industry (2008)\n\nAbridged Mind (2009)\n\nLive Acoustic @ Free Times Cafe  (2010)\n\n\n\nBio\n\nAll music is created for different reasons, and aimed at different audiences. Music is not simple, nor is it uniform. Rather, it comes in different shapes, colors, packages, and varies in hundreds, or even thousands of different genres, each one defining the style of its category, never deviating too far from the specific parameters of the genre. It makes it easy for people to select their music, define their style, and it keeps things tidy and neat, for everyone. This is not what Life Blown Open does. They do the opposite.\n\nSince the 2005, founding members Tanner Reinhardt and Justin Ross have aimed to create music that is creative, melodic, and experimental. There are NO limits. The music is different. It could be compared to metal, rock, ambient, grove, math- rock, progressive, or any number of different styles, but its not any of these things. Life Blown Open made their own sound, not consciously, but through necessity. The band is never satisfied. They keep pushing and changing their sound. When told that he needed to write a pop song, Tanner simply was unable to reduce himself.\n\nIn 2008, the band released their second album The Industry, which has seen great success. The concept album has reached the tops of several campus radio stations across the country.\n\nAfter making a name for themselves in their hometown of Sudbury, Ontario, Canada, \nthe band decided to relocate to Toronto, Canadas music capital. The band won the DC Music Last Band Standing competition, which began with over 60 bands, placed 2nd in the 2011 MetalWorks competition, for CMW, which had hundreds of submissions, and even qualified for the semi-final round of the Street Idol competition, a contest that favors pop artists. Its been a great first year in Toronto.\nLife Blown Open will be in the studio in 2011 to record a new demo, and it looks like a new full length album is in the works for 2012.\n\nEnjoy!\t\t\t","torrent":{"xt":"urn:btih:7db05a607d489120701bd313136c1cb5a2788de9","amp;dn":"Life+Blown+Open+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7db05a607d489120701bd313136c1cb5a2788de9","infoHashBuffer":{"type":"Buffer","data":[125,176,90,96,125,72,145,32,112,27,211,19,19,108,28,181,162,120,141,233]},"announce":[],"urlList":[]}}