{"title":"Endgame - Frank Brady-Epub,Mobi,KK","uid":6923347,"size":7172768,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7dd94ad2e9d92fc9750b36f221f0c4239a5b5dda&amp;dn=Endgame+-+Frank+Brady-Epub%2CMobi%2CKK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1325346205,"description":"Endgame - Frank Brady-Epub,Mobi\n\nBooks : Contemporary : English\nEndgame: Bobby Fischer's Remarkable Rise and Fall - from America's Brightest Prodigy to the Edge of Madness by Frank Brady (2011)\n\nQuote:\nAmazon Best Books of the Month, February 2011: There may be no one more qualified than Frank Brady to write the definitive biography of Bobby Fischer. Brady's Profile of a Prodigy (originally published in 1969) chronicled the chess icon's early years, a selection of 90 games, and (in later editions) his 1972 World Championship match with Boris Spassky. With Endgame, published two years after Fischer's death, Brady's on-and-off proximity to Fischer lends new depth to the latter's full and twisted life story. Though Fischer's pinnacle artistry on the chessboard may often be discussed in the same breath with his eventual paranoia and outspoken anti-Semitism, the particular turns and travels of his post-World Championship years (half his life) lend his story most of its vexing oddity: the niggling insistence on seemingly arbitrary conditions for his matches, the years on the lam after flagrantly disregarding U.S. economic sanctions, his incarceration in Japan, his eventual citizenship and quiet demise in Iceland. All told, Fischer's life was like. \n\nEnjoy!","torrent":{"xt":"urn:btih:7dd94ad2e9d92fc9750b36f221f0c4239a5b5dda","amp;dn":"Endgame+-+Frank+Brady-Epub%2CMobi%2CKK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dd94ad2e9d92fc9750b36f221f0c4239a5b5dda","infoHashBuffer":{"type":"Buffer","data":[125,217,74,210,233,217,47,201,117,11,54,242,33,240,196,35,154,91,93,218]},"announce":[],"urlList":[]}}