{"title":"The God Part of the Brain","uid":6764369,"size":1074735,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e748693401468cd9660b593552635d71ec55de6&amp;dn=The+God+Part+of+the+Brain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":2,"time":1319316619,"description":"First published in 1996, this is a minimally revised new edition of Alper's manifesto against belief in God. Beginning with philosopher Kant's supposition that humans cannot know a reality beyond their perception of reality, Alper uses his vast research into scientific phenomenon to build a case that humanity's perception of a spiritual realm is, in fact, the biological result of thousands of years of evolution. Alper writes that this is &quot;'nature's white lie', a coping mechanism selected into our species to help alleviate debilitating anxiety caused by our unique awareness of death.&quot; Alper's theory is elegantly drawn, and he shows an admirable grasp of a wide range of scientific disciplines. However, generalizations weaken his case: Alper's proof relies on readers' agreement that all humans are equally spiritual creatures, whose &quot;cross-cultural proclivity toward spiritualism suggests that we must be neuro-physiologically hardwired this way.&quot; A harsh anti-religion tone (i.e. &quot;How much longer will be slaves to destructive religious creeds... ?&quot;), though not entirely inappropriate, provides the book's main flaw; aside from the fact that his anti-faith proclamations themselves demonstrate a certain kind of blind faith, he gives no credence to others' views, nor is he compassionate to the helpful role that spirituality plays in peoples' lives. Ultimately, Alper is preaching to the choir, but in a time of renewed interest in the clash between religion and science, this cult classic will appeal to those caught up in the debate.\nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. --This text refers to the Hardcover edition. \n\nReview\n&quot;A Cogent and Engaging Exploration into the Biological Foundations of Spirituality.&quot; -- David C. Noelle, Ph.D. -Center for the Neural Basis of Cognition at Carnegie Mellon\n\n&quot;Brilliant...Enormously important...Full of scientific and philosophical truths.&quot; -- Mark Waldman, Senior Editor of Transpersonal Review\n\n&quot;Brilliant...Provocative&quot; -- Arnold Sadwin, M.D.; Chief of Neuropsychiatry at University of Pennsylvania's Grad. Hospital; Who's Who in Science, 1995; In Medicine, 1996\n\n&quot;Clear, Concise...Bold and Masterful&quot; -- William Wright, Author of Born That Way\n\n&quot;Excellent Reading for every college student--The resultant residence-hall debates would be the best part of their education.&quot; -- Edward O. Wilson; Two-time Pulitzer Prize winner\n\n&quot;Matthew Alper is high maintenance. Not only is his intellect superior to most Ph.D. candidates that I know, but his intensity in displaying that intellect and arguing his world view is more compelling than many of my grad school courses. So, here I am, fiercely advocating for a self-published, self-educated, thoroughly unconventional first time author who, with one slim book, has thrown hundreds of years of human religious beliefs out the window and replaced them with a concise scientific view of spirituality that is impossible to argue with...The brain is the secret. In our brains lie nature's survival mechanisms in which god is nothing but a protective lens through which humanity is &quot;programmed&quot; to view the world. Matthew Alper has the chutzpah to remove that lens, to crush it under his heel, and then, as we cringe in the unfiltered light, he dares us all to look up into and stare into the pure scientific truth he has discovered...The &quot;God&quot; Part of the Brain is a challenge at first, but once you open your mind to the potentials of its theories, there is nothing to do but follow its arguments to their logical conclusions. And although he rips away our old stiff crutches, this audacious philosopher is kind enough to spoon feed us a new and positive way to approaching our existences.&quot; -- Rebecca Morris\n\n&quot;Thank you for finishing what Julian Jaynes and Joseph Campbell started.&quot; -- B.Brown\n\n&quot;The Atheist's Bible&quot; -- Bob Worthington\n\n&quot;You have presented what amounts to a unified theory about the nature of mankind's concepts of God and an afterlife, their origins and evolutionary purposes. I have never seen a better-supported, more comprehensive theory on those questions. Until, or unless, I encounter evidence that meaningfully contradicts your conclusions, I'm going to adopt yours as my own working theory. And I thank you from the bottom of my heart for making it available to me.&quot;\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:7e748693401468cd9660b593552635d71ec55de6","amp;dn":"The+God+Part+of+the+Brain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e748693401468cd9660b593552635d71ec55de6","infoHashBuffer":{"type":"Buffer","data":[126,116,134,147,64,20,104,205,150,96,181,147,85,38,53,215,30,197,93,230]},"announce":[],"urlList":[]}}