{"title":"Dolores-Cannon - Legacy from the Stars.pdf","uid":6768725,"size":2448042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7fce282d47c92e1a2ee5e1b071551bd1bcb31c0d&amp;dn=Dolores-Cannon+-+Legacy+from+the+Stars.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ViViDSOL","files":1,"time":1319496484,"description":"WE ARE CHILDREN OF THE STARS\n\n\nTHIS IS OUR LEGACY AND OUR HERITAGE\n\n\nThrough regressive hypnosis, hypnotherapist Dolores Cannon has discovered several cases where the subjects relived other lifetimes as inhabitants on other planets in strange environments.\n\n\nWe are all extraterrestrials. In the history of the cosmos, Earth is considered a young planet, and our souls have been around forever and will continue to be around forever. Thus Earth is not our only home. We have lived many lives in unusual environments before deciding to journey here and learn the lessons of Earth. After our journey schooling is completed on this planet, we will journey onward and outward to discover new worlds to explore. Earth is merely a stop-over in our long adventure. The memories of these soul journeys are recorded in our subconscious, and Dolores Cannon shows that they can be retrieved through regressive hypnosis.\n\n\nOTHER CASES\n\n\n* Aliens are called &quot;angels&quot; as they visit Earth during Bible times.\n* A jungle m=native sees a UFO and is as misunderstood as many cases reported today\n* Cases where aliens became part of the craft they were operating. It sounds very similar to &quot;Virtual Reality&quot; that is being developed today.\n* Aliens who came to Earth by accident were trapped in the physical because of karma created by interference with the developing Earth species.\n* An alien world where the inhabitants were forced to live underground after the surface of their world was destoyed. And a similar possible future for our own Earth where people are forced to live in underground cities after a disaster renders the surface of our planet uninhabitable.\n\nABOUT THE AUTHOR\n\nDolores Cannon is a past-life regressionist and hypnotherapist who specializes in the recovery and cataloging of &quot;Lost Knowledge&quot;. Her roots in hypnosis go back to the 1960s. She has been specializing in past-life therapy since 1979.\n\nDolores has become, perhaps, the world's most unlikely expert on the prophecies of Nostradamus. A retired Navy wife from Huntsville, AR, USA, Dolores was nearly fifty years old when she began experimenting with hypnosis and past-life regression. The results were, to say the least, quite spectacular!\n\nWorking through several different subjects, Dolores was able to establish communication with the living Michel De Notredame, better known as the prophet, Nostradamus. His revelations and their impact on our own time are both fascinating and at times frightening.\n\nDolores has written the three volume set &quot;Conversations With Nostradamus&quot;, the series on the translation of Nostradamus' quatrains. This series contains the translation of almost 1000 prophecies, all interpreted for the first time and have been in print since 1989. It is considered the most accurate interpretation of the prophecies ever printed.\n\nDolores has been a UFO investigator for twenty years, using her skills as a regressionist to help people that had been involved in abduction cases. She has written several books on the UFO information volunteers have revealed while under hypnosis.\n\nDolores is now teaching her unique technique of hypnosis all over the world.\n\nIn addition to the three volumes of &quot;Converstations With Nostradamus&quot;, Dolores has completed:&quot;The Legend of Starcrash&quot;, &quot;Keepers of the Garden&quot;, &quot;Legacy from the Stars&quot;, &quot;A Soul Remembers Hiroshima&quot;, &quot;They Walked With Jesus&quot;, &quot;Jesus and the Essenes&quot; and &quot;Between Death and Life&quot;. &quot;The Custodians&quot;, discusses in detail information regarding distorted time, screen memories, reasons for abductions, implants and much, much more....\n\nHer latest book, &quot;The Convoluted Universe, Book One&quot;, goes further into complex metaphysical theories and covers &quot;mind-bending&quot; concepts.\n\nOther books dealing with more of her most interesting hypnosis cases are forthcoming.\n\nDolores has been touring in the USA, England, Europe, the former Soviet countries, Australia, New Zealand, and parts of Asia to promote her works, and to discuss her particular brand of psychic research. She has spoken to radio and television audiences worldwide. She has given lectures at such locations as: Whole Life Expos in Los Angeles, New York and San Diego; Global Science Congress; various A.R.E. Edgar Cayce Foundations; Conscious Living Expo and MBS Expo in Australia; The College of Psychic Studies in London, England; The Theosophical Society in London, England; as well as many other organizations. Dolores was the first American and the first foreigner to receive the &quot;Orpheus Award&quot; in Bulgaria, for the highest advancement in the research of psychic phenomenom.\n\nArticles by/about Dolores have appeared in several magazines including: &quot;Body, Mind and Spirit&quot;; &quot;Magical Blend&quot;; &quot;Connecting Link&quot;; &quot;Kindred Spirit&quot; (an England magazine); &quot;People Magazine&quot; (an Australian magazine); &quot;Conscious Living Magazine&quot; (an Australian magazine); &quot;After Dark&quot; (the Art Bell magazine); &quot;The Unknown Magazine&quot;; &quot;The Washington Post&quot;; and &quot;New York Times&quot;. Also magazines and newspapers in Russia, Spain, South America, Bulgaria, Japan and Arab countries.\n\nDolores has appeared on various TV specials including: &quot;A Current Affair&quot; (in Australia); BBC Documentary Series &quot;Divine Magic&quot;; &quot;Ancient Mysteries of the World&quot; (a two hour special on CBS); &quot;Ancient Prophecies I and Ancient Prophecies II&quot; (two hour specials on NBC); &quot;Encounters&quot; ( a one hour special on FOX network); &quot;Good Day LA&quot; (in California); &quot;Mysteries, Magic and Miracles&quot; (the Sci-Fi Channel); &quot;Marilu Talk Show&quot; (ABC); &quot;Biography&quot; (series on A&amp;E Channel); &quot;America After Hours&quot; (CNBC); &quot;CNN International Entertainment News&quot;; &quot;The Wisdom Channel&quot; (Correen Edwards); and &quot;The Fox Family Channel&quot;.\n\nDolores is contacted regularly to appear on various shows about Nostradamus because she is considered to be the world's foremost expert on the prophecies.\n\nDolores has done over 1000 radio talk shows including Art Bell's &quot;DreamLand&quot; and Shirley MacLaine.\n","torrent":{"xt":"urn:btih:7fce282d47c92e1a2ee5e1b071551bd1bcb31c0d","amp;dn":"Dolores-Cannon+-+Legacy+from+the+Stars.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fce282d47c92e1a2ee5e1b071551bd1bcb31c0d","infoHashBuffer":{"type":"Buffer","data":[127,206,40,45,71,201,46,26,46,229,225,176,113,85,27,209,188,179,28,13]},"announce":[],"urlList":[]}}