{"title":"Dimension X (OTRR Certified Complete V2) old time radio otr sci","uid":6916439,"size":1340598621,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7fd9b4b3b09006b3c14634f809e0b9795fbf4ddc&amp;dn=Dimension+X+%28OTRR+Certified+Complete+V2%29+old+time+radio+otr+sci+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OldTimeRadio","files":-1,"time":1325051675,"description":"OLD TIME RADIO:\n\n\nDIMENSION X\n\n\n\nDimension X was first heard on NBC April 8, 1950, and ran until September 29, 1951.\n\nStrange that so little good science fiction came out of radio; they seem ideally compatible, both relying heavily on imagination. Some fine isolated science fiction stories were developed on the great anthology shows, Suspense and Escape. But until the premiere of Dimension X -- a full two decades after network radio was established -- there were no major science fiction series of broad appeal to adults. This show dramatized the work of such young writers as Ray Bradbury, Robert (Psycho) Bloch, Robert Heinlein, Isaac Asimov, and Kurt Vonnegut. In-house script writer was Ernest Kinoy, who adapted the master works and contributed occasional storied of his own.\n\nDimension X was a very effective demonstration of what could be done with science fiction on the air. It came so late that nobody cared, but some of the stories stand as classics of the medium. Bradbury's &quot;Mars Is Heaven&quot; is as gripping today as when first heard. His &quot;Martian Chronicles&quot; was one of the series' most impressive offerings. \n\nDimension X played heavily on an &quot;adventures in time and space, told in future tense&quot; theme. Actors who worked regularly on the show included Joe Di Santis, Wendell Holmes, Santos Ortega, Joseph Julian, Jan Miner, Roger De Koven, John Gibson, Ralph Bell, John Larkin, Les Damon, and Mason Adams. It was directed by Fred Weihe and Edward King. The deep-voiced narrator was Norman Rose.\n\nThe series played heavily on the &quot;X&quot; factor in the title, as did X Minus One a few years later. The signature was boomed out of and echo chamber as &quot;DIMENSION X X X X X x x x x x . . . &quot;\n\n\n\n--------------------------------------------------------------------------------\nOTRR Certification Information:\n\nSeries Name: Dimension X\nCertification Status: OTRR Certified Complete\nCertification Date: July 10, 2004\nCertification Version: Version 1\nNumber of CDs: 2\n\n\n\nOLD TIME RADIO RESEARCHERS GROUP\n\n\n\nThis is a production of the Old Time Radio Researchers (OTRR) Group located at Old Time Radio Researchers Website and the Old Time Radio Researchers Group.\n\nIf you are interested in preserving old time radio, you may wish to join the Old Time Radio Researchers Group at Yahoo.\n\n\nRelax, listen, and enjoy!\n\n--------------------------------------------------------------------------------\n\nOTRR Definitions:\n\nOTRR Certified Accurate -- A series that is Certified Accurate indicates that all the episodes are properly identified and labeled but that the series does not contain all known extant episodes.\n\nOTRR Certified Complete -- A series that is Certified Complete is the highest level of certification available under the OTRR Certified Standards. This certification level implies that all the files in the series are Certified Accurate but also indicates that the series is as complete as possible -- it includes all extant episodes.\n\nOTRR Non-Certified -- A collection of shows that has not gone through the OTRR Certification process.\n\n\nIndividual Files\nWhole Item Format Size \nDimension X - Version 1 - Disk 1 of 2  ZIP  654.4 MB  \nDimension X - Version 1 - Disk 2 of 2  ZIP  624.1 MB  \nImage Files JPEG JPEG Thumb \nDimension X  125.2 KB \n  \nOTRR_Certified_Dimension_X_thumb.jpg   9.6 KB \n \nInformation Format Size \nOTRR_Certified_Dimension_X_files.xml  Metadata  [file]  \nOTRR_Certified_Dimension_X_meta.xml  Metadata  5.2 KB  \nOTRR_Certified_Dimension_X_reviews.xml  Metadata  5.0 KB  \n","torrent":{"xt":"urn:btih:7fd9b4b3b09006b3c14634f809e0b9795fbf4ddc","amp;dn":"Dimension+X+%28OTRR+Certified+Complete+V2%29+old+time+radio+otr+sci+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fd9b4b3b09006b3c14634f809e0b9795fbf4ddc","infoHashBuffer":{"type":"Buffer","data":[127,217,180,179,176,144,6,179,193,70,52,248,9,224,185,121,95,191,77,220]},"announce":[],"urlList":[]}}