{"title":"Aurora 3D Text &amp; Logo Maker 12.09260954","uid":7730005,"size":44486415,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:80588fb106a3042f85509c56940907296e85795f&amp;dn=Aurora+3D+Text+%26amp%3B+Logo+Maker+12.09260954&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1350316205,"description":"Aurora 3D Text &amp; Logo Maker is an advanced application intended to enable you to design 3D Text, buttons, logos. Features a large number of shapes and text template. There are reflections and texture animation effects, and a variety of quick tools, very easy to use.\n\nYou can choose a variety of bevel and alignment, lighting can be adjusted, the shape can be interchangeable, very flexible. Can import the font shapes, and you can import SVG, and converted into three-dimensional shapes.\n\nHere are some key features of &quot;Aurora 3D Text &amp; Logo Maker&quot;:\n?Â· The template has as many as hundreds of style options, and user-friendly operation, to save you a lot of work time and increase efficiency;\n?Â· Reflection, reflection, mixing, deformation texture, and other operations, metal, glass, plastic and other texture effects, so that your work will never lose a powerful 3D software;\n?Â· Hand shape, svg graphics and fonts graphic import, and import pictures and external model, the flexibility to use the software to easily respond to your various design needs.\n\nEditing and special effects textures:\n?Â· the software specially designed for the advanced operator, making the text and the shape of the move, rotate, zoom, change the size is very convenient, all without using the value of the window, everything seems intuitive, creative.\n?Â· unlimited undo, making various attempts to become don??â„¢t worry about.\n?Â· front and side color, material, texture of shape and text can be adjusted. Software contains dozens of texture library to choose from, coupled with the unique texture reflection, mirror, transparent effects, makes it easy to create metal, glass and other special effects.\n?Â· texture support zoom, move, rotate, etc. deformation, increase the flexibility of texture. In addition, we can easily create animated textures, the texture was more realistic.\n?Â· dozens of ways to free choice of bevels, bevel height can be freely adjusted to meet the needs of different shapes.\n?Â· the software provides three adjustable lighting modes","torrent":{"xt":"urn:btih:80588fb106a3042f85509c56940907296e85795f","amp;dn":"Aurora+3D+Text+%26amp%3B+Logo+Maker+12.09260954","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80588fb106a3042f85509c56940907296e85795f","infoHashBuffer":{"type":"Buffer","data":[128,88,143,177,6,163,4,47,133,80,156,86,148,9,7,41,110,133,121,95]},"announce":[],"urlList":[]}}