{"title":"Discotheque Guinee 1970-1976 [FLAC] TQMP","uid":7011665,"size":1314621854,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8179e5db5b9f59df5d3a22f656966234b1ef82dc&amp;dn=Discotheque+Guinee+1970-1976+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pastafari","files":-1,"time":1328489053,"description":"Various Artists - Discotheque Guinee 1970-1976\n(7 CDs compilation)\n\n* * * * * * * * * * * * * * * * * * *\n\nDuring the 70's, Guinean label Syliphone released a yearly compilation of hits produced under the AuthenticitÃƒÂ© movement, a government policy supporting musicians and encouraging a return to African traditions. The releases started in 1971 and ended in 1977, each one covering the previous year. Syllart Productions re-issued all of them on CD in 1999. I'm missing Discotheque 76 disc but I included all the tracks from whatever sources I could find. I'd like to thank fellow file sharer syliphone (akasyliphone) for providing Discotheque 72 and 74. This compilation summarises Guinea's golden age of music. Enjoy! \n\n* * * * * * * * * * * * * * * * * * *\n\nReview --\n\nThe recent release of the Syliphone Discotheque series on compact disc covers an important era in the history of West African music. The period covered is significant, for in the mid 70s Guinean music was one of the most popular styles in west Africa, and many of Guinea's bands were in their prime. The series covers the years from 1970 to 1976 and features all of the original Discotheque LP releases. All of the major groups from Guinea are represented, including Bembeya Jazz National, Keletigui et ses Tambourinis, Balla et ses Balladins, Horoya Band National, and Camayenne Sofa. In addition to these luminaries are many tracks by less well-known groups, such as the excellent Syli Authentic, the groovy Myryam's Quintette, and the Super Boiro Band, the latter performing several exceptional numbers. \n\nThe concept behind the Discotheque series was to re-issue the popular songs of the year in a &quot;greatest hits&quot; style compilation. These songs usually came from previously released Syliphone LPs, though sometimes they were reissues of 45 rpm singles. The Syliphone label was a government controlled body and was Guinea's only recording label until its demise in the late 1970s. The word &quot;Syli&quot; actually means elephant in Suso, and the elephant was the emblem of the Guinea's sole political party, the PDG. It is not surprising, therefore, to find many examples of songs on the Syliphone releases (of which there were 82) that praised the government of SÃƒÂ©kou TourÃƒÂ© and the policies of the PDG. \n\nThe first Discotheque release was in 1970 and features Bembeya Jazz National in great form with &quot;Waraba.&quot; Another excellent track on the CD is an acoustic guitar duet by Les Virtouses DiabatÃƒÂ©, with perhaps the stand-out number by the popular Demba Camara, the original lead singer of Bembeya Jazz, who died in a car crash only a few years later. Discotheque 71 features an absolute classic with &quot;Moi ÃƒÂ§a ma fout&quot; by Balla et ses Balladins - one of the great guitar tracks from Guinea, which they follow up with &quot;Sakhodougou,&quot; an impressive ballad exhibiting all the hallmarks and finery of classic 1970s MandÃƒÂ© rock. Myryam's Quintette, the backing band for Myriam Makeba (who lived in Guinea for a number of years and released two Syliphone LPs) provide a rather bizarre instrumental which featured, possibly for the first time, a kora with a western-style ensemble. Discotheque 72 contains a very funky &quot;Samba&quot; by Pivi et ses Balladins (a track which was later covered by Les Amazones de GuinÃƒÂ©e) and Les FrÃƒÂ¨res DiabatÃƒÂ© contribute three wonderful instrumental acoustic tracks. Discotheque 73 opens with Bembeya Jazz National performing their 15 minute opus &quot;Super Tentemba,&quot; and also includes their hit &quot;Mami wata.&quot; Myriam Makeb, with her ensemble, performs in a most griot-like manner in &quot;Malouyame,&quot; and allows us a rare chance to hear one of her Guinean recordings. \n\nDiscotheque 74 is amongst the best of the series. The first track is Camayenne Sofa's &quot;Kononin&quot; which features some incredible wah-wah peddle lead guitar and funky organ breaks. It is perhaps only eclipsed by &quot;So i si sa&quot; by the Super Boiro Band - the brass section delivering the most powerful of riffs on one of the best songs of the decade from Guinea. Other great songs include Balla et ses Balladin's &quot;Ancien combattant&quot; and Kaloum Star's &quot;Manibaly.&quot; Discotheque 75 also begins with a classic, the Conakry based Syli Authentic performing &quot;Andree.&quot; This group were the youngest of the big bands and were viewed as one of the more experimental of their time. The Super Boiro Band also provide the gentle &quot;Kha mu lan ma&quot; and Horoya Band National perform two tracks. Discotheque 76 is unusual in that an extra track has been added. Included is &quot;Sina mousso&quot; by Bembeya Jazz National, a song that was originally released on &quot;La dÃƒÂ©fi&quot; and which gives the band five out of the six tracks on this CD. The instrumental number &quot;Petit Sekou&quot; allows Sekou DiabatÃƒÂ© to exhibit his prodigious talent and another good performance by the band is found in &quot;Kana sarakabÃƒÂ¶.&quot; This release also contains the only recorded performance by the group Super Lion, who were the all-male orchestra of the National Gendarmarie of Guinea. Only 12 more Syliphone LPs were released after Discotheque 76. \n\nGiven the opportunity to re-release such classic and rare material one would expect a first-class job done on the reissues, however this is sadly not the case. Though the sound quality is very good, there are a number of errors and omissions present and the whole series suffers generally from a poor presentation. The wonderful original cover art has been shrunk to insignificant proportions and the liner notes on the back of the original recordings is now completely absent. This is a real tragedy, for the liner notes were highly informative and often supplied translations to the songs. Surely these could have been included with up-to-date information in a booklet with each compact disc. At times the notes are simply wrong. For example the names of songs are spelled incorrectly as are the names of bands (&quot;Bala&quot; instead of &quot;Balla&quot;). Some tracks have no band name at all as a credit (as with &quot;Sina mousso&quot; by Bembeya Jazz National on Discotheque 76) and the track listings for Discotheque 75 are totally confusing. Track 3 is actually by the Horoya Band National, and the listings make sense once this is taken into account. If the Syliphone catalogue is to be gradually re-released then hopefully better products will be forthcoming. Still, the series makes for some excellent listening and comes most highly recommended. ~ Graeme Counsel\n -- rootsworld.com\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\nDiscotheque 70\n01 - Bembeya Jazz National - Waraba\n02 - Keletigui et ses Tambourinis - Tambourinis Cocktail\n03 - Balla et ses Balladins - Kaira\n04 - Keletigui et ses Tambourinis - Nadia\n05 - Balla et ses Balladins - Moi Je Suis Decourage\n06 - Les Virtuoses Diabate - Solos de Guitares avec Papa et Sekou Diabate\n07 - Rhythyms Nouveaux avec Demba Damara et son groupe - Exhumation Folklorique\n\nDiscotheque 71\n01 - Keletigui et Ses Tambourinis - J.R.D.A.\n02 - Bembeya Jazz National - N'Borin\n03 - Balla et ses Balladins - Moi Ca Ma Fout\n04 - Keletigui et Ses Tambourinis - La Bycicletta\n05 - Balla et ses Balladins - Sakoudougou\n06 - Bembeya Jazz National - Dagna\n07 - Bafing Jazz Mamou - Sontilla\n08 - Myryam's Quintette - Solo Quintette\n09 - Virtuose Diabate - Nadiaba\n10 - Bafing Jazz Mamou - Toubaka\n11 - Virtuose Diabate - Sankaranka\n\nDiscotheque 72\n01 - Pivi et les balladins - Kogno Koura\n02 - Bembeya Jazz National - Mme tolberg\n03 - Pivi et les balladins - Samba\n04 - Keletigui et ses tambourinis - Donsoke\n05 - Pivi et les balladins - Djina Moussi\n06 - Les freres diabate - Koumanfe\n07 - Les freres diabate - Keba Mirima\n08 - Les freres diabate - N'fa\n\nDiscotheque 73\n01 - Bembeya Jazz National - Super Tentemba\n02 - Horoya Band National - Were Were\n03 - Miriam Makeba - Malouyame\n04 - Keletigui et ses Tambourinis - Miri Magnin\n05 - Bembeya Jazz National - Mami Wata\n06 - Super Boiro Band - Darinole\n\nDiscotheque 74\n01 - Camayenne Sofa - Kononin\n02 - Super Boiro Band - Sidiba\n03 - Balla et ses Balladins - Ancien Combattant\n04 - Horoya Band - Sasilon\n05 - Kaloum Star - Maliba\n06 - Camayenne Sofa - Manibaly\n\nDiscotheque 75\n07 - Super Boiro Band - Si I Si Sa\n01 - Syli Authentique - AndrÃƒÂ©e\n02 - Djoli Band - Sakonke\n03 - Horoya Band National - Daba\n04 - Super Boiro Band - Kha Mu Lan Ma\n05 - Camayenne Sofa - Kulumba\n06 - Horoya Band National - Artistes\n\nDiscotheque 76\n01 - Super Lion - Kiti (*)\n02 - Bembeya Jazz National - Telephone\n03 - Bembeya Jazz National - Petit Sekou\n04 - Bembeya Jazz National - Ah Kani (*)\n05 - Bembeya Jazz National - Kana Sarakabo\n06 - Bembeya Jazz National - Sina Mousso\n(*) MP3\n\n* * * * * * * * * * * * * * * * * * *\n\nEAC logs included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nTQMP. The Quality Music Project.","torrent":{"xt":"urn:btih:8179e5db5b9f59df5d3a22f656966234b1ef82dc","amp;dn":"Discotheque+Guinee+1970-1976+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8179e5db5b9f59df5d3a22f656966234b1ef82dc","infoHashBuffer":{"type":"Buffer","data":[129,121,229,219,91,159,89,223,93,58,34,246,86,150,98,52,177,239,130,220]},"announce":[],"urlList":[]}}