{"title":"Miles Davis - The Complete Bitches Brew Sessions (1970) CD2 of 4","uid":4728658,"size":181759124,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:81d457e10a9c2c1a359f4b69794a706bb589f827&amp;dn=Miles+Davis+-+The+Complete+Bitches+Brew+Sessions+%281970%29+CD2+of+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":10,"time":1234888742,"description":"Miles Davis - The Complete Bitches Brew Sessions (1970) CD2 of 4\nRecording information: Columbia Studios, New York, New York (1969 - 1970)\nOriginal Release Date: August 19, 1969 \nAudio CD:  May 11, 2004 \nNumber of Discs: 4 \nLabel: Sony\nBitrate: 320 kbps\n\nEditorial Reviews - Amazon.com\nThese historic sessions, recorded between 1969 and 1970 and originally released as a 90-minute double LP, merged jazz and rock into the hybrid genre known as fusion. They remain Miles Davis's most controversial recordings.  Davis, along with pianists Herbie Hancock, Chick Corea, and Joe Zawinul; bassist Dave Holland; soprano saxophonist Wayne Shorter; bass clarinetist Benny Maupin; drummers Jack DeJohnette, Billy Cobham, and Lenny White; and percussionist Airto Moreira, went electric with rock rhythms, and the rest, as they say, is history, or as some feel, the end of jazz history.\nNow, all of the sessions' 265 minutes are contained on this four-CD set, compiled from alternate takes, nine unreleased tracks, and selections from previously released LPs.  The superb remastering reveals the spectral power of Davis's amplified, muted, and open trumpet painting on a swirling harmonic canvas created by Hancock, Corea, and Zawinul, especially on Zawinul's impressionistic 'Pharoah's Dance,' Shorter's elliptical 'Sanctuary,' and Davis's rocking 'John McLaughlin.'\n\nThe previously unreleased tracks, including 'Yaphet,' 'Corrado,' 'Tevere,' 'The Big Green Serpent,' and Zawinul's 'Double Image,' contain some interesting East Indian motifs and inventive arrangements but will probably not change anyone's mind about this well-debated period of Miles Davis's career.  ~ Eugene Holley Jr. \n\nThe Complete Bitches Brew Sessions is a four-disc box set of music recordings by trumpeter Miles Davis. The set collects tracks that Davis recorded between August 19, 1969 and February 6, 1970, including the 1970 double album Bitches Brew in its entirety.  However, the title of the box set is somewhat of a misnomer: outside of the Bitches Brew tracks themselves, none of the other tracks appeared on Bitches Brew upon its original release, nor were they recorded during the same August 1969 sessions that resulted in Bitches Brew.  Furthermore, additional material recorded for, but not used in Bitches Brew, is not included in this set.\n\nThe box set includes some tracks that had never been previously released, one of which, the Wayne Shorter composition 'Feio,' has since appeared as a bonus track on compact disc reissues of Bitches Brew.  Other tracks in the box set had previously appeared on the albums Live-Evil, Big Fun, and Circle in the Round.\n\nIt's the classic story.  A highly reputable artist with a following suddenly decides it's time for a change.  To his loyal followers and admirers, he has ruined everything!  WTF was Miles thinking?  The same can be said for Bob Dylan.  In retrospect, Bitches Brew was a very bold move artistically (duh).  Even in alienating himself from old fans, he brought in a whole slew of younger, hipper people.  Go electric, amplify the horn, add weird effects to it, jam out with a dozen guys for half an hour, and call the track 'Bitches Brew'.  Actually, upon hearing that title track the first time, I found it kind of scary.  Dark, forboding organ chords pounding in free time.  Suddenly, a burst of drums, organ and bass.  This happens a couple of times. Then Miles' trumpet, laced with delay, creeps in, and adds to this gigantic sound.  After about 3 minutes, everything stops.  A steady bass line ensues, accompanied by bassoon and finger snaps(?!)  Eventually everybody else comes back, and jams the rest of this monstrous, half hour track.  It's quite a hard listen, to say the least. I fell asleep the first time. It was pretty disheartening.  Approach it with an open mind, give it a listen.  \nOther than that, my favorite track is 'Miles Runs the Voodoo Down'.  Don Alias and Jack Dejohnette lay down a very sexy groove, to which John McLaughlin tastefully complements.  It, too, grows to be an enormous jam session. \n\nAnother aside.  Once, by accident,  two CD players were going in my house.  I don't know when we started the second one, but here's the deal. 'Pharaoh's Dance' was playing at the same time as 'Cowboys' by Portishead.  Same Tempo, same hectic feel.  I believe once, when the vocals cut out in 'Cowboys', Miles seemed to come out of nowhere in 'Pharao's'.  You might check that out.  It was pretty trippy. \n\nOverall, one of the strangest musical experiences I can recall.  But, in retrospect, most people can agree on the lasting power that is Bitches Brew. ~ N. Lang 'nicklang2'\n\nPersonnel:\nDon Alias - Percussion, Conga, Drums\nKhalil Balakrishna - Sitar\nHarvey Brooks - Bass, Electric bass\nRon Carter - Bass\nBilly Cobham - Drums, Triangle\nChick Corea - Electric piano\nMiles Davis - Trumpet, Vocals\nJack DeJohnette - Drums\nSteve Grossman - Soprano saxophone\nHerbie Hancock - Electric piano\nDave Holland - Bass, Electric bass\nBennie Maupin - Bass clarinet\nJohn McLaughlin - Guitar\nAirto Moreira - Berimbau, CuÃƒÂ­ca, Percussion\nBihari Sharma - Tabla, Tamboura\nWayne Shorter - Soprano saxophone\nJuma Santos (Jim Riley) - Conga, Shaker\nLenny White - Drums\nLarry Young - Organ, Celeste, Electric piano\nJoe Zawinul - Electric piano\n\nMiles Davis - The Complete Bitches Brew Sessions CD 1 Tracks: \n01  Pharaoh's Dance - Miles Davis, Zawinul, Joe  \n02  Bitches Brew  \n03  Spanish Key  \n04  John McLaughlin  \n\nMiles Davis - The Complete Bitches Brew Sessions CD 2 Tracks: \n05  Miles Runs the Voodoo Down  \n06  Sanctuary - Miles Davis, Shorter, Wayne  \n07  Great Expectations  \n08  Orange Lady - Miles Davis, Zawinul, Joe  \n09  Yaphet  \n10  Corrado  \n\nMiles Davis - The Complete Bitches Brew Sessions CD 3 Tracks: \n11  Trevere  \n12  The Big Green Serpent  \n13  The Little Blue Frog  [Alt]\n14  The Little Blue Frog  [Mst]\n15  Lonely Fire  \n16  Guinnevere - Miles Davis, Crosby, David [1]  \n\nMiles Davis - The Complete Bitches Brew Sessions CD 4 Tracks: \n17  Feio - Miles Davis, Shorter, Wayne  \n18  Double Image - Miles Davis, Zawinul, Joe  \n19  Recollections - Miles Davis, Zawinul, Joe  \n20  Take It or Leave It - Miles Davis, Zawinul, Joe  \n21  Double Image - Miles Davis, Zawinul, Joe","torrent":{"xt":"urn:btih:81d457e10a9c2c1a359f4b69794a706bb589f827","amp;dn":"Miles+Davis+-+The+Complete+Bitches+Brew+Sessions+%281970%29+CD2+of+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81d457e10a9c2c1a359f4b69794a706bb589f827","infoHashBuffer":{"type":"Buffer","data":[129,212,87,225,10,156,44,26,53,159,75,105,121,74,112,107,181,137,248,39]},"announce":[],"urlList":[]}}