{"title":"Silverhead 3 Albums 1972-73 (Glam Rock)","uid":4837713,"size":313203333,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:81e646b52ecb78eecd99cf23b58178e5dd008ad6&amp;dn=Silverhead+3+Albums+1972-73+%28Glam+Rock%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":41,"time":1239382346,"description":"Silverhead 3 Albums 1972-73 (Glam Rock)\n\nBiography\tby Greg Prato \nJust like every musical movement, the original glam rock era of the early '70s spawned both renowned artists (David Bowie, Alice Cooper, T. Rex, Slade, etc.) and bands that never caught on despite high hopes, such as Jobriath, the New York Dolls, and Silverhead. Comprised of Michael Des Barres (vocals), Rod Davies (percussion, vocals, guitar), Nigel Harrison (bass), Pete Thompson (keyboards, drums), and Stevie Forest (guitar, vocals), Silverhead signed on with Deep Purple's short-lived label, Purple Records, in the early '70s. The British quintet's self-titled debut was issued in 1972, with production chores handled by Deep Purple/future-Iron Maiden studio man Martin Birch. Judging from the album cover alone (which showed a dolled-up Des Barres, posing for the camera and wearing huge bell-bottom trousers), Des Barres was the band's leader and main focal point from the get-go. Armed with such T. Rex-esque song titles as &quot;Long Legged Lisa,&quot; &quot;Ace Supreme,&quot; and &quot;Silver Boogie,&quot; Silverhead should have fit in perfectly with the genre's heavy hitters, but for reasons unknown, Silverhead's debut failed to catch on with the masses.\n\nForest was replaced by Robbie Blunt for the group's sophomore effort, 1973's 16 and Savaged, but like its predecessor, it too failed to ignite the charts. An appearance in an unreleased movie called Arizonaslim failed to boost band morale, as Silverhead split up shortly thereafter, with a post-mortem live album being issued in Japan during 1976, Live at Rainbow. Harrison went on to be a member of another forgotten '70s rock outfit, Nite City, before signing on with new wave hitmakers Blondie, while Blunt would play on several solo releases by ex-Led Zeppelin frontman Robert Plant during the '80s. Des Barres also continued on, first as a member of the obscure outfit Detective, then as a solo artist and TV/movie actor, before landing a gig as Robert Palmer's replacement in the Duran Duran off-shoot group the Power Station. Although Des Barres never recorded with the band, it was the Des Barres-led version of the group that performed at the mammoth Live Aid benefit concert in 1985. In the late '90s, both Silverhead and 16 and Savaged were reissued on CD with remastered sound and extra bonus tracks, in addition to another live album being issued solely for the Japanese market, Show Me Everything. \n &lt;a href=&quot; http://allmusic.com/cg/amg.dll?p=amg&amp;sql=11:dpfrxq95ldae~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://allmusic.com/cg/amg.dll?p=amg&amp;sql=11:dpfrxq95ldae~T1&lt;/a&gt;\n\nSilverhead were a British band, led by singer/actor Michael Des Barres. They recorded two studio albums Silverhead (1972) and 16 And Savaged (1973), and were a part of the glam rock music scene of the 1970s.\n\nIn the UK they played support to bands like Nazareth at Finsbury Park, Osibisa at the Brixton Sundown and were the lead band in the Dagenham Roundhouse. One of the &quot;nearly but never made it bands&quot; of the seventies. Work on a third studio album (working title Brutiful) started in 1974, but the group disbanded before it was finished.\n\nCD (1997) To Mp3 256 mbit/s\nIncluded: CD Covers and this Info\nSilverhead - Silverhead (1972) Tracklist:\n01. Long-Legged Lisa\n02. Underneath the Light\n03. Ace Supreme\n04. Johnny\n05. In Your Eyes\n06. Rolling With My Baby\n07. Wounded Heart\n08. Sold Me Down the River\n09. Rock and Roll Band\n10. Silver Boogie\n11. Ace Supreme \n12. Oh No No No\n\nCD (1987) To Mp3 256 mbit/s\nIncluded: CD Covers and this Info\nSilverhead - 16 And Savaged (1973) Tracklist:\n01. Hello New York\n02. More Than Your Mouth Can Hold\n03. Only You\n04. Bright Light\n05. Heavy Hammer\n06. Cartoon Princess\n07. Rock Out Claudette Rock Out\n08. This Ain't A Parody\n09. 16 And Savaged\n\nCD To To Mp3 256 mbit/s\nIncluded: Covers and this Info\nSilverhead - Live at The Rainbow (1973) Tracklist:\n01. Hello New York\n02. James Dean \n03. Sold Me Down The River\n04. Rock Out Claudette Rock Ou\n05. Only You\n06. Ace Supreme\n07. Rolling With My Baby\n08. Will You Finance My Rock And Roll Band\n09. Leon [Bonus]\n10. New Moon Tonight [Bonus]\n\nLineup:\nRod Davies - percussion, vocals, guitar\nMichael Des Barres - vocals\nNigel Harrison - bass\nPete Thompson - keyboards, drums\nStevie Forest - guitar, vocals (on Silverhead album)\nRobbie Blunt - guitar, vocals (on 16 and Savaged album)\n\nDes Barres later joined Power Station before moving into acting full-time\nHarrison later joined Blondie\nBlunt later joined Robert Plant &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Silverhead&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Silverhead&lt;/a&gt;","torrent":{"xt":"urn:btih:81e646b52ecb78eecd99cf23b58178e5dd008ad6","amp;dn":"Silverhead+3+Albums+1972-73+%28Glam+Rock%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81e646b52ecb78eecd99cf23b58178e5dd008ad6","infoHashBuffer":{"type":"Buffer","data":[129,230,70,181,46,203,120,238,205,153,207,35,181,129,120,229,221,0,138,214]},"announce":[],"urlList":[]}}