{"title":"Djembe 2","uid":3389011,"size":56507366,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:81f6e01e7870ef1fde4d9b68895e81d4e3362c0d&amp;dn=Djembe+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cedemera","files":5,"time":1127858867,"description":"Master percussionist Adama Drame is a sixth-generation Djeli griot from the Malinke region of South Africa. Following in his father's footsteps, Drame became a djembe-playing griot--a revered village storyteller/historian, who recites his people's important events -- wars, family histories, seasons and hunts -- to the rhythms of the djembe drum. A griot's performance can last beyond a full night, and mistakes in tempo or phrasing are not tolerated. Once Drame decided to become a griot, he and his father practiced extensively, and he joined his father's group at the age of 12. Though the griot's purpose is preserving the heritage of his culture, Drame's father also added modern touches to his band, including guitar, accordion and a horn section. Similarly, Drame extended his musical range to an assortment of drums, including the talking drum, the bongolo and the tchoun, and expanded the international presence of the griot by taking his performance to venues all over the world. Recordings like Giant of Djembe and Mandingo Drums spread his message of South African cultural preservation and revitalization even further. Along with his performing and recording duties, Drame is a percussion instructor and the artistic leader of the Ballet Foliba. ~ Heather","torrent":{"xt":"urn:btih:81f6e01e7870ef1fde4d9b68895e81d4e3362c0d","amp;dn":"Djembe+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81f6e01e7870ef1fde4d9b68895e81d4e3362c0d","infoHashBuffer":{"type":"Buffer","data":[129,246,224,30,120,112,239,31,222,77,155,104,137,94,129,212,227,54,44,13]},"announce":[],"urlList":[]}}