{"title":"The Man Who Ended War by Hollis Godfrey","uid":8290898,"size":829153,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:824fc04d8569ac3fd27b3cf9a1ceda6b732e23d1&amp;dn=The+Man+Who+Ended+War+by+Hollis+Godfrey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"imarion","files":-1,"time":1364000211,"description":"The Secretary of War of the United States receives a letter sent to his and all other nations, declaring that war has too long devastated the earth and the time has come for peace. It orders them to destroy their weapons of warfare and disband their militaries. The letter ends: &quot;One year from this date will I allow for disarmament and no more. At the end of that time, if no heed has been paid to my injunction, I will destroy, in rapid succession, every battleship in the world. By the happenings of the next two months you shall know that my words are the words of truth.&quot; It is signed &quot;The man who will stop all war.&quot;\n\nThe government officials at first dismiss this as a letter from a crank. Then a few battleships vanish, one per week, without a trace. What new technology enables this man to carry out his threat? Can he be found and stopped? Will the major powers of the world agree to disarm or will they blame each other and start a war?\n\nRecipe: Take an American investigative reporter, add his science professor friend and the professor's beautiful intelligent sister, throw in some early 20th century quasi-science, some romantic longing, some detective work in London, and a good measure of suspense. ","torrent":{"xt":"urn:btih:824fc04d8569ac3fd27b3cf9a1ceda6b732e23d1","amp;dn":"The+Man+Who+Ended+War+by+Hollis+Godfrey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"824fc04d8569ac3fd27b3cf9a1ceda6b732e23d1","infoHashBuffer":{"type":"Buffer","data":[130,79,192,77,133,105,172,63,210,123,60,249,161,206,218,107,115,46,35,209]},"announce":[],"urlList":[]}}