{"title":"Fifa 12 [Xbox360][RegFree]","uid":6803032,"size":7838695473,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:828bb94105026f1018acfd5e8cfc0fac2c2b3e8f&amp;dn=Fifa+12+%5BXbox360%5D%5BRegFree%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"spygat","files":2,"time":1320758597,"description":"Region : RF \nLanguages: English, EspaÃƒÂ±ol, Suenska, Norsk, Dansk\nSize : 01 x DISC \nGenre : Sports - Football\nPlatform : XBOX 360 \n\n\n\nRelease Info:\n\nFIFA Soccer 12 brings to the pitch the game-changing new Player Impact Engine, a physics engine built to deliver real-world physicality in every interaction on the pitch. Experience the way real-world players challenge each other for the ball, win possession, and test each other physically. Enjoy an infinite variety of natural and believable outcomes in every collision. Players feel more resilient, push and pull during the fight for possession, and recover from light challenges more easily.\nRevolutionary gameplay innovations make FIFA 12 deeper and more engaging. All-new Precision Dribbling creates a higher fidelity of touch on the ball for better control in tight spaces, more time to make decisions on attack, and more control over the pace of the game. Defending has been re-designed to make it as skilful and meaningful as the real-world game with all-new Tactical Defending, where positioning and intercepting passes are as important as tackling. Tactics and timing are crucial.\nCPU players have been infused with Pro Player Intelligence, a self-awareness that enables them to behave and make decisions based on their own skills and tendencies, and gives them the aptitude to understand the strengths and weaknesses of teammates in every situation. Transformed to look and feel fresh and new from pre-match to final whistle, FIFA Soccer 12 delivers an authentic Match Day experience, faster and easier navigation, and over 500 officially licensed clubs.","torrent":{"xt":"urn:btih:828bb94105026f1018acfd5e8cfc0fac2c2b3e8f","amp;dn":"Fifa+12+%5BXbox360%5D%5BRegFree%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"828bb94105026f1018acfd5e8cfc0fac2c2b3e8f","infoHashBuffer":{"type":"Buffer","data":[130,139,185,65,5,2,111,16,24,172,253,94,140,252,15,172,44,43,62,143]},"announce":[],"urlList":[]}}