{"title":"Kenny Rogers &amp; Dolly Parton - Christmas Without You(2nafish)","uid":6013266,"size":230121476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8298ef497334af853dc45f95fbde9ad8567b8787&amp;dn=Kenny+Rogers+%26+Dolly+Parton+-+Christmas+Without+You%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1291539017,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nOnce Upon a Christmas is a 1984 Christmas album by Dolly Parton and Kenny Rogers. This album has sold over 7 million copies world-wide.\n\nThe album was accompanied by a now classic CBS Christmas television special titled Kenny &amp; Dolly: A Christmas to Remember that originally aired on December 2, 1984 (which has been rerun numerous years), though never issued on home video or DVD despite public demand (bootleg copies have been produced in large quantities). A single, &quot;The Greatest Gift of All&quot; (#53 Country, #81 Pop, and #40 Adult Contemporary) was released from the album. In the United Kingdom &quot;Christmas Without You&quot; was issued as the single. This album became one of the biggest Christmas albums of the 1980s and still sells today, with &quot;A Christmas to Remember&quot; played by U.S. radio stations and satellite radio during the Christmas holiday season.\n\nKenneth Donald Rogers (born August 21, 1938), better known as Kenny Rogers, is an American country music singer-songwriter, photographer, record producer, actor and entrepreneur. He has charted more than 120 hit singles across various music genres and topping the country and pop album charts for more than 200 individual weeks in the United States alone.\n\nTwo of his albums, The Gambler and Kenny, are featured in the About.com poll of &quot;The 200 Most Influential Country Albums Ever&quot;. He was voted the &quot;Favorite Singer of All-Time&quot; in a 1986 joint poll by readers of both USA Today and People. He has received hundreds of awards for both his music and charity work. These include AMAs, Grammys, ACMs and CMAs, as well as a lifetime achievement award for a career spanning six decades in 2003.\n\nDolly Rebecca Parton (born January 19, 1946) is an American singer-songwriter, author, multi-instrumentalist, actress and philanthropist, best-known for her work in country music.\n\nIn the four-and-a-half decades since her national-chart dÃƒÂ©but, she remains one of the most-successful female artists in the history of the country genre which garnered her the title of 'The Queen of Country Music', with twenty-five number-one singles, and a record forty-one top-10 country albums. She has the distinction of having performed on a top-five country hit in each of the last five decades and is tied with Reba McEntire as the only country artists with No. 1 singles in four consecutive decades.\n\nShe is known for her distinctive soprano, sometimes bawdy humor, flamboyant dress sense and voluptuous figure.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8298ef497334af853dc45f95fbde9ad8567b8787","amp;dn":"Kenny+Rogers+%26+Dolly+Parton+-+Christmas+Without+You%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8298ef497334af853dc45f95fbde9ad8567b8787","infoHashBuffer":{"type":"Buffer","data":[130,152,239,73,115,52,175,133,61,196,95,149,251,222,154,216,86,123,135,135]},"announce":[],"urlList":[]}}