{"title":"Marco Polo A Play About LRH and COS","uid":7313743,"size":1119854,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83034a7f1ab607937efc8439f13dacb12e43a06d&amp;dn=Marco+Polo+A+Play+About+LRH+and+COS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pricegeoffrey","files":4,"time":1338418464,"description":"Marco: Polo\nA Play About LRH &amp; COS\nBy \nPrice Geoffrey\n\n\nAct One: Sunset Strip, Peering Over the Edge of the Time-Track\nAct Two: Flag, Beasley AFB, Trimountaine COS, Vaporized And Blown \nAct Three: Clearwater, Super-Power\n\n(Partial Cast of) Characters\nSpeaking:\n_\tKate and Price: Wife/Husband, dated in Air Force, AKA &quot;America's RN&quot;, \tSinger/Guitarist. \n_\tMarJon and Delfino: Kate's friends from Clearwater\n\n_\tBill Clinton, Hillary, Chelsea: Former President of the USA, wife and daughter\n_\tPornyPete: Price's agent, recommended by Delfino\n_\tPsychiatrist: In attendance, Hollywood Hospital ER\n\nFrom the &quot;Production Notes&quot;:\n\nOnce it is banned in your democracy or republic, a production of Marco: Polo can be exceedingly dangerous to your liberties. Minimizing your exposure to detention and mistreatment by the police is critical. Thankfully, any reading or production of Marco: Polo can be done easily and on-the-go. \n\nAside from the sets, which can be improvised in any way you want, the characters all wear street clothes, except for the Air Force uniforms. Since your mobility is most desired, simply forgoing uniform costumes altogether is probably the wisest course of action if you attempt to stage a reading or, unadvisedly, a full-on production of Marco: Polo. Don't go overboard. Using street-clothing allows you to blend back in if your production is raided by the authorities. \n\nDon't worry about reproducing the sounds or music in the play. Elaborate audio systems are not necessary. \n\nWhether you are in the audience or a member of the cast and crew, as with any political event, wear comfortable shoes in which you can take flight. Also, wear headgear like a ball cap with a low bill that darkens your features. You are very likely being video-recorded in public while you are going to and leaving this event. Again, I would stay home and avoid it like the plague. Audience members are superfluous, a luxury really, when you consider how easily they can be infiltrated with informers and agents of the State.  \n\nIf you are producing or even staging a table-reading of Marco: Polo, don't risk whatever little amount of freedom you currently enjoy on anything that will tie you down. Get in and get out. Forget seating. If they show up, the audience can stand there and watch. They are more likely to become entangled with the seating when the production is raided, breaking rented equipment (and exposing you to yet further criminal and civil charges) and possibly getting hurt (more criminal charges and medical bills for you to deal with).\n","torrent":{"xt":"urn:btih:83034a7f1ab607937efc8439f13dacb12e43a06d","amp;dn":"Marco+Polo+A+Play+About+LRH+and+COS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83034a7f1ab607937efc8439f13dacb12e43a06d","infoHashBuffer":{"type":"Buffer","data":[131,3,74,127,26,182,7,147,126,252,132,57,241,61,172,177,46,67,160,109]},"announce":[],"urlList":[]}}