{"title":"Pore Scale Phenomena - Frontiers in Energy and Environment","uid":14847055,"size":65066606,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83057cb0ec4fddf8b7bf87aad3ce103c687cc969&amp;dn=Pore+Scale+Phenomena+-+Frontiers+in+Energy+and+Environment&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1465424107,"description":"Pore Scale Phenomena - Frontiers in Energy and Environment - John Poate et al. (World Scientific, 2015).pdf\r\n\r\nISBN 9789814623056\r\n\r\nThe field of pore scale phenomena is now emerging as one of the frontiers of science and many engineering disciplines. Transport phenomena in the subsurface of the earth play key roles in the energy and environmental domains. For example, the shale gas and oil boom is revolutionizing the world's energy portfolio. Pore scale phenomena from the nanoscale to mesoscale dominate the extraction of these resources. Similarly in the environmental domain, pore storage and pore-scale physics affect the availability of water resources and protecting its quality. Water flow and vapor transport in the pores near the land surface is critical to understanding soil water evaporation in the context of local and global hydrologic cycles affecting climate and climate change.\r\n\r\nPore scale phenomena similarly play critical roles in the domain of materials science and biology. For example, many energy devices and membrane technologies are controlled by the physical and chemical properties of the pores. Identifying and analyzing the properties of these pores has emerged as a frontier of characterization science.\r\n\r\nThis book provides, for the first time, a comprehensive overview of the fascinating interrelationship between engineering and science. The authors and contributors are recognized experts from the faculty of the Colorado School of Mines, Northwestern and Stanford. This book will appeal to earth and environmental scientists, materials scientists, physicists and chemists","torrent":{"xt":"urn:btih:83057cb0ec4fddf8b7bf87aad3ce103c687cc969","amp;dn":"Pore+Scale+Phenomena+-+Frontiers+in+Energy+and+Environment","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83057cb0ec4fddf8b7bf87aad3ce103c687cc969","infoHashBuffer":{"type":"Buffer","data":[131,5,124,176,236,79,221,248,183,191,135,170,211,206,16,60,104,124,201,105]},"announce":[],"urlList":[]}}