{"title":"A Night at the Opera Audio DVD","uid":4747346,"size":3589829306,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:834aebffa52293023ad6f96f8c044e51f50d5255&amp;dn=A+Night+at+the+Opera+Audio+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mattyl","files":32,"time":1235948871,"description":"On audio DVD, A Night at the Opera sounds so clear, so great. It's as if you can hear the chart hits You're My Best Friend and Bohemian Rhapsody for the first time, all over again. Though the rest of the tracks are not remotely as familiar to the casual fan, such as myself, they are nicely arranged and mixed in to help compile what is regarded as Queen's greatest release.\n\nIncluded are song lyrics displayed on the television screen as the tracks proceed from one to the next and the video of Bohemian Rhapsody, where the sound quality is not quite so stellar as the strictly DVD audio-only version.\n\nA musical triumph, A Night at the Opera on audio DVD rekindles and revisits the passion and the grandeur of great musicians and vocalists who would do what it took to get to the top of their game, even if it meant occasionally going over the top. \n\nThis release (which has a black spine and border) has 5 channel surround sound mixes produced by Roy Thomas Baker and Brian May. Some sources suggest that there was also a DVD-Audio disc in the USA in 2001, which features a blue spine/border, and contains a 4 channel mix by Elliot Scheiner (without Brian), and that the disc was withdrawn as Brian was unhappy with it. However, I cannot confirm whether this is correct, and if so, what the differences between the discs and the mixes are. If the disc was released, it now seems very difficult to get hold of.\n\nPlease seed","torrent":{"xt":"urn:btih:834aebffa52293023ad6f96f8c044e51f50d5255","amp;dn":"A+Night+at+the+Opera+Audio+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"834aebffa52293023ad6f96f8c044e51f50d5255","infoHashBuffer":{"type":"Buffer","data":[131,74,235,255,165,34,147,2,58,214,249,111,140,4,78,81,245,13,82,85]},"announce":[],"urlList":[]}}