{"title":"The Holy Scriptures vs. The Holy Koran - Dr. Peter S. Ruckman","uid":10345814,"size":4440659,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84fcd4e505e553084f944594ce805a0a63b12d0d&amp;dn=The+Holy+Scriptures+vs.+The+Holy+Koran+-+Dr.+Peter+S.+Ruckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1402601531,"description":"&quot;There is a gulf between the Bible and the so-called 'sacred' books of the East which severs the one from the other utterly, hopelessly, and forever - a veritable gulf which cannot be bridged over by ANY science or religious thought&quot; (Sir Monier Williams).\nIn this work, Dr. Ruckman demonstrates the truth of Sir Williams' statement in relation to the &quot;Holy&quot; Koran of Mohammed's religion. He shows the stark contrast between the two &quot;holy&quot; books (see Rom. 1:2; 2 Tim. 3:15 in regards to the Holy Bible) that both claim to be from the same &quot;God.&quot;\nUsing the text and interpretation of the Koran by one of the most brilliant Islamic scholars who ever lived (Maulana Muhammad Ali), the doctrines of Mohammedanism are laid out and refuted from the Holy Scriptures as found in the Authorized King James Version.\n\n\nAbout the author:\nDr. Peter S. Ruckman received his Bachelor of Arts degree from the University of Alabama and finished his formal education with six years of training at Bob Jones University (four full years and two accelerated summer sessions), completing requirements for the Master of Arts and Doctor of Philosophy degree. Reading at a rate of seven hundred words per minute, Dr. Ruckman had managed to read about 6,500 books before receiving his doctorate, and he still reads an average of a book each day.\nDr. Ruckman stands for the absolute authority of the Authorized Version and offers no apology to any recognized scholar anywhere for his stand. In addition to preaching the gospel and teaching the Bible, Dr. Ruckman has produced a comprehensive collection of apologetic and polemic literature and resources supporting the authority of the Authorized Version of the Holy Scriptures.","torrent":{"xt":"urn:btih:84fcd4e505e553084f944594ce805a0a63b12d0d","amp;dn":"The+Holy+Scriptures+vs.+The+Holy+Koran+-+Dr.+Peter+S.+Ruckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84fcd4e505e553084f944594ce805a0a63b12d0d","infoHashBuffer":{"type":"Buffer","data":[132,252,212,229,5,229,83,8,79,148,69,148,206,128,90,10,99,177,45,13]},"announce":[],"urlList":[]}}