{"title":"Coast to Coast Am June 22, 2013 - Science-Fiction Phantasmagoria","uid":8636242,"size":58158143,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:850a6713c5320e657c4dd59b92adffcfc47b6e5f&amp;dn=Coast+to+Coast+Am+June+22%2C+2013+-+Science-Fiction+Phantasmagoria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1372755245,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-22-13\nHost:\nJohn B. Wells\nGuests:\nLarry  Niven,             Joe  Haldeman,             Lois McMaster  Bujold,                   Paul  Di Filippo\nJohn B. Wells welcomed four highly respected science fiction authors for a discussion on their respective careers and works as well as how sci-fi can help us predict the future. In the first hour, Larry Niven recalled how it took about a year for him to sell his first short story. While the sale only netted him a mere &quot;twenty-five bucks,&quot; he marveled that it &quot;changed my life&quot; and launched a now-legendary career. In advising young writers, Niven suggested they &quot;start by daydreaming&quot; and stressed that developing a strong imagination should come before mastering the mechanics of writing. Regarding scenarios he penned which may become reality, he warned that the harvesting of organs from executed criminals has dangerous potential and claimed that such a practice is already happening in China.  \nDuring the second hour, Joe Halderman mused that success as a writer depends as much on luck as it does skill and observed that one out of four writers seem to sell their first story, which, in turn, fuels their drive to continue writing. &quot;You can't help but score a few times,&quot; he said about foretelling future events when writing science fiction. To that end, Halderman noted that he correctly predicted a president named &quot;Ford&quot; and joked &quot;that was hard.&quot; Looking at the state of the world, he expressed less fear of nuclear annihilation than in the past and opined that, in the grand scheme of human history, &quot;we probably aren't even halfway to whatever the end point will be,&quot; provided that an unforeseen event, such as an asteroid hitting the planet, doesn't happen.  \nThird hour guest, Lois McMaster Bujold, reflected on the female perspective in the science fiction field. Despite what seems to be a scarcity of women sci-fi writers, she pointed out that the &quot;founding novel of the genre is generally considered to be Mary Shelley's Frankenstein.&quot; As opposed to the space-based themes which constitute much of the science fiction landscape, Bujold explained that her work focuses more on fields like medicine, genetics, biology, and bio-engineering. As such, one concept she has explored in her novels is a technology called the &quot;uterine replicator,&quot; which would allow for gestation of embryos outside of the female body. &quot;Unlike faster than light travel, it is not a 'ruled out by the laws of physics' technology,&quot; she said, &quot;all it would take is some engineering at this point.&quot; \n&quot;Science fiction is a big tent that really incorporates a vast spectrum of themes and topics and approaches and attitudes,&quot; fourth hour guest Paul Di Filippo said, &quot;and I've tried to play in every corner of that tent I can reach.&quot; He attributed this to a desire to keep his work fresh and to remain engaged in the writing process. Over the course of his appearance, he talked about science fiction in comics as well as the cyberpunk and steampunk genres. Contrasting the three previous guests, who each expressed deep skepticism over the reality of UFOs, Di Filippo revealed that &quot;day to day, I switch my position&quot; on the subject, but conceded that the evidence has, so far, shown to be lacking. \nWebsite(s):\n larryniven.net\n paul-di-filippo.com\n dendarii.com\n joehaldeman.com\nBook(s):\n Return to the Twentieth Century\n The Steampunk Trilogy\n Young Miles (Miles Vorkosigan Adventures)\n Captain Vorpatril's Alliance (Vorkosigan Saga) \n Marsbound\n The Forever War\n The Goliath Stone\n Ringworld\n","torrent":{"xt":"urn:btih:850a6713c5320e657c4dd59b92adffcfc47b6e5f","amp;dn":"Coast+to+Coast+Am+June+22%2C+2013+-+Science-Fiction+Phantasmagoria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"850a6713c5320e657c4dd59b92adffcfc47b6e5f","infoHashBuffer":{"type":"Buffer","data":[133,10,103,19,197,50,14,101,124,77,213,155,146,173,255,207,196,123,110,95]},"announce":[],"urlList":[]}}