{"title":"La bella addormentata nel bosco, [DVD9 - Ita Eng - Sub Ita Eng] ","uid":5230420,"size":7398305792,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8593f6a157e1565c0bb27156183ec0ea7b45d359&amp;dn=La+bella+addormentata+nel+bosco%2C+%5BDVD9+-+Ita+Eng+-+Sub+Ita+Eng%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"year2012","files":81,"time":1261310091,"description":"La bella addormentata nel bosco, [DVD9 - Ita Eng - Sub Ita Eng] Animazione [Tntvillage]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=La%20bella%20addormentata%20nel%20bosco&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=anno2036&amp;sb=1&amp;sd=0&amp;cat=0\n\nLa bella addormentata nel bosco\nby anno2036\n\nLocandina del film\n Visit this link:\n\nSCHEDA DEL FILM\nTitolo originale: \tSleeping Beauty\nPaese: Stati Uniti\nAnno: 1959\nDurata: 72 min\nColore: colore\nAudio: sonoro\nGenere: animazione, fantastico\nRegia: Clyde Geronimi, Les Clark, Eric Larson, Wolfgang Reitherman\nSoggetto: Erdman Penner, Charles Perrault\nSceneggiatura: \tJoe Rinaldi, Winston Hibler, Bill Peet, Ted Sears, Ralph Wright, Milt Banta\nProduttore: Walt Disney\nCasa di produzione: \tWalt Disney Productions\nDistribuzione (Italia): Buena Vista Distribution (originalmente), Walt Disney Pictures (dagli anni '90)\nAnimatori: Milt Kahl, Frank Thomas, Marc Davis, Ollie Johnston, John Lounsbery, Hal King, Hal Ambro, Don Lusk, Blain Gibson, John Sibley, Bob Carlson, Ken Hultgren, Harvey Toombs, George Nicholas, Bob Youngquist, Eric Cleworth, Henry Tanous, John Kennedy, Ken O'Brien, Dan MacManus, Joshua Meador, Jack Boyd, Jack Buckley, Don Bluth (non accredicato)\n\nDoppiatori originali:\nMary Costa: Aurora, Rosaspina\nBill Shirley: Principe Filippo\nEleanor Audley: Malefica\nVerna Felton: Flora\nBarbara Jo Allen: Fauna\nBarbara Luddy: Serena (Serenella)\nTaylor Holmes: Re Stefano\nBill Thompson: Re Umberto\nMarvin Miller: Voce narrante\n\nDoppiatori italiani:\nMaria Pia Di Meo: Aurora, Rosaspina (voce)\nTina Centi: Aurora (canto)\nSergio Tedesco: Principe Filippo\nTina Lattanzi: Malefica\nLydia Simoneschi: Flora\nRina Morelli: Fauna\nFlaminia Jandolo: Serena (Serenella)\nBruno Persa: Re Stefano\nGiorgio Capecchi: Re Umberto\nEmilio Cigoli: Voce narrante\n\nMontaggio: Roy M. Brewer Sr., Donald Halliday\nMusiche: Tom Adair, George Bruns, PÃƒÂ«tr Il'ic Cajkovskij\n\nTRAMA\nLa storia ha ambientazione medievale e narra di un regno lontano, dove il re Stefano e la regina sua moglie desiderano da tempo una bambina. Nasce loro un'erede cui danno il nome di Aurora. Ma la strega Malefica, offesa per il mancato invito al battesimo della piccola, promette la morte alla piccina entro il sedicesimo compleanno.\nGrazie alle tre buone fate madrine Flora, Fauna e Serenella l'infante Aurora (da loro soprannominata Rosaspina) riesce nonostante l'allontanamento dai genitori, necessario per la sua incolumitÃƒÂ , a trascorrere un'infanzia spensierata nei boschi circostanti. La ragazza incontra anche l'amore, un giovane e aitante principe di nome Filippo a dorso di un cavallo bianco.\nAllo scoccare del suo sedicesimo compleanno perÃƒÂ² la perfida Malefica riesce a trovarla ed a rimanere sola con lei. Con un sortilegio e un fuso (un attrezzo appuntito usato per filare la lana), la strega compie il suo piano diabolico. Malefica perÃƒÂ² non sa che la buona fata Serenella, al momento della sua profezia, aveva dato in dono alla neonata la possibilitÃƒÂ  di non morire ma di cadere in un sonno profondo &quot;dal quale si potrÃƒÂ  risvegliare solo attraverso il bacio del vero amore&quot;.\nEntra cosÃƒÂ¬ nuovamente in scena il bel Filippo. Con il suo coraggio e il grande amore verso Aurora il principe riesce a sconfiggere le forze del male impersonate da Malefica sotto forma di drago fiammeggiante ed a congiungersi con la propria amata, risvegliandola cosÃƒÂ¬ dall'incantesimo.\n\nCURIOSITA'\nLa bella addormentata nel bosco ÃƒÂ¨ uno dei lungometraggi di animazione Disney. ÃƒË† considerato il 16Ã‚Â° classico Disney secondo il canone ufficiale. CosÃƒÂ¬ come altre pellicole di quel periodo, il film nasce dall'intento di Walt e dei suoi collaboratori di fornire al pubblico una storia giÃƒÂ  conosciuta, ma arricchita dal magico ed incantato &quot;stile Disney&quot;. ÃƒË† tratto dall'omonima fiaba di Charles Perrault.\nIl film uscito nelle sale non ottenne il grande successo di pubblico dei suoi predecessori e fu ritenuto un flop: costato allora l'astronomica cifra di sei milioni di dollari, ne rincassÃƒÂ² solo la metÃƒÂ , portando la Disney prossima alla bancarotta. Il film, venne riscoperto e riabilitato a &quot;grande classico&quot; solo in seguito.\nIl film puÃƒÂ² essere paragonato maggiormente alla fiaba dei Fratelli Grimm: infatti nella loro fiaba la principessa si chiama Rosaspina, come nel cartone quando Aurora vive nel bosco, e non vi ÃƒÂ¨ inoltre la parte della madre Orchessa del Principe. Ma nei titoli di testa ÃƒÂ¨ scritto che il film ÃƒÂ¨ basato dalla fiaba di Perrault e a sua volta dal balletto di Cajkovskij.\nNella versione italiana la voce del re Stefano ÃƒÂ¨ quella di Bruno Persa, cioÃƒÂ¨ la stessa dell'attore americano Humphrey Bogart, mentre il re Umberto ÃƒÂ¨ doppiato da Giorgio Capecchi, che aveva dato la voce al signor Serratura in Alice nel paese delle meraviglie.\n\nCONTENUTI SPECIALI\nMaking of de &quot;La bella Addormentata nel Bosco&quot;\nGalleria della realizzazione dei personaggi\nGioco interattivo: &quot;Il Salvataggio di Aurora&quot;\nLo studio dei colori ed Inchiostro utilizzati\nArt Attack\nLa Produzione\nStoryboard\n\nCARATTERISTICHE DEL DVD\nDurata: 72 min.\nLingue: Italiano, Inglese\nSottotitoli: Italiano, Inglese\nFormato Video: 2.35:1 16/9\nFormato Audio: Dobly Digital 5.1 (taliano, Inglese)\nMenÃƒÂ¹: si\nContenuti extra: sÃƒÂ¬\nCompressione: no\n\nVisit","torrent":{"xt":"urn:btih:8593f6a157e1565c0bb27156183ec0ea7b45d359","amp;dn":"La+bella+addormentata+nel+bosco%2C+%5BDVD9+-+Ita+Eng+-+Sub+Ita+Eng%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8593f6a157e1565c0bb27156183ec0ea7b45d359","infoHashBuffer":{"type":"Buffer","data":[133,147,246,161,87,225,86,92,11,178,113,86,24,62,192,234,123,69,211,89]},"announce":[],"urlList":[]}}