{"title":"Handbook of Immunological Properties of Engineered Nanomaterials","uid":15220824,"size":9110878,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85eaeeb0a4616f46a86c82629ec5144d7c3029eb&amp;dn=Handbook+of+Immunological+Properties+of+Engineered+Nanomaterials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467734938,"description":"Handbook of Immunological Properties of Engineered Nanomaterials - M.A. Dobrovolskaia, S.E. McNeil (WSP, 2013).pdf\r\n\r\nISBN 978-981-4390-25-5\r\n\r\nThe Handbook of Immunological Properties of Engineered Nanomaterials provides a comprehensive overview of the current literature, methodologies, and translational and regulatory considerations in the field of nanoimmunotoxicology. The main subject is the immunological properties of engineered nanomaterials. Focus areas include interactions between engineered nanomaterials and red blood cells, platelets, endothelial cells, professional phagocytes, T cells, B cells, dendritic cells, complement and coagulation systems, and plasma proteins, with discussions on nanoparticle sterility and sterilization. Each chapter presents a broad literature review of the given focus area, describes protocols and resources available to support research in the individual focus areas, highlights challenges, and outlines unanswered questions and future directions. In addition, the Handbook includes an overview of and serves a guide to the physicochemical characterization of engineered nanomaterials essential to conducting meaningful immunological studies of nanoparticles. Regulations related to immunotoxicity testing of materials prior to their translation into the clinic are also reviewed.The Handbook is written by top experts in the field of nanomedicine, nanotechnology, and translational bionanotechnology, representing academia, government, industry, and consulting organizations, and regulatory agencies. The Handbook is designed to serve as a textbook for students, a practical guide for research laboratories, and an informational resource for scientific consultants, reviewers, and policy makers. It is written such that both experts and beginners will find the information highly useful and applicable","torrent":{"xt":"urn:btih:85eaeeb0a4616f46a86c82629ec5144d7c3029eb","amp;dn":"Handbook+of+Immunological+Properties+of+Engineered+Nanomaterials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85eaeeb0a4616f46a86c82629ec5144d7c3029eb","infoHashBuffer":{"type":"Buffer","data":[133,234,238,176,164,97,111,70,168,108,130,98,158,197,20,77,124,48,41,235]},"announce":[],"urlList":[]}}