{"title":"e35806fdc1b85674c8462621a8976de75ff34b3a88465b7e7c303b1664f31d1c","uid":8394323,"size":284314010,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8637ccbe93d895fb054f1149948b935e23374f11&amp;dn=e35806fdc1b85674c8462621a8976de75ff34b3a88465b7e7c303b1664f31d1c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1366527070,"description":"TEST TEST TEST: This listing makes use of a new feature of uTorrent 3.3.\n                Comment if it creates a problem for your setup.\n----------\n\nSTOSSEL - [The BLOB Strikes Back] - Fox Business Network\n2013, April 18, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nThe education BLOB--- that immovable jelly-like ball of teachers' and janitors' unions, the school board bureaucrats, PTAs, etc.---just keeps growing. As the number of students increased 96%, the number of administrative staff has increased 702%.\n\nThe BLOB eats most things that fight it. Ben Chavis founded The American Indian Charter Schools. The schools had very high test scores and they rated as the most challenging in the nation. But last month, the BLOB voted to close the chain, because Chavis broke some of its many rules.\n\nThe BLOB complains that taxpayers don't spend enough on education. But, Neal McCluskey, the Associate Director of CATO's Center for Educational Freedom, points out that we spend more and more--- now, about $14,000 per student---for the same results.\n\nWisconsin unions held big protests over Governor Scott Walker's collective bargaining reforms. Walker won, so what's happening in Wisconsin now? Kyle Olson of the Education Action Group explains that taxpayers pay much less, now that they are no longer forced to buy teachers' health insurance policies from a company founded by the union.\n\nHollee Saville, a daycare owner in Minnesota, doesn't want to join a union...but now, the BLOB wants to force the state's daycare workers to unionize.\n\nThe BLOB also wants national bureaucrats to decide what your kids learn. Lindsey Burke, Heritage Foundation's education expert, and Kathleen Porter-Magee, of the Thomas B. Fordham Institute, debate &quot;Common Core&quot; standards that would require all kids to study the same things and take the same tests.\n\nSome schools do escape the BLOB's grip...but not enough. 55 million students attend school in America. How many have access to vouchers or tax credits? Just one million. You can barely even see the line on the bar graph. Only 2.3 million go to charter schools. The BLOB is still in control.","torrent":{"xt":"urn:btih:8637ccbe93d895fb054f1149948b935e23374f11","amp;dn":"e35806fdc1b85674c8462621a8976de75ff34b3a88465b7e7c303b1664f31d1c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8637ccbe93d895fb054f1149948b935e23374f11","infoHashBuffer":{"type":"Buffer","data":[134,55,204,190,147,216,149,251,5,79,17,73,148,139,147,94,35,55,79,17]},"announce":[],"urlList":[]}}