{"title":"Private.Practice.S06E13.HDTV.x264-LOL","uid":8054103,"size":248617327,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8773e00892ec3bede4603fb13502c39d81ecd5d1&amp;dn=Private.Practice.S06E13.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thhaque","files":1,"time":1358918615,"description":"Private Practice\n\nGenre: Comedy, Drama\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Shonda Rhimes\nCast: KaDee Strickland, Taye Diggs, Kate Walsh, Tim Daly, Audra McDonald, Paul Adelstein\n\nIMDB: http://www.imdb.com/title/tt0972412/\n\n.: Plot :.\nIn this spin-off Grey's Anatomy, neonatal surgeon Dr. Addison Forbes Montgomery (Kate Walsh) relocates from Seattle Grace Hospital to the Oceanside Wellness Group in sunny Santa Monica, California following a failed marriage and two affairs. There she reconnects with medical school friends, Sam (Taye Diggs) and Naomi Bennett (Audra McDonald), friends she thought had the ideal life -- a successful marriage, lucrative wellness group, and a beautiful 14 year-old daughter. However, Addison finds that Sam's success as a TV health guru lead to the end of his marriage to Naomi, leaving them both lonely and searching for another relationship. The Group's surfer receptionist, Dell (Chris Lowell), thinks he's the one for Naomi, but she's unsure that a younger man is the answer to her relationship problems. \n\nThe other members of the Oceanside Wellness Group have their own share of personal issues as well. Peter Finch (Timothy Daly), an alternative medicine doctor, is dealing with the pain of losing his wife through a series of one-night stands. Cooper Freedman (Paul Adelstein), a pediatrician, relies on the Internet to hook up with women, but after having his car stolen by one of his hookups, he's slowly finding that the Internet may not be the best means to meeting the woman of his dreams. Violet Turner (Amy Brenneman), the resident therapist, doubts that she's doing any good for any of her patients and wonders if she's even able to help herself. \n\nBut aside from each of their personal problems, together the staff at Oceanside Wellness group combines cutting-edge work and alternative medicine to save lives. By joining the staff, Addison finds that a move to sunny Southern California may just be the right prescription for life.\n","torrent":{"xt":"urn:btih:8773e00892ec3bede4603fb13502c39d81ecd5d1","amp;dn":"Private.Practice.S06E13.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8773e00892ec3bede4603fb13502c39d81ecd5d1","infoHashBuffer":{"type":"Buffer","data":[135,115,224,8,146,236,59,237,228,96,63,177,53,2,195,157,129,236,213,209]},"announce":[],"urlList":[]}}