{"title":"The Great Tamasha - James Astill.epub","uid":9576535,"size":3049215,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87ac29311dbe1014306de12a1127a447572afb09&amp;dn=The+Great+Tamasha+-+James+Astill.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1391709015,"description":"To understand modern India, one must look at the business of cricket within the country.\n\nWhen Lalit Modi--an Indian businessman with a criminal record, a history of failed business ventures, and a reputation for audacious deal making--created a Twenty20 cricket league in India in 2008, the odds were stacked against him. International cricket was still controlled from London, where they played the long, slow game of Test cricket by the old rules. Indians had traditionally underperformed in the sport but the game remained a national passion. Adopting the highly commercial American model of sporting tournaments, and throwing scantily clad western cheerleaders into the mix, Modi gave himself three months to succeed. And succeed he did--dazzlingly--before he and his league crashed to earth amid astonishing scandal and corruption.\n\nThe emergence of the IPL is a remarkable tale. Cricket is at the heart of the miracle that is modern India. As a business, it represents everything that is most dynamic and entrepreneurial about the country's economic boom, including the industrious and aspiring middle-class consumers who are driving it. The IPL also reveals, perhaps to an unprecedented degree, the corrupt, back-scratching, and nepotistic way in which India is run.\n\nA truly original work by a brilliant journalist, The Great Tamasha* makes the complexity of modern India--its aspiration and optimism straining against tradition and corruption--accessible like no other book has.\n\n*Tamasha: a Hindi world meaning &quot;a spectacle.","torrent":{"xt":"urn:btih:87ac29311dbe1014306de12a1127a447572afb09","amp;dn":"The+Great+Tamasha+-+James+Astill.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87ac29311dbe1014306de12a1127a447572afb09","infoHashBuffer":{"type":"Buffer","data":[135,172,41,49,29,190,16,20,48,109,225,42,17,39,164,71,87,42,251,9]},"announce":[],"urlList":[]}}