{"title":"Ed Askew - Ask the Unicorn (1969)","uid":5445968,"size":42110822,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:87bb0962be0c432e3815c430471fe0ec2b937a6d&amp;dn=Ed+Askew+-+Ask+the+Unicorn+%281969%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dlxe75","files":-1,"time":1269015859,"description":"An enigma even by the ultra-obscure standards of ESP-Disk Records, next to nothing is known about outsider folksinger Ed Askew. Although Askew has been recording songs since the late '60s, only one album has ever been released, 1969's Ask the Unicorn. A solo recording, the album features Askew accompanying himself on the ten-stringed lute-like acoustic instrument the tiple.\n\nA Latin instrument Askew discovered as a teenager because his ukulele-playing father owned one, the tiple quickly became a passion for Askew. While studying art at Yale in the mid-'60s, Askew began performing at local poetry readings, and soon incorporated the tiple into his act. Because the tiple is a difficult instrument, with the player having to press down hard on three tightly wound strings at once to get any sound, Askew's early material has a unique and oddly strained vocal quality that comes from the difficulty of singing while playing such a demanding instrument. \n\nAfter graduating from Yale and getting a teaching job in New York, Askew sent a demo tape to Bernard Stollman of the ultra-noncommercial ESP-Disk, possibly the most legendary indie label of the '60s; with his unique but attractive sound, Askew was quickly invited to record an album for the label. Easily one of the most bizarre and wonderful albums ever released by ESP-Disk, Ask the Unicorn is a psychedelic folk masterpiece, like the Holy Modal Rounders jamming with Alexander &quot;Skip&quot; Spence. A second album, Little Eyes, was recorded for ESP-Disk in 1970, but although it got as far as a test pressing, the label was beginning to run out of money and the album was never released. \n\nIn most cases, that would be that, but while pursuing a career as a painter and poet, Askew sporadically kept up his performing career in New Haven and Boston during the '70s. Though he has never released anything commercially since Ask the Unicorn, his homemade tapes are traded on the fringe music underground. His recent music has included harpsichord, synthesizers, and drum machines along with guitar, piano, and his beloved tiple, but other than the more modern instrumentation, Askew's songs remain the same: quirky, but surprisingly accessible, with an engaging melodic sense and emotional, thoughtful lyrics that belie the easy &quot;freaky outsider&quot; tag that might otherwise get stuck upon him.\t\n---\n\nSecond torrent - better quality. Please seed!","torrent":{"xt":"urn:btih:87bb0962be0c432e3815c430471fe0ec2b937a6d","amp;dn":"Ed+Askew+-+Ask+the+Unicorn+%281969%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87bb0962be0c432e3815c430471fe0ec2b937a6d","infoHashBuffer":{"type":"Buffer","data":[135,187,9,98,190,12,67,46,56,21,196,48,71,31,224,236,43,147,122,109]},"announce":[],"urlList":[]}}