{"title":"Welfare Racism: Playing the Race Card Against America's Poor","uid":8793173,"size":1319553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88c7c00d2ad44e4f0ac91853485db6fb469fa4ab&amp;dn=Welfare+Racism%3A+Playing+the+Race+Card+Against+America%27s+Poor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1376004288,"description":"Welfare Racism: Playing the Race Card Against America's Poor\n\nPublication Date: August 11, 2001 | ISBN-10: 0415923417 | ISBN-13: 978-0415923415 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload. | filetype: pdf |\n\n\n\nWelfare Racism analyzes the impact of racism on US welfare policy. Through historical and present-day analysis, the authors show how race-based attitudes, policy making, and administrative policies have long had a negative impact on public assistance programs. The book adds an important and controversial voice to the current welfare debates surrounding the recent legilation that abolished the AFDC.\n\n\n[b] Editorial Reviews [/b]\nFrom Booklist\nKenneth J. Neubeck and coauthor Noel A. Cazenave, both sociology professors, argue that &quot;racism shapes public assistance policies and practices.&quot; They examine the role of racism in the early twentieth century and state that &quot;Mother's Pension&quot; and other welfare programs established the pattern for the New Deal's Aid to Dependent Children program (ultimately, AFDC). Using case studies, they explore manipulation of racial stereotypes in 1960s battles over welfare in both the North and the South. The authors trace the racialized political backlash against welfare from the 1960s to the 1996 abolition of Aid to Families with Dependent Children and then examine this &quot;welfare to work&quot; legislation in terms of its race-control functions. Finally, the authors call for progressives to confront welfare racism and demand that government recognize its responsibility to mitigate the suffering of the poor. Mary Carroll\nCopyright Â© American Library Association. All rights reserved --This text refers to an out of print or unavailable edition of this title.\nReview\nIt is a powerful expose of a deeply-rooted form of racism that hits poor people in general, not just those of color...These engaged scholars clearly tell us all to open our eyes wide. -- Multidiversity\nWelfare Racism shows the ways racist attitudes and administrative policies and practices have long undermined public assistance programs...More than most academic researchers who deal with welfare reform, Neubeck and Cazenave ask a range of critical political and moral questions about the meaning of welfare reform that moves the reader to wonder about who we are as a nation and what policymakers think about women, people of color, the poor, and the near poor...Welfare Racism is a well-documented study that show how welfare policy can be understood in connection with racialized public assistance attitudes, policymaking, and administrative practices that function to maintain white economic advantages over blacks. -- Contemporary Sociology 31, 4\nFew social welfare scholars have provided a fully race-centered perspective on U.S. welfare policy. Neubeck and Cazenave's well-documented and readable study takes a giant step toward filling this unforgivable gap-without ignoring the dynamics of gender and class...The book is a must-read for anyone who wants to understand but also to change U.S. public policy. -- Mimi Abramovitz, author of Under Attack, Fighting Back: Women and Welfare in the United States\nWelfare racism is an important book. It forces the reader to rethink the contemporary history of welfare policy..This is a book that effectively brings to the surface the discriminatory nature of allegedly neutral social policies. And that is not just good scholarship; it is a significant public service. -- Sanford F. Schram, author of After Welfare: The Culture of Postindustrial Social Policy\n[A] bracing and illuminating analysis that should change the way we think about American welfare policy..Neubeck and Cazenave show definitively that the politics of welfare cannot be explained unless we attend to contemporary racism. -- Francis Fox Piven, author of The Breaking of the American Social Compact\nWhites have long believed that most welfare recipients and most poor people are black. Such myths are so stereotyped, irrational, and off the mark that they cry out for deeper structural and cultural analysis-which is provided with great depth and thoroughness in this momentous book. Bravo to this first comprehensive analysis of welfare racism in the United States! -- Joe R. Feagin, Professor of Sociology, University of Florida\n[T]his is an important book which deserves to be widely read and discussed. It certainly succeeds in drawing attention to the on-going role of race in welfare policy. -- Journal of Sociology and Social Welfare\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Welfare-Racism-Playing-Against-Americas/dp/0415923417/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Welfare-Racism-Playing-Against-Americas/dp/0415923417/&lt;/a&gt;\n\n\n\n\nTags: race, racism, discrimination, race card, america, usa, social, policy, racism, welfare queen, reagan, afdc, food, stamps, black, african american, ghettoization, equality, inequality, white, image, american, public, policy, sociology, psychology, identity, politics, race relations, ethnic, minority, social services, ","torrent":{"xt":"urn:btih:88c7c00d2ad44e4f0ac91853485db6fb469fa4ab","amp;dn":"Welfare+Racism%3A+Playing+the+Race+Card+Against+America%27s+Poor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88c7c00d2ad44e4f0ac91853485db6fb469fa4ab","infoHashBuffer":{"type":"Buffer","data":[136,199,192,13,42,212,78,79,10,201,24,83,72,93,182,251,70,159,164,171]},"announce":[],"urlList":[]}}