{"title":"Aromatherapy for Health Professionals - Price mobi epub","uid":10218831,"size":14811438,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:894904537791eb366077a3e4bfcc9637ab6f6bb3&amp;dn=Aromatherapy+for+Health+Professionals+-+Price+mobi+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KiwiSue49","files":2,"time":1400999988,"description":"Please click on KiwiSue49 in blue above to check out my other torrents.\n\n\nNote: The bought book is supported by a CD-ROM of ancillary tables covering essential oils for general use in health-care settings including indications for safe, therapeutic uses of essential oils; those to be used with caution; and essential oil definitions.\n\n\n\n\nDescription:\n\nAromatherapy for Health Professionals covers the full spectrum of theory and practice from essential oil science and the foundations of practice to the application of aromatherapy for specific conditions.\n\nThe fourth edition of this highly successful book provides a clear and authoritative introduction to aromatherapy as practiced in modern health care settings. It gives valuable information for any health professional wishing to develop their understanding of the subject, providing the in-depth knowledge needed to use essential oils in the practice environment. \n\nNEW FOR THIS EDITION\n\n* Two new chapters - Wound Care and Bereavement - provide valuable additions to the text\n* The chapter 'Aromas, Mind and Body' has been enhanced\n* Several new essential oils - giving properties, indications and cautions - have been added \n* New case histories illustrate the practical application of theory and techniques described\n* References have been updated and new research added \n\n\n\nNote: Files have opened fine on my Samsung Note 10.1 using Aldiko for the epub file and Kindle for the mobi file.\nTook a bit for the book to load properly on my Desktop computer.\n","torrent":{"xt":"urn:btih:894904537791eb366077a3e4bfcc9637ab6f6bb3","amp;dn":"Aromatherapy+for+Health+Professionals+-+Price+mobi+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"894904537791eb366077a3e4bfcc9637ab6f6bb3","infoHashBuffer":{"type":"Buffer","data":[137,73,4,83,119,145,235,54,96,119,163,228,191,204,150,55,171,111,107,179]},"announce":[],"urlList":[]}}