{"title":"The Power of The Past - Jessi Streib","uid":13439832,"size":1987177,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a8369ffbc28d591b7d2b78deb4d6d5472c6edd2&amp;dn=The+Power+of+The+Past+-+Jessi+Streib&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1454687825,"description":"In an era in which class divisions are becoming starker than ever, some individuals are choosing to marry across class. The Power of the Past traces the lives of a subset of these individuals - highly-educated adults who married a partner raised in a class different from their own, primarily between those from blue- and white-color backgrounds. Drawing upon detailed interviews with spouses who revealed the inner workings of their marriages, Jessi Streib shows that crossing class lines is not easy, and that even though these couples shared bank accounts, mortgages, children, and friends, each spouse was still shaped by the class of their past, and consequently, so was their marriage.\r\n\r\nStreib reveals what was rarely apparent to the husbands and wives she interviewed. The class of their past did not only matter in determining the amount of money they had as children or what job their parents went off to each morning; It also mattered in more subtle ways, by systematically shaping their ideas of how to go about their daily lives. Upwardly mobile spouses who grew up in blue-collar families learned to take a laissez-faire approach to the world around them: they preferred to go with the flow, make the most of the moment, and avoid self-imposed constraints. Their spouses, who grew up in professional white-collar families, however, wanted to manage the world around them: they organized, planned, monitored, and oversaw. Living with a spouse who was born into a different class means navigating these differences - differences that appeared across nearly every aspect of their lives, from how they manage their finances, to how they manage their time - both at home and on vacation - to ideas about how their children should be raised.\r\n\r\nThe Power of the Past illustrates that when individuals are raised in different classes, merged lives do not lead to merged ideas about how to lead those lives. Individuals can come together across class lines, but their enduring class characteristics cannot be left behind","torrent":{"xt":"urn:btih:8a8369ffbc28d591b7d2b78deb4d6d5472c6edd2","amp;dn":"The+Power+of+The+Past+-+Jessi+Streib","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a8369ffbc28d591b7d2b78deb4d6d5472c6edd2","infoHashBuffer":{"type":"Buffer","data":[138,131,105,255,188,40,213,145,183,210,183,141,235,77,109,84,114,198,237,210]},"announce":[],"urlList":[]}}