{"title":"Dispatches: Repressive Regimes~Undercover in Tibet 2008 03 31","uid":4110415,"size":365282656,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:8b6bf375682a17dc2593075c913e35926dd9b898&amp;dn=Dispatches%3A+Repressive+Regimes%7EUndercover+in+Tibet+2008+03+31+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shunster07","files":1,"time":1207022851,"description":"Dispatches: Repressive Regimes~Undercover in Tibet 2008 03 31 \n\n48 min\n348 mgs\n &lt;a href=&quot;\nhttp://www.channel4.com/news/articles/dispatches/undercover+in+tibet/1824047&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.channel4.com/news/articles/dispatches/undercover+in+tibet/1824047&lt;/a&gt;\n\n\nAs Tibetan protesters take to the streets in the biggest and most bloody challenge to Chinese rule in nearly 20 years, Dispatches reports on the hidden reality of life under Chinese occupation.\n\n\nAs Tibetan protesters take to the streets in the biggest and most bloody challenge to Chinese rule in nearly 20 years, Dispatches reports on the hidden reality of life under Chinese occupation after spending three months undercover, deep inside the region. Dozens are feared dead after the recent clashes and crackdown by Chinese troops, but with reporting so rigidly controlled from the region little is known of living conditions inside Tibet.\n\nTo make this film, Tibetan exile Tash Despa returns to the homeland he risked his life to escape 11 years ago, to carry out secret filming with award-winning, Bafta-nominated director Jezza Neumann (Dispatches Special: China&amp;#039;s Stolen Children). Risking imprisonment and deportation, he uncovers evidence of the &quot;cultural genocide&quot; described by the Dalai Lama.\n\nHe finds the nomadic way of life being forcefully wiped out as native Tibetans are stripped of their land and livestock and are being resettled in concrete camps. Tibet reveals the regime of terror which dominates daily life and makes freedom of expression impossible. Tash meets victims of arbitrary arrests, detention, torture and &quot;disappearances&quot; and uncovers evidence of enforced sterilizations on ethnic Tibetan women.\n\nHe sees for himself the impact of the enormous military and police presence in the region, and the hunger and hardship being endured by many Tibetans, and hears warnings of the uprising taking place across the provinces now.\n\nRetrack : shunster\nThebox.bz\n","torrent":{"xt":"urn:btih:8b6bf375682a17dc2593075c913e35926dd9b898","amp;dn":"Dispatches%3A+Repressive+Regimes%7EUndercover+in+Tibet+2008+03+31+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b6bf375682a17dc2593075c913e35926dd9b898","infoHashBuffer":{"type":"Buffer","data":[139,107,243,117,104,42,23,220,37,147,7,92,145,62,53,146,109,217,184,152]},"announce":[],"urlList":[]}}