{"title":"Scott Sigler - Contagious","uid":5390928,"size":859672291,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8b9b14bb341372f3ae703768f164a8dc6f2ab8a0&amp;dn=Scott+Sigler+-+Contagious&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"g-roid","files":-1,"time":1267057399,"description":"SCOTT SIGLER\nContagious\nRead by the Author\n\nAcross America, a mysterious pathogen transforms ordinary people into raging killers--psychopaths driven by a terrifying, alien agenda. The human race fights back, yet after every battle the disease responds, adapts, using sophisticated strategies and brilliant ruses to fool its pursuers. The only possible explanation: the epidemic is driven not by evolution but by some malevolent intelligence.\n\nStanding against this unimaginable threat is a small group, assembled under the strictest secrecy. Their best weapon is hulking former football star Perry Dawsey, who possesses an unexplainable ability to locate the disease's hosts. Hardened CIA veteran Dew Phillips must somehow forge a connection with him to stand a chance against this maddeningly adaptable opponent. Alongside them is Margaret Montoya, a brilliant epidemiologist who fights for a cure even as she reels under the weight of endless horrors.\n \nThese three and their team have kept humanity in the game, but that's not good enough anymore, not when the disease turns contagious, triggering a fast countdown to Armageddon. \n\nSCOTT SIGLER's fiction podcasts have drawn a huge and devoted following. His serialized stories have held the number one position in all the podcast indexes, including iTunes. Scott's first hardcover release, &quot;Infected&quot;, was translated into a dozen languages and is being adapted for film by Random House Films/Rogue Pictures. Scott lives in San Francisco with his wife and their dog.\n\n15 Hours from 12 CDs at 128 kbps in MP3 format. \n","torrent":{"xt":"urn:btih:8b9b14bb341372f3ae703768f164a8dc6f2ab8a0","amp;dn":"Scott+Sigler+-+Contagious","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b9b14bb341372f3ae703768f164a8dc6f2ab8a0","infoHashBuffer":{"type":"Buffer","data":[139,155,20,187,52,19,114,243,174,112,55,104,241,100,168,220,111,42,184,160]},"announce":[],"urlList":[]}}