{"title":"Treehouse.Masters.S01E06.Backyard.Bungalow.WebRip.x264.Archer.mp","uid":8654675,"size":495434384,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8bd87fa02986d37a7e2124cb5e4303969eedead7&amp;dn=Treehouse.Masters.S01E06.Backyard.Bungalow.WebRip.x264.Archer.mp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"northwind_highlander","files":1,"time":1373188028,"description":"Beginning May 31, TREEHOUSE MASTERS has viewers climbing to a majestic world up in the treetops with visionary and tree whisperer Pete Nelson as he designs private escapes for those with a passion to reconnect with nature and awaken their inner child. Designing multi-bedroom dream tree houses complete with functional plumbing and electricity to simple, one-room lofts, Pete goes out on a limb to create breathtaking realities for a host of clientele. However, creating these fantasy arboreal homes doesn't come easy. Pete and his team of designers and carpenters, including son Charlie, must endure Mother Nature's shifty antics, dangerous construction equipment and dizzy heights in order to build these sanctuaries. In addition to building these hideaways, Pete, along with his wife, Judy, and daughter, Emily, own and operate TreeHouse Point, a bed and breakfast in Washington, to where people can escape their modern-day realities. In TREEHOUSE MASTERS, Pete brings people closer to nature one tree at a time \n\nspecial notes:\n\nno more of that mislabeled, slow ass shit from bad pirate. this is on a seedbox with a 100MB connection so people should not have to waite hours on something to download. I normally don't upload to tpb but if people want it, ill provide it, and since nobody else has been uploading to tpb with a respectable speed, here you go.","torrent":{"xt":"urn:btih:8bd87fa02986d37a7e2124cb5e4303969eedead7","amp;dn":"Treehouse.Masters.S01E06.Backyard.Bungalow.WebRip.x264.Archer.mp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bd87fa02986d37a7e2124cb5e4303969eedead7","infoHashBuffer":{"type":"Buffer","data":[139,216,127,160,41,134,211,122,126,33,36,203,94,67,3,150,158,237,234,215]},"announce":[],"urlList":[]}}