{"title":"Bitwig Studio v1.3.5 OS X[dada]","uid":13033300,"size":212211423,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:8ca035dc9261a387e284949602e7ef9eb340a09a&amp;dn=Bitwig+Studio+v1.3.5+OS+X%5Bdada%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"future-dada","files":3,"time":1450456091,"description":"Bitwig Studio v1.3.5 OS X[dada]\r\n212.7 MB\r\n------------------------------------------------------------------------------------- \nhttp://www.bitwig.com/en/bitwig-studio.html\r\n-------------------------------------------------------------------------------------\r\nBitwig Studio is a dynamic software solution for music creation and performance to realize all of your musical ideas in every stage of production. From sound design to music creation, discover the new standard in customized workflow. Bitwig Studio inspires you to take greater control of your productions, giving you access to every aspect of your workflow as needed. Streamline your creative process and quickly take your music from ideas to complete songs, tracks and compositions. With Bitwig Studio, you’re in command of a workflow that works best for you.\r\nChanges in Bitwig Studio 1.3.5\r\n\r\nReleased on 03.12.2015.\r\n\r\nFIXED- Dragging clip end in track note editor enables looping instead of just extending the clip end.\r\nFIXED- Icon that indicates launch quantization on clip loop bar is invisible when loop region is not selected in an unlooped clip.\r\nFIXED- If you have only one empty project (tab) open, save the project and immediately create a new project, the previous one will close.\r\nFIXED- Dragging a track from the browser that contained a VST into empty project after fresh startup would not load the plugin due to missing plugin state.\r\nFIXED- Controller API: device.addPresetCategoriesObserver/addPresetCreatorsObserver are not updated correctly.\r\nFIXED- Engine crash when switching documents.\r\nFIXED- VST window size is wrong in Melodyne 4 beta version on OSX.\r\nFIXED- Dragging notes from multiple clips in arranger with copy modifier will copy some notes and move others when dropping onto an existing clip.\r\nFIXED- Volume, pan and CC automation should follow clips when dragging to other tracks if follow clips is active (currently only does so if device chain is identical).\r\nFIXED- 32bit plugins with carbon windows don't open their window on OSX 10.11.\r\nFIXED- Removing stop button from clip slot should also remove record button.\r\nFIXED- Named device cursors should be updated to an existing device if possible when deleting a device.\r\nFIXED- Regression in 1.3.4: mouse cursor sometimes disappears on OSX.\r\nFIXED- Arpeggiator plays a full note when the gate is at 0%.\r\nFIXED- Crash when changing velocities using pencil tool in audio event area of hybrid track.\r\nFIXED- When saving a project and changing the list of tracks/track groups in that project the browser would not update with the new list of tracks.\r\nFIXED- Mouse cursors don't look sharp on OSX computers with Retina screen.\r\nFIXED- If Preroll is active, clip launcher clips already record during the preroll time.\r\nFIXED- Loop marker for clips on the arranger are not shown in the correct place and moves when zooming in and out.\r\nFIXED- Searching for letters and numbers (e.g. &quot;7A&quot;) in files would not find files that have that in their name.\r\nFIXED- Dragging a track out of a deactivated group hangs the engine.\r\nFIXED- Track header width might be different from state before saving after opening project.\r\nFIXED- Next actions on clip launcher don't work in some cases.\r\nFIXED- Transpose expression zoom-scrollbar does not line up with timeline content by default in audio editor.\r\nFIXED- Folded lanes in note editor do not line up with the headers in tablet display profile.\r\nFIXED- Synced LFOs are not perfectly synced.\r\nFIXED- Bug in OSX 10.11 LauchServices causes Bitwig Studio to start only once (added workaround).\r\nIMPROVED - Fold state for drum machine clips shows note name in front of the pad name.\r\nIMPROVED - Raised silence threshold used by auto-suspend of plug-ins, as it was below the background noise of several popular plug-in effects.\r\nIMPROVED - Add action to toggle the showing and hiding of all automation lanes on the arranger and shift clicking automation icon in track header changes for all tracks in its group track.\r\n-------------------------------------------------------------------------------------\r\nDo not make money with this software...\r\n\r\nRemember to BUY the stuff if you USE it.\r\n-------------------------------------------------------------------------------------\r\nfuture-dada\r\n-------------------------------------------------------------------------------------\r\ndemonoid.pw\r\n1337x.to\r\nthepiratebay.se\r\nflashtorrents.org\r\nbtscene.cc\r\ntorrent-core.org\r\n-------------------------------------------------------------------------------------\r\nMMXV (12)","torrent":{"xt":"urn:btih:8ca035dc9261a387e284949602e7ef9eb340a09a","amp;dn":"Bitwig+Studio+v1.3.5+OS+X%5Bdada%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ca035dc9261a387e284949602e7ef9eb340a09a","infoHashBuffer":{"type":"Buffer","data":[140,160,53,220,146,97,163,135,226,132,148,150,2,231,239,158,179,64,160,154]},"announce":[],"urlList":[]}}