{"title":"MonstersOfCock - Elsa Jean (Elisa Fucks a Crook) NEW 07 June 201","uid":14825558,"size":254821011,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:8cc1d445faa263bca8ecd65d24d49bd9ab389a70&amp;dn=MonstersOfCock+-+Elsa+Jean+%28Elisa+Fucks+a+Crook%29+NEW+07+June+201&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1465295168,"description":"Elisa Jean is all alone at home. She plays with her pretty pink pussy on the couch dreaming of big cocks. Unknowingly, there is a stranger roaming outside her house trying to find a way in. Still in the mists of an epic rubdown she hears a strange noise, she arms herself with a baseball bat, the first weapon she can find. The stranger is in the house, she hides as best as she can, still armed, knowing she must defend herself. She sees the stranger rummaging thru some of the houses valuables. Its time for her to act, she raises the wooden slugger and confronts the stranger. Almost instantly she recognizes him, its Ricky, who works for her dad. After some excuses and a sob story , Elisa decides to frisk Ricky for stolen goods. But was she finds steals her heart, its a giant cock in Rickyâ™s pants. She canâ™t believe the size of his man meat. She must examine his unit. Once she realizes his hog makes most penises look like vienna sausages, she knows she needs to put it in her mouth. She continues the fun by riding his monster dong and getting plowed by it. She takes command and makes Ricky cum in her mouth and she returns the favor by swallowing the load. Her final act is promising toot tell her deal old dad about the sexcapade.\r\nTags:18+ Teen, Big Dick, Blonde, Blowjob, Cumshot, Handjob, Hardcore, Petite, Swallow\r\n \nhttp://imgdone.com/viewer.php?file=13975563435611599423.jpg\r\n \nhttp://imgdone.com/viewer.php?file=11236060566450614691.jpg","torrent":{"xt":"urn:btih:8cc1d445faa263bca8ecd65d24d49bd9ab389a70","amp;dn":"MonstersOfCock+-+Elsa+Jean+%28Elisa+Fucks+a+Crook%29+NEW+07+June+201","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cc1d445faa263bca8ecd65d24d49bd9ab389a70","infoHashBuffer":{"type":"Buffer","data":[140,193,212,69,250,162,99,188,168,236,214,93,36,212,155,217,171,56,154,112]},"announce":[],"urlList":[]}}