{"title":"Wild West February 2016","uid":13275474,"size":36915668,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ce97cfa4dd99358404ec877f485e09d44a35bdd&amp;dn=Wild+West+February+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Orangie2Dope","files":1,"time":1453432822,"description":"English | 84 pages | PDF | 35.2 MB\r\n\r\n\r\nWild West magazine brings the past to life in a rich and vibrant way. The bimonthly magazine covers the events and occurrences that led to the taming of the Great American frontier. History buffs will enjoy the detailed, in-depth stories and period photographs.\r\n\r\nEach new issue of Wild West magazine recounts the legend, lore and facts behind events that defined America's past. From articles about Native American tribes to the history of food on the Great Plains, every edition is packed with accurate information about the Wild West's storied past. Readers will learn about famous famines, battles, massacres, and expeditions in each new issue. Whether you're interested in learning about pioneers, famous explorers or Native American leaders, you'll enjoy each new issue of Wild West magazine. Regular features include interviews with respected historians, book reviews and movie guides. Every edition also contains rare historical photos.\r\n\r\nWild West magazine brings America's rich heritage to life in a bold and exciting way. Each new issue is brimming with never-before-seen photos, engaging stories, and informative timelines. History buffs will look forward to each new issue of Wild West magazine!","torrent":{"xt":"urn:btih:8ce97cfa4dd99358404ec877f485e09d44a35bdd","amp;dn":"Wild+West+February+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ce97cfa4dd99358404ec877f485e09d44a35bdd","infoHashBuffer":{"type":"Buffer","data":[140,233,124,250,77,217,147,88,64,78,200,119,244,133,224,157,68,163,91,221]},"announce":[],"urlList":[]}}