{"title":"Monarchy - The Royal Family at Work [2007] BBC","uid":8795992,"size":3094160598,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8cfefcc00285501321929cb86ced57f374ec7270&amp;dn=Monarchy+-+The+Royal+Family+at+Work+%5B2007%5D+BBC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1376079799,"description":"Monarchy - The Royal Family at Work Typical Episode\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 715 MiB\nDuration                                 : 1h 25mn\nNominal bit rate                         : 1 000 Kbps\nWidth                                    : 720 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 16:9\nFrame rate mode                          : Variable\nScan type                                : Progressive\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://www.pbs.org/opb/monarchy/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/opb/monarchy/&lt;/a&gt;\n &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Monarchy:_The_Royal_Family_at_Work&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Monarchy:_The_Royal_Family_at_Work&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1148714/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1148714/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://image.bayimg.com/53a7df9e2fedde500380422f2dbb8d74546870f7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/53a7df9e2fedde500380422f2dbb8d74546870f7.jpg&lt;/a&gt;\n\nMonarchy: The Royal Family at Work (also known as A Year with the Queen) is a fly on the wall documentary TV series made by the BBC and RDF Media which follows the British Royal Family over the course of a year. The promotion for the documentary caused a controversy in 2007 when the BBC showed a group of journalists a trailer of the series including some shots that were edited in non-chronological order making it erroneously appear that HM The Queen had stormed out of a photo shoot with Annie Leibovitz after being asked to remove her 'crown'. On 11 July 2007, the controller of BBC One, Peter Fincham, told journalists at the BBC1 new season launch that the trailer showed the Queen &quot;losing it a bit and walking out in a huff&quot;. However, the clip which appeared to show the Queen abruptly leaving in an agitated mood was actually of her entering the shoot. The next day, the BBC issued a statement which pointed out the error and formally apologised to the Queen. Both Fincham and the Chief Creative Officer of RDF Media, Stephen Lambert, resigned as a result of the controversy.\n\n01 - The State Visit\nThe Queen prepares for a state visit to the United States, marking the 400th anniversary of the founding of the Jamestown Settlement in Virginia. Before leaving for the US, the Queen has a photo session with Annie Leibovitz and holds a reception at Buckingham Palace for prominent American expatriates. In Washington, DC, the White House and the British Embassy are also getting ready for the visit, with President George W. Bush preparing to host a white-tie banquet, which would turn out to be the only one of his presidency.\n\n02 - Headquarters\nA state banquet is held at Buckingham Palace for the President of Ghana, John Kufuor. The Queen takes part in her annual birthday parade and an investiture ceremony where Steven Gerrard and Penelope Keith are among those to receive an honour. The episode also looks at the day-to-day workings of the Monarchy's headquarters, Buckingham Palace, including an interview with the Queen's ladies-in-waiting as they sort through the royal postbag.\n\n03 - Head of State\nJust a few weeks before he resigns, Prime Minister Tony Blair and his wife Cherie spend the weekend with the Royal Family at Balmoral Castle in Scotland. Back in London, the Chancellor of the Exchequer (and future Prime Minister), Gordon Brown, briefs the Queen in advance of his budget speech. The palace prepares for the State Opening of Parliament, as the Royal coachmen repair and clean their 100-year-old uniforms and the crown jewels are taken from the Tower of London to the palace. In Estonia, British Ambassador Nigel Haywood is getting ready for the Queen's first ever tour of the Baltic states.\n\n04 - The Queen and Us\nThe Queen presides over the annual Royal Garden Party, for which every invitation is written by hand and checked by the 'Garden Party Ladies'. One of the guests at the Garden Party is Pearl Mitchell from Northern Ireland, who nervously prepares to meet the Queen. Following the Garden Party, the Queen visits a Hindu Temple and has a feast of Kashmiri delicacies. In Northumberland, The Prince of Wales and The Duchess of Cornwall have tea with an organic farming family. Meanwhile, The Duke of Edinburgh travels to the official opening of the Emirates Stadium, but not all goes to plan.\n\n05 - Inside the Firm\nThe Prince of Wales, The Princess Royal, The Duke of York and The Earl of Wessex talk about their work as part of the Royal Family. Prince William makes coffee and breakfast for residents at an London inner-city hostel and Prince Harry attends a strategy meeting for Sentebale. At the palace, the Keeper of the Privy Purse, Sir Alan Reid, releases details of the Royal Family's annual expenses to the press. At the Royal Military Academy Sandhurst, the Queen and other members of the Royal Family attend Prince William's passing out parade.\n\n06 - Bonus DVD Material: The Royal Timekeeper","torrent":{"xt":"urn:btih:8cfefcc00285501321929cb86ced57f374ec7270","amp;dn":"Monarchy+-+The+Royal+Family+at+Work+%5B2007%5D+BBC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cfefcc00285501321929cb86ced57f374ec7270","infoHashBuffer":{"type":"Buffer","data":[140,254,252,192,2,133,80,19,33,146,156,184,108,237,87,243,116,236,114,112]},"announce":[],"urlList":[]}}