{"title":"Cone Beam Computed Tomography (Imaging in Medical Diagnosis and","uid":11626575,"size":54475690,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dd4410d4135a1c78122a4ce6b70376a6cc75aaa&amp;dn=Cone+Beam+Computed+Tomography+%28Imaging+in+Medical+Diagnosis+and+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Morinew","files":1,"time":1417628238,"description":"Conventional computed tomography (CT) techniques employ a narrow array of x-ray detectors and a fan-shaped x-ray beam to rotate around the patient to produce images of thin sections of the patient. Large sections of the body are covered by moving the patient into the rotating x-ray detector and x-ray source gantry. Cone beam CT is an alternative technique using a large area detector and cone-shaped x-ray beam to produce 3D images of a thick section of the body with one full angle (360 degree or 180 degree plus detector coverage) rotation. It finds applications in situations where bulky, conventional CT systems would interfere with clinical procedures or cannot be integrated with the primary treatments or imaging systems.\n\nCone Beam Computed Tomography explores the past, present, and future state of medical x-ray imaging while explaining how cone beam CT, with its superior spatial resolution and compact configuration, is used in clinical applications and animal research. The book:\n\n- Supplies a detailed introduction to cone beam CT, covering basic principles and applications as well as advanced techniques\n- Explores state-of-the-art research and future developments while examining the fundamental limitations of the technology\n- Addresses issues related to implementation and system characteristics, including image quality, artifacts, radiation dose, and perception\n- Reviews the historical development of medical x-ray imaging, from conventional CT techniques to volumetric 3D imaging\n- Discusses the major components of cone beam CT: image acquisition, reconstruction, processing, and display\n\nA reference work for scientists, engineers, students, and imaging professionals, Cone Beam Computed Tomography provides a solid understanding of the theory and implementation of this revolutionary technology","torrent":{"xt":"urn:btih:8dd4410d4135a1c78122a4ce6b70376a6cc75aaa","amp;dn":"Cone+Beam+Computed+Tomography+%28Imaging+in+Medical+Diagnosis+and+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dd4410d4135a1c78122a4ce6b70376a6cc75aaa","infoHashBuffer":{"type":"Buffer","data":[141,212,65,13,65,53,161,199,129,34,164,206,107,112,55,106,108,199,90,170]},"announce":[],"urlList":[]}}