{"title":"The Fugitive S02E02 F.A.R.T. 1964 Version Worlds End with Barry","uid":4473173,"size":566334192,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8e7baf7e011a655bdadc1ffe88e9fabd3b3d0896&amp;dn=The+Fugitive+S02E02+F.A.R.T.+1964+Version+Worlds+End+with+Barry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Raktajino","files":-1,"time":1225219760,"description":"From the Fugitive Audio Restoration Team (F.A.R.T.) comes this excellent quality video with the original soundtrack restored! As you probably know, the DVD's of season two of The Fugitive were released with a completely new, synthesized music score which destroyed much of the show's drama. Now, thanks to the Fugitive Audio Restoration Team, you can enjoy the show in top quality as it was originally intended to be experienced.\n\nAlso included in this torrent is the introduction of this episode by none other than Barry Morse, who played Lt. Philip Gerard for four seasons of The Fugitive.\n\nThe Fugitive Season 2 (1964)\nS02E02 World's End\nFirst aired: 9/22/1964\n\nKimble answers a classified ad from Ellie Burnett, the daughter of his former defense attorney. They arrange to meet in Kansas City to discuss the information she received about a one-armed man from a private detective hired by her father. Gerard sees the ad and knows who wrote it because he and Ellie's father were close friends and that Ellie may be in love with Kimble. While Gerard has Ellie investigated, she and Kimble find out that the one-armed man was killed in a fire only a week before. Kimble is devastated, but vows to confirm it. A little later, Ellie's private detective informs her that the one-armed man who died in a fire was actually in prison at the time of Helen Kimble's murder. But Ellie withholds this news from Kimble and convinces him that they should leave the country, realizing that this may be her only chance at a life with him. Suzanne Pleshette, Dabney Coleman guest star.\n\nCast: David Janssen as Dr. Richard Kimble, Barry Morse as Lt. Philip Gerard, Bill Raisch as Fred Johnson (The One-Armed Man), Diane Brewster (flashbacks) as Helen Kimble, J.D.Cannon as Lloyd Chandler, William Conrad as Narrator (voice)\n\nGuest cast: Suzanne Pleshette (Ellie Burnett), Paul Birch (Captain Carpenter) , Sallie Brophy (Mrs. Newlin), Jess Kirkpatrick (Mortician), Robert Gibbons (Inn Manager), Peter Brocco (Hotel Clerk), Woodrow Parfrey (Farmer Newlin), Henry Beckman (Keller), Dabney Coleman (Sgt. Keith), Carmen Matthews (Ada Burnett) \n(synopsis by jeans2nd)\n\nRunning Time:  0:51:34\nIndex Chunk:  Yes\nInterleaved:  Yes\nMax Bytes Per Sec:  0\nAUDIO: 0 - MP3 (0x55)\n     Average Bitrate Per Sec:  160 kb/s\n     Samples Rate:  48000 Hz\n     Channels:  2\n     Bits Per Sample:  0\n     SuggestedBufferSize:  10080\n     Sample Size:  480\n     Variable Bitrate:  No\nVIDEO:  DX50\n     B-VOP: Yes\n     S(GMC)-VOP: No\n     QuarterPixel: No\n     Frame Size:  512 x 384\n     Frames Rate:  23.976\n     Color Depth:  24\n     Total Frames:  74195\n     SuggestedBufferSize:  69549\n\nLeave a comment if you want to see more!","torrent":{"xt":"urn:btih:8e7baf7e011a655bdadc1ffe88e9fabd3b3d0896","amp;dn":"The+Fugitive+S02E02+F.A.R.T.+1964+Version+Worlds+End+with+Barry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e7baf7e011a655bdadc1ffe88e9fabd3b3d0896","infoHashBuffer":{"type":"Buffer","data":[142,123,175,126,1,26,101,91,218,220,31,254,136,233,250,189,59,61,8,150]},"announce":[],"urlList":[]}}