{"title":"Madonna - Papa Don't Preach  (2nafish)","uid":5706327,"size":188055556,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8f97b6a1b3f5f8ed0f79329cb427c0cee2d9ce61&amp;dn=Madonna+-+Papa+Don%5C%27t+Preach++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1279700472,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Papa Don't Preach&quot; is a dance-pop  song by American singer and songwriter Madonna. The song was written by Brian Elliot with additional lyrics by Madonna, and produced by Stephen Bray and Madonna for her third studio album True Blue, released in June 1986. The song also appears remixed  on the 1990 compilation album The Immaculate Collection and in its original form on the 2009 compilation album Celebration. The song's musical style combines pop and classical rhythms, and its lyrics deal with teenage pregnancy and abortion. The music video, directed by James Foley, shows Madonna's second image makeover, featuring her with a more toned and muscular body, and cropped platinum blonde hair.\n\nReleased as the album's second single in mid-1986, the song was a commercial success. It became Madonna's fourth number-one single on the Billboard Hot 100, and performed well internationally, reaching the top position in Australia and the United Kingdom. It was well-received by music critics and was frequently cited as a highlight in the album.\n\nShortly after its release, the song caused heated discussions about its lyrical content. Women's organizations and others in the family planning field criticized Madonna for encouraging teenage pregnancy, while groups opposed to abortion saw it as a positive pro-life message. The song also caused her first conflict with the Vatican, as she dedicated the song to Pope John Paul II, who urged Italian fans to boycott her concerts during the Who's That Girl World Tour in 1987.\n\nFor the music video Madonna sported a complete image makeover. She changed the heavy jewelry and make-up, and adopted the gamine look, which is notably applied to describe the style and appearance that Shirley MacLaine and Audrey Hepburn used during the 1950s. In the video Madonna played a tomboy, dressed in jeans, a black leather jacket, and a slogan T-shirt with the caption &quot;Italians do it Better&quot;. The video alternated between tomboy shots and those of a sexier Madonna with a more toned and muscular body, cropped platinum blonde hair, and figure-revealing clothing, consisting of a 1960s-style black bustier top and capri pants. It was directed by James Foley, produced by David Naylor and Sharon Oreck, and Michael Ballhaus was in charge of the photography.\n\nIt starts with shots of the New York skyline, the Staten Island Ferry, and character close-ups. Madonna plays a teenager, who is seen walking along a lane. Then it shows her thinking about her father, played by Danny Aiello, and how much he loves her. She then sees her boyfriend, played by actor Alex McArthur, coming along. The images are juxtaposed with shots of Madonna dancing and singing in a small, darkened studio. Madonna then moves away from her friends, who warn her from her boyfriend. She and her boyfriend spend a romantic evening together on a barge where they reflect upon their lives after watching an elderly couple. Then Madonna finds out that she is pregnant and after much hesitation tells her father. They have a few days of tension between them. Her father eventually accepts the pregnancy, and the final scene is a reconciliatory embrace between father and daughter.\n\nAt the 1987 MTV Video Music Awards, the &quot;Papa Don't Preach&quot; video won the Best Female Video award, and was nominated for Best Cinematography and Best Overall Performance.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8f97b6a1b3f5f8ed0f79329cb427c0cee2d9ce61","amp;dn":"Madonna+-+Papa+Don%5C%27t+Preach++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f97b6a1b3f5f8ed0f79329cb427c0cee2d9ce61","infoHashBuffer":{"type":"Buffer","data":[143,151,182,161,179,245,248,237,15,121,50,156,180,39,192,206,226,217,206,97]},"announce":[],"urlList":[]}}