{"title":"New Barbarians (US) (1990)","uid":13997650,"size":362431917,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8fa73ae42267be4b7d476bda2ed5a495670c6929&amp;dn=New+Barbarians+%28US%29+%281990%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":1,"time":1458755348,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=4282464697\r\n \nhttp://imagedisco.net/?g=2953696037\r\n\r\n\r\n\r\nDescription:\r\n\r\nA glowing crystal that causes sexual arousement as well as time travel is the centerpiece of this sexual sword-and-sorcery epic from award winning director Henri Pachard. Gorgeous Victoria Paris stars as the buxom amazon whose quest for the stolen crystal takes her from one sexual tryst to another-and eventually into another century! Don't miss the first half of the most important adult feature of the 1990s!\r\n\r\n\r\n\r\nA line-up of big name stars, an incredible array of erotic moments, great sets and an interesting storyline combine to make the New Barbarians, Pt. 1 a hot and interesting sexvid. The plot centers around a small prehistoric band of people which have been robbed of a magical crystal by a warring tribe. It is now the job of Victoria Paris to retrieve the stone, but this sounds easier than it is. The crystal has the ability to send people through time and soon Victoria and her helpmate Randy West find themselves traveling between their own era and modern day California.  The acting is excellent throughout, and most of the sex does sizzle, as the performers let loose with an abandon rarely seen. The &quot;drainer bitches,&quot; which every man had better beware of unless he wants the life sucked out of him, is a fascinating sexual turn.  Highlight sex scenes include those with Joey Silvera/Nina Hartley and the lesbo encounter between Sabrina and Victoria Paris. This extremely well-made, luscious sexvid has &quot;hit&quot; written all over it","torrent":{"xt":"urn:btih:8fa73ae42267be4b7d476bda2ed5a495670c6929","amp;dn":"New+Barbarians+%28US%29+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fa73ae42267be4b7d476bda2ed5a495670c6929","infoHashBuffer":{"type":"Buffer","data":[143,167,58,228,34,103,190,75,125,71,107,218,46,213,164,149,103,12,105,41]},"announce":[],"urlList":[]}}