{"title":"Connections - Series 1","uid":4372053,"size":7343329096,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:903ac6a79e3365428952c46134b342c3e5d453be&amp;dn=Connections+-+Series+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darkdata","files":13,"time":1220215288,"description":"Discuss This:  &lt;a href=&quot;\nhttp://darkdata.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://darkdata.net/&lt;/a&gt;\n&quot;Knowledge is power&quot; More information at http://DarkData.net\n\nEpisode 1:The Trigger Effect\n\nBoth the beginning and the end of the story are here. The end is our present dependence on complex technological networks illustrated by the NYC power blackouts. Life came almost to a standstill: support systems taken for granted failed. How did we become so helpless? Technology originated with the plow and agriculture. Each invention demands its own follow-up: once started, it is hard to stop. This segment ends in Kuwait, where society has leapt from ancient Egypt to the technology of today in 30 years.\n\nEpisode 2: Death in the Morning\n\nHow did a test of gold&amp;#039;s purity revolutionize the world 2500 years ago and lead to the atomic bomb? Standardizing precious metal in coins stimulated trade from Greece to Persia, causing the construction of a huge commercial center and library at Alexandria. This wealth of nautical knowledge aided navigators 14 centuries later. Mariners discovered that the compass&amp;#039;s magnetized needle did not point directly north. Investigations into the nature of magnetism led to the discovery of electricity, radar and to the atomic bomb.\n\nEpisode 3: Distant Voices\n\nTelecommunications exist because the Normans wore stirrups at the Battle of Hastings- a simple advance that caused a revolution in the increasingly expensive science of warfare. Europe turned its attention to making money to wage wars. As mine shafts were dug deeper, they became flooded, stimulating scientists like Galileo to investigate vacuums, air pressure and other natural laws to mine deeper silver. This led to the discovery of electricity and magnetism&amp;#039;s relationship and to the development of radio, and deep space telecommunications that may enable contact with galactic civilizations.\n\nEpisode 4: Faith in Numbers\n\nEach development in the organization of systems (political, economic, mechanical, electronic)influences the next, by logic, by genius, by chance, or by utterly unforeseen events. The transition from the Middle ages to the Renaissance was influenced by the rise of commercialism, a sudden change in climate, famine and the Black Death, which set the stage for the invention of the printing press.\n\nEpisode 5:The Wheel of Fortune\n\nThe power to see into the future with computers originally rested with priest-astronomers who knew the proper times to plant and harvest. The constellations influenced life spectacularly, particularly when the ailing Caliph of Baghad was cured by an astrologer using Greek lore. His ancient medical secrets were translated and spread throughout Europe, ushering in an era of scientific inquiry. The need for more precise measuring devices in navigation gave rise to the pendulum clock, the telescope, forged steel and interchangeable machine parts-the basis of modern industrial system.\n\nEpisode 6:Thunder in the Skies\n\nA dramatically colder climate gripped Europe during the 13th century profoundly affecting the course of history for the next seven centuries. The changes in energy usage transformed architecture and forced the creation of new power sources. The coming of the Industrial Revolution, spurred on by advances in the steam engine, scarred England indelibly: but a moment in history later, gasoline-powered engines opened the way to the heavens.\n\nEpisode 7:The Long Chain\n\nOften, materials discovered by accident alter the course of the world. In the 1600s Dutch commercial freighters controlled Atlantic trade routes. Competing British lines induced America to produce pitch to protect hulls of their royal vessels. This arrangement lasted until 1776, after which a Scottish inventor tried to produce pitch from coal tar. By the time he succeeded the navy was using copper instead. Subsequent experiments with coal tar yielded gaslight lamps, waterproofed garments, a brilliant mauve dye that established the German chemical industry and nylon, the first of the miracle plastics.\n\nEpisode 8:Eat, Drink and Be Merry\n\nWhen Napoleon marched huge forces across Europe, he needed an efficient way to store provisions. A Frenchman preserved sterilized food in empty champagne bottles, an idea modified by the British, who tried tin cans. Still, canned foods sometimes spoiled, which led to experiments with refrigeration. Later, it was discovered that gases may be stored at very low temperatures in a thermos flask, a device handy for picnics, for polar explorers and for, storing large quantities of liquid oxygen and hydrogen. When lit by a spark these gases can send rockets into space.\n\nEpisode 9:Countdown\n\nWhat happens when you combine a carbon arc light, a billiard ball coating, a spoked wheel and consecutive images? Motion pictures! Complex and sometimes incredible events led to Thomas Edison&amp;#039;s remarkable invention; the beginnings of limelight on a Irish mountain; George Eastman&amp;#039;s production of celluloid from the slightly explosive gun cotton; the &quot;magic lantern&quot; of an Austrian ballistics teacher. Then Eadweard Muybridge settled a bet in 1872 by photographs; does a horse raise all four feet when galloping? (Yes.) Today moving pictures, together with television, are enormously powerful mass media. Have we become trapped by our own technology?\n\nEpisode 10:Yesterday, Tomorrow and You\n\n&quot;Why did we do it this way?&quot; Essential moments from the previous programs are reviewed to illustrate the common factors that make for change. Will they go on operating to affect our futures? And if so, can we recognize them? The second half looks at the extent to which we have become increasingly incapable of understanding how change occurs in our complex world and at why we are in such a predicament. Finally, there is a look ahead to the need for radical change in the availability and use of information in the future, if we are to remain in control of our destinies.","torrent":{"xt":"urn:btih:903ac6a79e3365428952c46134b342c3e5d453be","amp;dn":"Connections+-+Series+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"903ac6a79e3365428952c46134b342c3e5d453be","infoHashBuffer":{"type":"Buffer","data":[144,58,198,167,158,51,101,66,137,82,196,97,52,179,66,195,229,212,83,190]},"announce":[],"urlList":[]}}