{"title":"Karrin Allyson - (Ballads) Remembering Coltrane [Vinyl-180g]","uid":6034774,"size":1478040495,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:906c7a972533607a97436db426a57e77a578e1d1&amp;dn=Karrin+Allyson+-+%28Ballads%29+Remembering+Coltrane+%5BVinyl-180g%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"insinuendo","files":15,"time":1292195880,"description":"Check out the equipment ;)\n\n\nMeant to complement:  &lt;a href=&quot; http://thepiratebay.se/torrent/6034762/John_Coltrane_-_Ballads_%281962%29_%5BVinyl-180g%5D-aksman&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/6034762/John_Coltrane_-_Ballads_%281962%29_%5BVinyl-180g%5D-aksman&lt;/a&gt;\n\n\nArtist(s): \tKarrin Allyson\nAlbum:  \tRemembering John Coltrane\nLabel:  \tPure Audiophile Records\nLabel Info:  \tPA-001(2)\nMedia Info: \tDoLP - 180g - Limited Ed. Nr. 0648 - Pressed On Clear Blue HQ-180g Virgin Vinyl\nMastered: \tHalf-Speed Mastered\nThanks to: \tdimsal\nKind:   \tVinyl 24-Bit/96kHz\nSound:  \tStereo\nGenre:  \tJazz\nYear:   \t2001\nArtwork: \tNo\nFileformat: \t.flac\n\nIn this concept album, John Coltrane's Ballads has been redone as a vocal album by Karrin Allyson. Coltrane's album is justifiably famous. Recorded in 1962, Ballads is an example of Coltrane's work during his peak period. Its eight cuts showcase the talents of the venerable McCoy Tyner, Jimmy Garrison, and Elvin Jones. Karrin Allyson's album contains twelve cuts, the additional four consisting of Coltrane standards such as &quot;Naima&quot; and &quot;Nature Boy.&quot; It is the debut release from the new audiophile record label Pure Audiophile, run by Dennis Cassidy of Kansas City, Missouri. It was originally released as a Concord Jazz CD, but never as an LP. For this release, the cutting master was prepared from DAT by the renowned Paul Stubblebine, and the LPs were mastered at half speed by the incomparable Stan Ricker. This limited two-LP set was pressed on HQ 180-gram blue vinyl by Record Technology, Inc., and it comes in a heavy gatefold jacket. I reviewed a test pressing.\n \nKarrin Allyson has a sweet, pure voice, and her phrasing and breath control are outstanding. Her talents are quite well suited to this material. On the two up-tempo numbers in this album, she proves that she can swing, and her scat work is something to write home about. She demonstrates both on &quot;Nature Boy,&quot; in which she is backed by two beautiful-sounding acoustic guitars. She also swings and scats on &quot;All or Nothing at All,&quot; the other up-tempo piece on the album. Backing instruments include piano, acoustic bass, sax, and drums. The drums are the only obvious clue to the fact that this was not a purist-miked recording. The percussion is obviously multi-miked and spread across the rear of the soundstage, but the cymbals shimmer, the drumheads snap, and the percussion work is enjoyable. Stubblebine and Ricker have also done a good job of creating the illusion that this was not a recording made in studio booths, which it was. The soundstage sounds really together and coherent, and it usually sounds like the musicians were playing together in the same space.\n \nThis is a great album for late-night listening. Karrin's fluid vocals riding atop cymbals, drums, piano, and string bass will put you in a relaxed frame of mind, which will be enhanced by the sweet soprano sax solos. This is an album that will soothe you and transport you to another space. Open a bottle of good wine, turn down the lights, and enjoy.\n \nAnd now to what really surprised me: I went back and listened to the Coltrane version. John Coltrane is my single favorite jazz artist, bar none, but much to my surprise, I found that the Karrin Allyson version was more fun, more involving, more dynamic, and more interesting. This was a completely unexpected, and somewhat unbelievable outcome to a dyed-in-the-wool Coltrane fan such as myself. Who'da thunk? Highly recommended.\n \nTrack Listing:\n1. Say It (Over and Over Again)\n2. You Don't Know What Love Is\n3. Too Young to Go Steady\n4. All or Nothing at All\n5. I Wish I Knew\n6. What's New\n7. It's Easy to Remember\n8. Nancy (With the Laughing Face)\n9. Naima\n10. Why Was I Born\n11. Everytime We Say Goodbye\n12. Nature Boy (Bonus Track)\n \nTech Specs\nTurntable: Nottingham Analogue Interspace; \nCartridge: Shelter 501 MKII Low Output MC; \nPhono amp: Ray Samuels Audio Emmeline XR-2; \nPower cables: Black Sand Cables Silver Reference MKV with Wattgate 330i-350i Ag; \nComputer: MacBook Pro (FieWire out); \n?DC: Edirol FA-66 FireWire\nSoftware: Soundtrack Pro @ 96kHz/32-bit floating point/ClickRepair.\n \n","torrent":{"xt":"urn:btih:906c7a972533607a97436db426a57e77a578e1d1","amp;dn":"Karrin+Allyson+-+%28Ballads%29+Remembering+Coltrane+%5BVinyl-180g%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"906c7a972533607a97436db426a57e77a578e1d1","infoHashBuffer":{"type":"Buffer","data":[144,108,122,151,37,51,96,122,151,67,109,180,38,165,126,119,165,120,225,209]},"announce":[],"urlList":[]}}