{"title":"FTV Girls - Kim &amp; Nikki - At the Movies","uid":6086992,"size":214762813,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:90c55baafa18e60f63d1d97fc4ba248a9efeb5ce&amp;dn=FTV+Girls+-+Kim+%26+Nikki+-+At+the+Movies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"phatwarez","files":-1,"time":1294371280,"description":"FTV Girls - Kim &amp; Nikki - At the Movies\n\nKim: Nikki put on her cute yellow teddy which really turns me on because it makes her so cute and innocent and playable and tastable and other good stuff.  I put my arms around her and started playing with her nipple.  Good finger fun you know? Then we started making out like we're on a first date.  It was all an excuse for me to nibble on her ear and play with her until she was turned on and distracted from watching the movie.  I didn't care about watching it, zombie movies are not my thing.  We made out for a very long time until I could sense her cookie pulsating with pleasure.  I went back to her nipple and let her play with me.  I pulled her shorts off and started kissing around her thighs and belly and headed straight for her cookie.  I tasted and tongued her for such a long time until she came oozing tasty sweet juices.  I shared some with her when we kissed after.   I was in heaven when she went down on me and I let her eat me for a very long time till I came very hard.  I think this is the best way to fall asleep and have sweet dreams!\nNikki: I picked out a scary movie (I guess I'm not allowed to say what it is on her but maybe you guys figure it out by watching hehe).  It wasn't that great of a movie but it made us cuddle up on the scary parts.  Kim was all over me after a while I couldn't really watch the movie.  I know her nipples are sensitive so I moved to her breasts and sucked and kissed them the way she likes it.  I let her seduce me and make me come with her very sensual oral sex she is so good at giving me.  No guy can make me orgasm like she does, that's for sure.  Even more I enjoy how she reacts to me when I'm going down on her.  She is so sweet the way she moans and tightens up from pleasure I give her.  She is also very cuddly to go to sleep with.\n\nScreens (also in torrent):\n &lt;a href=&quot;\nhttp://kopimg.com/images/kopi_517_Kim_Nikki_At_the_Movies_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kopimg.com/images/kopi_517_Kim_Nikki_At_the_Movies_.jpg&lt;/a&gt;\n\nFile Size ------- 204mb\nLength ---------- 27:00\nResolution ------ 640x4800\nContainer ------- mkv\nVideo Codec ----- x264\nAudio Codec ----- mp3\nFrame Rate ------ 30\n\np h a t w a r e z . t k\nMade possible by your donations.","torrent":{"xt":"urn:btih:90c55baafa18e60f63d1d97fc4ba248a9efeb5ce","amp;dn":"FTV+Girls+-+Kim+%26+Nikki+-+At+the+Movies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90c55baafa18e60f63d1d97fc4ba248a9efeb5ce","infoHashBuffer":{"type":"Buffer","data":[144,197,91,170,250,24,230,15,99,209,217,127,196,186,36,138,158,254,181,206]},"announce":[],"urlList":[]}}