{"title":"Kurt Vonnegut - La colazione dei campioni [Pdf Epub ITA] [TntVil","uid":6706008,"size":24462786,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:911f4df94516ffe8e10092d9a6975782cbfc5f5d&amp;dn=Kurt+Vonnegut+-+La+colazione+dei+campioni+%5BPdf+Epub+ITA%5D+%5BTntVil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"YoriCeres","files":4,"time":1317165086,"description":"COVER &lt;a href=&quot;\nhttp://img193.imageshack.us/img193/5256/copertinazf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img193.imageshack.us/img193/5256/copertinazf.jpg&lt;/a&gt;\n\n\nSCHEDA\nTitolo originale: &quot;Breakfast of Champions, or goodbye blue monday&quot;\nAutore: Kurt Vonnegut\nData pubblicazione: 1973\nGenere: Romanzo\nNumero di pagine: 159 pp.\nFormato dei file: Pdf, Epub, Mobi, Lit\nDimensione complessiva dei file: 23,3 MB\n\n\nTRAMA - PLOT\nIl romanzo, partendo dal racconto di un incontro fra i due protagonisti (lo squattrinato scrittore di romanzi fantascientifici Kilgore Trout, e il ricco rivenditore di Pontiac Dwayne Hoover), si sviluppa come una complessa riflessione sulla societÃƒÂ  americana e sui primi cinquant'anni della vita di Vonnegut.\n\nBreakfast of Champions, or Goodbye Blue Monday is a 1973 novel by the American author Kurt Vonnegut. Set in the fictional town of Midland City, it is the story of &quot;two lonesome, skinny, fairly old white men on a planet which was dying fast.&quot; One of these men, Dwayne Hoover, is a normal-looking but deeply deranged Pontiac dealer and Burger Chef franchise owner who becomes obsessed with the writings of the other man, Kilgore Trout, taking them for literal truth. Trout, a largely unknown pulp science fiction writer who has appeared in several other Vonnegut novels, looks like a crazy old man but is in fact relatively sane. As the novel opens, Trout journeys toward Midland City to appear at a convention where he is destined to meet Dwayne Hoover and unwittingly inspire him to run amok.\n\n\nSCREENSHOTS &lt;a href=&quot;\nhttp://img23.imageshack.us/img23/8417/pdfn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img23.imageshack.us/img23/8417/pdfn.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img27.imageshack.us/img27/7295/epub.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img27.imageshack.us/img27/7295/epub.jpg&lt;/a&gt;\n\n\nRECENSIONE - REVIEW\nGiÃƒÂ  a partire dal titolo (&quot;Breakfast of Champions&quot; ÃƒÂ¨ il marchio registrato di una marca di cereali per la prima colazione) il libro rivela la volontÃƒÂ  dell'autore di fare satira sulla societÃƒÂ  americana, sul razzismo, sugli effetti della pubblicitÃƒÂ  e dei mass media, sulla guerra e sulla politica americana. Per ottenere l'effetto voluto, Vonnegut si affida, oltre che al suo solito stile di scrittura libero e caustico, ai disegni e ai mini-racconti delle trame dei libri di Trout inseriti all'interno del romanzo.\nLe numerose illustrazioni presenti, realizzate da Vonnegut stesso, rappresentano infatti oggetti e cose comuni come un paio di mutande, un cesto di pollo fritto, una mucca, sino ad arrivare a una vagina e un ano, e hanno lo scopo di creare un senso di straniamento nel lettore. L'effetto ottenuto ÃƒÂ¨ a metÃƒÂ  fra un libro illustrato per bambini, e un libro rivolto ad un alieno che ignora totalmente gli usi e i costumi dei terrestri del XX secolo e che ha quindi bisogno di vedere disegnato un hamburger per capire con esattezza cosa sia. La narrazione ÃƒÂ¨ poi spesso intervallata dai riassunti dei surreali libri di Trout. Oltre al giÃƒÂ  citato &quot;Ora si puÃƒÂ² dire&quot; che farÃƒÂ  impazzire Dwayne Hoover, si possono trovare un'altra decina di brevi storie che analizzano con spietata ironia i diversi aspetti della vita moderna.\nVonnegut scrisse questo romanzo a cinquant'anni esatti, riprendendo in esso numerosi personaggi dei suoi libri precedenti, come Trout, il miliardario Rosewater (&quot;Mattatoio n. 5&quot; e &quot;Dio la benedica, signor Rosewater&quot;), Francince Pefko (&quot;Ghiaccio-nove&quot;), o il cane da guardia Kazak (&quot;Le sirene di Titano&quot;), quasi come se in questo libro volesse tracciare un bilancio delle sue opere e della sua vita. Questo aspetto del romanzo emerge con chiarezza nella seconda parte, quando l'autore inserisce anche se stesso all'interno del racconto, creatore del mondo immaginario che osserva i suoi personaggi compiere le azioni che comanda loro, come tante marionette. In quest'ultima parte gli elementi autobiografici (come il suicidio della madre) si fondono con la trama principale, raggiungendo un climax nella scena in cui Vonnegut raggiunge Trout in una strada deserta e gli rivela di essere il suo creatore. Prima di andare via, scomparendo in una porta dimensionale, lo scrittore gli fa il dono del libero arbitrio mentre Trout, dietro di lui, continua ad urlare disperatamente &quot;Fammi tornare giovane... Fammi tornare giovane...&quot;.","torrent":{"xt":"urn:btih:911f4df94516ffe8e10092d9a6975782cbfc5f5d","amp;dn":"Kurt+Vonnegut+-+La+colazione+dei+campioni+%5BPdf+Epub+ITA%5D+%5BTntVil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"911f4df94516ffe8e10092d9a6975782cbfc5f5d","infoHashBuffer":{"type":"Buffer","data":[145,31,77,249,69,22,255,232,225,0,146,217,166,151,87,130,203,252,95,93]},"announce":[],"urlList":[]}}