{"title":"Eric Newby - Travel &amp; Autobiographical Writings (16 books)","uid":11059030,"size":92022008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9161dc315c2d5cee2b39ee8e2d7fe72a0ddce77d&amp;dn=Eric+Newby+-+Travel+%26amp%3B+Autobiographical+Writings+%2816+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1411151827,"description":"\nERIC NEWBY (1919-2006) was an English author of some of the best-loved books in the canon of English travel writing.  He began his travelling career in a perambulator commuting between Hammersmith Bridge, where his parents lived, and such seaside resorts as Frinton.  It was not until 1938 that he was able to persuade his father to have him apprenticed in one of the big Finnish, four-masted steel barques still engaged in the Australian grain trade with Europe, a voyage brilliantly evoked in THE LAST GRAIN RACE (1956).  During World War II he served in the SBS and was awarded the Military Cross.  This experience inspired LOVE AND WAR IN THE APENNINES (1971), the gripping real-life story of Newby's imprisonment and escape from an Italian prison camp.\n\nInformed by a pin-sharp eye and a self-deprecating persona, Newby's literary style was inspired by the comic portrait of the Englishman abroad presented in the writings of Alexander Kinglake, Robert Byron and Evelyn Waugh.  In a preface to the book that established Newby's reputation, A SHORT WALK IN THE HINDU KUSH (1958), Waugh identified the central elements of this humorous tradition: its quintessentially English spirit of amateurism and its tone of ironic understatement.  For Newby's &quot;short walk&quot; was in reality an arduous journey through the more remote parts of Afghanistan, culminating in a dangerous assault on Mir Samir, an unclimbed glacial peak of 20,000 ft.  The sum of his preparation for the mountaineering ahead was a brief weekend on the Welsh hills.\n\n\nThe following books are in ePUB format unless otherwise noted:\n\n* AROUND THE WORLD IN 80 YEARS (HarperCollins, 2000)\n\n* THE BIG RED TRAIN RIDE: A Ride on the Trans-Siberian Railway (St. Martin's, 1978) -- PDF\n\n* BOOK OF TRAVELLERS' TALES [editor] (Picador, 1985) -- PDF\n\n* DEPARTURES AND ARRIVALS (HarperCollins, 1999)\n\n* GREAT ASCENTS: A Narrative History of Mountaineering (Viking, 1977) -- PDF\n\n* THE LAST GRAIN RACE (Penguin, 1986) -- PDF\n\n* LOVE AND WAR IN THE APENNINES (HarperCollins, 1971)\n\n* MERRY DANCE AROUND THE WORLD: The Best of Eric Newby (HarperCollins, 1995)\n\n* ON THE SHORES OF THE MEDITERRANEAN (HarperCollins, 1984)\n\n* ROUND IRELAND IN LOW GEAR (HarperCollins, 1987)\n\n* SHORT WALK IN THE HINDU KUSH (HarperCollins, 1958)\n\n* SLOWLY DOWN THE GANGES (HarperCollins, 1966)\n\n* SMALL PLACE IN ITALY (HarperCollins, 1994)\n\n* SOMETHING WHOLESALE: My Life and Times in the Rag Trade (HarperCollins, 1962)\n\n* TRAVELLER'S LIFE (HarperCollins, 1982)\n\n* WHAT THE TRAVELLER SAW (HarperCollins, 1989)\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                    &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:9161dc315c2d5cee2b39ee8e2d7fe72a0ddce77d","amp;dn":"Eric+Newby+-+Travel+%26amp%3B+Autobiographical+Writings+%2816+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9161dc315c2d5cee2b39ee8e2d7fe72a0ddce77d","infoHashBuffer":{"type":"Buffer","data":[145,97,220,49,92,45,92,238,43,57,238,142,45,127,231,42,13,220,231,125]},"announce":[],"urlList":[]}}