{"title":"Clark Howard's Living Large in Lean Time - Clark Howard.mobi","uid":8069202,"size":552817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:918d1a4c85dbb8d9c2dc6514c9e13089e8df6cd6&amp;dn=Clark+Howard%27s+Living+Large+in+Lean+Time+-+Clark+Howard.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DaRule762","files":-1,"time":1359234833,"description":"Clark Howard is a media powerhouse and penny-pincher extraordinaire who knows a thing or two about money. A lifelong entrepreneur who is now the hugely popular host of a talk radio program and television show and the bestselling author of several books, Clark consistently delivers expert financial advice to his wide and devoted fan base.\n\nLiving Large in Lean Times is Clark's ultimate guide to saving money, covering everything from cell phones to student loans, coupon websites to mortgages, investing to electric bills, and beyond. In his candid and friendly next-door-neighbor manner, Clark shares the small, manageable steps everyone can follow to build a path towards independence and wealth. Chock-full of more than 250 invaluable tips, the book outlines how to:\n\n    Locate missing and unclaimed money in your name\n    Lower your student loan payment\n    Find legitimate work-at-home opportunities\n    Get unlimited texting and e-mailing for less than $10 per month\n    Know what personal info not to post to social media sites\n    Determine the best mortgage rate, and much, much more\n\n    As Clark demonstrates, there are myriad ways to reduce debt, buy smarter, and build a future. Follow his lead and he'll get you there.","torrent":{"xt":"urn:btih:918d1a4c85dbb8d9c2dc6514c9e13089e8df6cd6","amp;dn":"Clark+Howard%27s+Living+Large+in+Lean+Time+-+Clark+Howard.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"918d1a4c85dbb8d9c2dc6514c9e13089e8df6cd6","infoHashBuffer":{"type":"Buffer","data":[145,141,26,76,133,219,184,217,194,220,101,20,201,225,48,137,232,223,108,214]},"announce":[],"urlList":[]}}