{"title":"Forgotten Presidents (ARC) - spanikopita","uid":7775572,"size":4227027,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91ed761df5755818a70a337d7ceacd9804a58021&amp;dn=Forgotten+Presidents+%28ARC%29+-+spanikopita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"spanikopita","files":3,"time":1351644508,"description":"Their names linger in memory mainly as punch lines, synonyms for obscurity: Millard Fillmore, Chester Arthur, Calvin Coolidge. They conjure up not the White House so much as a decaying middle school somewhere in New Jersey. But many forgotten presidents, writes Michael J. Gerhardt, were not weak or ineffective. They boldly fought battles over constitutional principles that resonate today.\n\nGerhardt, one of our leading legal experts, tells the story of The Forgotten Presidents. He surveys thirteen administrations in chronological order, from Martin Van Buren to Franklin Pierce to Jimmy Carter, distinguishing political failures from their constitutional impact. Again and again, he writes, they defied popular opinion to take strong stands. Martin Van Buren reacted to an economic depression by withdrawing federal funds from state banks in an attempt to establish the controversial independent treasury system. His objective was to shrink the federal role in the economy, but also to consolidate his power to act independently as president. Prosperity did not return, and he left office under the shadow of failure. Grover Cleveland radically changed his approach in his second (non-consecutive) term. Previously he had held back from interference with lawmakers; on his return to office, he aggressively used presidential power to bend Congress to his will. Now seen as an asterisk, Cleveland consolidated presidential authority over appointments, removals, vetoes, foreign affairs, legislation, and more. Jimmy Carter, too, proves surprisingly significant. In two debt-ceiling crises and battles over the Panama Canal treaty, affirmative action, and the First Amendment, he demonstrated how the presidency's inherent capacity for efficiency and energy gives it an advantage in battles with Congress, regardless of popularity.\n\nIncisive, myth-shattering, and compellingly written, this book shows how even obscure presidents championed the White House's prerogatives and altered the way we interpret the Constitution.\n\n---\n\nMOBI, PDF (ARC)","torrent":{"xt":"urn:btih:91ed761df5755818a70a337d7ceacd9804a58021","amp;dn":"Forgotten+Presidents+%28ARC%29+-+spanikopita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91ed761df5755818a70a337d7ceacd9804a58021","infoHashBuffer":{"type":"Buffer","data":[145,237,118,29,245,117,88,24,167,10,51,125,124,234,205,152,4,165,128,33]},"announce":[],"urlList":[]}}