{"title":"Celeste Jones - De oskuldsfulla - 2007 - DAISY","uid":6810709,"size":251950044,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:92ed7c2b9ca375b748a439ad2c9e105e592ba04e&amp;dn=Celeste+Jones+-+De+oskuldsfulla+-+2007+-+DAISY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosasune","files":-1,"time":1321028324,"description":"\nDE OSKULDSFULLA ar en otrolig historia om tre systrar som vaxer upp i en religios sekt, och om deras respektive flykt ifran detta liv.\n\nJuliette, Kristina och Celeste fods in i och vaxer upp i sekten Guds barn. Sekten grundades i Amerika under sent sextiotal och ar nu kand under namnet Family International. En av de mest upprorande aspekterna av sektens religiosa utovande ar anvandandet av sex for att askadliggora Guds karlek, nagot som i grund och botten betydde sex mellan sektens medlemmar, oavsett deras respektive alder.\n\nSystrarna formades fran fodseln till att bli Guds soldater. I tidig alder skilde man dem at och de vaxte upp med helt skilda erfarenheter fran sin tid i sekten. Celeste var involverad i de hogre skikten av armÃƒÂ©n, Kristina var fotsoldat och Julianna var rebellen som testade den strikta regimens granser sa fort hon fick tillfalle. Gemensamt har de anda kanslan av att det ar nagot som ar i grunden fel med den varld de lever i, trots att de inte kanner till nagot annat liv.\n\nVi far folja med pa deras livsresa i sekten tragedin, absurditeterna och det slutgiltiga hoppet och deras liv efterat. De har ocksa tre yngre systrar i Uganda, och de fokuserar nu pa att forhindra att deras egna erfarenheter upprepas. \n\n\n\nUpplasare: Anna Dobling","torrent":{"xt":"urn:btih:92ed7c2b9ca375b748a439ad2c9e105e592ba04e","amp;dn":"Celeste+Jones+-+De+oskuldsfulla+-+2007+-+DAISY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92ed7c2b9ca375b748a439ad2c9e105e592ba04e","infoHashBuffer":{"type":"Buffer","data":[146,237,124,43,156,163,117,183,72,164,57,173,44,158,16,94,89,43,160,78]},"announce":[],"urlList":[]}}