{"title":"More Softies: 22 New Friends to Sew and Crochet","uid":9270612,"size":24540178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:932e0cb449e2ca033b495acd8437bafc02c9de32&amp;dn=More+Softies%3A+22+New+Friends+to+Sew+and+Crochet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KnitLady","files":-1,"time":1385771696,"description":"ollowing the huge success of Softies comes More Softies, with lots of new quirky, cute and cuddly dolls for you to make at home. Talented crafters from around the world have contributed their inspired designs to this book and each unique softie is testament to their passion and inventiveness. There are instructions and patterns for 22 adorable soft toys that will appeal to adults and children alike. The toys are made using a range of techniques, from simple hand-sewing to crochet, and there are patterns to suit everyone - from complete beginners to experienced crafters. Each entry includes a list of tools and materials that you'll need, as well as detailed instructions, hints and tips. The instructions are clear and simple, and a handy glossary of terms and techniques ensures that even if you've never felt crafty before, you'll be able to create one of these fabulous critters. Hunting down the perfect vintage fabric, choosing which charming toy to make next, and exploring your creativity with new techniques and styles, are all part of the fun of making your own softies. Crafts.","torrent":{"xt":"urn:btih:932e0cb449e2ca033b495acd8437bafc02c9de32","amp;dn":"More+Softies%3A+22+New+Friends+to+Sew+and+Crochet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"932e0cb449e2ca033b495acd8437bafc02c9de32","infoHashBuffer":{"type":"Buffer","data":[147,46,12,180,73,226,202,3,59,73,90,205,132,55,186,252,2,201,222,50]},"announce":[],"urlList":[]}}