{"title":"Groundhog Day Full DVD Pal Multisubs by sonrisita","uid":3370322,"size":4625733632,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9443e087696bb3a97f1a7023bb36daa4778e29aa&amp;dn=Groundhog+Day+Full+DVD+Pal+Multisubs+by+sonrisita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sonrisita","files":30,"time":1124131390,"description":"ORIGINAL TITLE Groundhog Day \nYEAR 1992 \nRUNNING TIME 101 min. \nCOUNTRY EEUU\n\nDIRECTOR Harold Ramis \nSCREENWRITER Danny Rubin &amp; Harold Ramis (Story: Danny Rubin) COMPOSER / MUSIC George Fenton \nCINEMATOGRAPHER John Bailey \n\nCAST Bill Murray, Andie MacDowell, Chris Elliot, Stephen Tobolowsky, Brian Doyle-Murray, Marita Geraghty, Angela Paton, Rick Ducommun, Rick Overton \n\nSTUDIO / PRODUCER Columbia Pictures \n\nGENRE Comedy \n\nSYNOPSIS Once again, for the fifth year in a row, TV weatherman Phil Connors (Bill Murray) is forced to cover the Groundhog Day ceremonies in Punxsutawney, Pennsylvania, an assignment he truly despises. But this year something truly bizarre happens after he finishes the report: When he wakes up the next morning, ready to leave, he discovers its February 2 all over again. He tries to tell his producer, Rita (Andie MacDowell), whats happening, but neither she nor anyone else understands; only he remembers that theyve already lived through Groundhog Day. When the same thing happens the next morning, he thinks hes going insane and wreaks havoc all through the town. More and more mornings pass, all of them February 2, and all of them with an ever angrier Phil. Desperate to escape, he even tries suicide, but still another February 2 dawns. As he starts realizing that his exploits are not making time march on any quicker, Phil begins to change his behavior, performing a series of lifesaving tasks until he becomes a model citizen, hoping it will be enough to get him out of Punxsutawney forever. Along the way he learns more about the people around him--and himself--than he ever thought possible. The film is extremely well put together by director Harold Ramis, and the script by Danny Rubin and Ramis is sharp and clever. The actors--many of whom have to perform essentially the same scene over and over again, with only subtle differences--is a riot.\n\n\n\nOthers:\nPal, Widescreen 1.85:1, 16:9\n\nCompression: DvdRebuilder + CCE 9pass\n\nAudio: Spanish, English   (Dolby Surround)\n\nSubs: Spanish, English, French, German, Polish, Czech, Hungarian, Hindu, Turkish, Danish, Arab, Bulgarian, Swedish, Finnish, Icelandic, Dutch, Norwegian, Portuguese, Greek, Hebrew, Italian, Croatian","torrent":{"xt":"urn:btih:9443e087696bb3a97f1a7023bb36daa4778e29aa","amp;dn":"Groundhog+Day+Full+DVD+Pal+Multisubs+by+sonrisita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9443e087696bb3a97f1a7023bb36daa4778e29aa","infoHashBuffer":{"type":"Buffer","data":[148,67,224,135,105,107,179,169,127,26,112,35,187,54,218,164,119,142,41,170]},"announce":[],"urlList":[]}}