{"title":"Cher - 3614 Jackson Highway (1969) MP3@256kbps","uid":9621073,"size":63892000,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:94b6112c5b1b79f39e883db57806f1aa91882617&amp;dn=Cher+-+3614+Jackson+Highway+%281969%29+MP3%40256kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":12,"time":1392499039,"description":"614 Jackson Highway was released in the summer of 1969, was the first and last solo studio album for Atco, and was produced by Jerry Wexler, Tom Dowd and Arif Mardin. The cover is a photograph of Cher with the musicians who played on the album. They are: front row, left to right: guitarist Eddie Hinton, bassist David Hood, Sonny Bono, Cher, producer Jerry Wexler, background vocalist Jeannie Greene, background vocalist Donna Jean Godchaux nee,Thatcher, and producer Tom Dowd. Back row, left to right: lead guitarist Jimmy Johnson, producer Arif Mardin, drummer Roger Hawkins and keyboardist Barry Beckett. Missing were background vocalists Mary Holiday and Sue Pilkington.\n\nThis disc is certainly Cher's most ambitious project (at least for the '60s) and was designed to bring Cher success after a period of crisis because 1968-1970 wasn't a good period for Sonny &amp; Cher and for Cher as a solo artist. The worldwide pop culture was moving on, but Sonny &amp; Cher stayed in their original image and style. Pop music was transforming into a harder style marked by anti-war songs protesting the war in Vietnam. Cher's and Sonny &amp; Cher's music didn't really fit in. So their records weren't really selling anymore. For months they had a nightclub act, but the audience response was less than positive.\nIf the public response to this album was low, the criticism was ecstatic. Critics judged this as one of Cher's best albums. A surprising element of the disc was the maturing voice of Cher, which showed more strength and versatility than in previous works. Another surprise was the sophisticated instrumentation and arrangements, which gave the disc a rock edge, along with Cher's success in interpreting other artists' songs.\n\nThe title of the album represents the address of Muscle Shoals Sound Studio in Sheffield, Alabama, where the disc was recorded.\nIn 1968 and 1969 Cher recorded songs which would have become an album in 1970. For unknown reasons the release was cancelled however five songs were released as singles. The other five tracks remained unreleased until 2001 when Rhino Records released a limited edition (only 4500 copies) of the album 3614 Jackson Highway with all the songs from the canceled album included as bonus tracks. The song &quot;Superstar&quot; is also included which was originally cut from the cancelled album.","torrent":{"xt":"urn:btih:94b6112c5b1b79f39e883db57806f1aa91882617","amp;dn":"Cher+-+3614+Jackson+Highway+%281969%29+MP3%40256kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94b6112c5b1b79f39e883db57806f1aa91882617","infoHashBuffer":{"type":"Buffer","data":[148,182,17,44,91,27,121,243,158,136,61,181,120,6,241,170,145,136,38,23]},"announce":[],"urlList":[]}}