{"title":"Baldurs.Gate.II.Enhanced.Edition-0x0007","uid":14142552,"size":2179616768,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:94f8f86d235295b2c68f081436c73cba8b6810ea&amp;dn=Baldurs.Gate.II.Enhanced.Edition-0x0007&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":1,"time":1459627919,"description":"0x0007 presents\r\nBaldurs Gate II Enhanced Edition (c) Beamdog\r\n\r\n12/2014 :..... RELEASE.DATE .. PROTECTION\r\nDE/EN/ES :......... LANGUAGE .. GAME.TYPE ........: RPG, Strategy\r\n\r\nNOTE: This is v1.3 which adds Spanish and German Language.\r\n\r\n&quot;He who fights with monsters should look to it that he himself does not\r\nbecome a monster... When you gaze long into the abyss, the abyss also\r\ngazes into you...&quot;\r\nKidnapped. Imprisoned. Tortured. The wizard Irenicus holds you captive in\r\nhis stronghold, attempting to strip you of the powers that are your\r\nbirthright.\r\nCan you resist the evil within you, forge a legend of heroic proportions,\r\nand ultimately destroy the dark essence that haunts your dreams? Or will\r\nyou embrace your monstrous nature, carve a swath of destruction across\r\nthe realms, and ascend to godhood as the new Lord of Murder?\r\n\r\nFEATURES:\r\n\r\n- Throne of Bhaal: Travel to Tethyr in this thrilling conclusion to the\r\nBhaalspawn saga, and delve into the treasure-filled halls of Watcher's\r\nKeep!\r\n- Fist of the Fallen: Help the Sun Soul Monk Rasaad find peace in his\r\nquest for vengeance, and determine the fate of a heretical sect.\r\n\r\n- A Price Paid in Blood: Join the Blackguard Dorn in carving a swath of\r\ndestruction across the Realms, as he struggles to appease the\r\nincreasingly bloody demands of his dark patron.\r\n- A Voice in the Dark: Recruit the mysterious Thief Hexxat and take up\r\nher mission of retrieving long-lost artifacts from tombs as far away\r\nas Zakhara..\r\n- In Defense of the Wild: Protect the innocent and stand with Neera the\r\nWild Mage against a ruthless school of Red Wizards.\r\n\r\n- The Black Pits II - Gladiators of Thay: Explore the tactical depth of\r\nhigh-level Dungeons &amp; Dragons combat. Turn your captors against each\r\nother while you dodge traps and battle for your life against\r\nDemi-Liches, Mind Flayers, and the legendary Githyanki.\r\n- Easy Multiplayer: Baldur's Gate II: Enhanced Edition makes it easy to\r\nfind, list, and join multiplayer games, even while behind a firewall.\r\n- Widescreen and More: Baldur's Gate II: Enhanced Edition features full\r\nwidescreen support, remastered area artwork from original renders,\r\nand a host of other interface and gameplay improvements.\r\n\r\n- The 1.3 Release: The latest update to Baldur's Gate II: Enhanced\r\nEdition fixes hundreds of gameplay issues and adds dozens of new\r\nenhancements such as adjustable font sizes, improved party\r\npathfinding, and much, much more.\r\n\r\nNote: All translations are text only. Voice-overs are played in English.\r\n\r\n1. Unrar.\r\n2. Burn or mount the image.\r\n3. Install the game.\r\n4. Play the game.\r\n5. Support the software developers. If you like this game, BUY IT!\r\n\r\nNothing so far\r\n\r\neXpect\r\nmore soon!","torrent":{"xt":"urn:btih:94f8f86d235295b2c68f081436c73cba8b6810ea","amp;dn":"Baldurs.Gate.II.Enhanced.Edition-0x0007","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94f8f86d235295b2c68f081436c73cba8b6810ea","infoHashBuffer":{"type":"Buffer","data":[148,248,248,109,35,82,149,178,198,143,8,20,54,199,60,186,139,104,16,234]},"announce":[],"urlList":[]}}