{"title":"New Turkish Cinema Belonging, Identity and Memory(pdf){Zzzzz}","uid":11524695,"size":2963876,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94ffeb62abf65863132b02125984955f2011d13d&amp;dn=New+Turkish+Cinema+Belonging%2C+Identity+and+Memory%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1416519042,"description":"Providing a sharp and engaging analysis of the films by internationally acclaimed new wave Turkish directors like Nuri Bilge Ceylan, Zeki Demirkubuz, Yesim Ustaoglu, Dervis Zaim, Serdar Akar, and Yilmaz Erdogan, this is the first full examination of contemporary Turkish cinema to be published in English.\n\nAsuman Suner explores the emergence of the new wave Turkish cinema against the backdrop of the drastic transformation of Turkey since the 1990s. Suner argues that this new cinema, including both commercial and independent productions, persistently returns to the themes of belonging, identity and memory; it is how films address these themes that constitutes a dividing line, with big budget popular films tending to settle contradictions into comforting resolutions, while independent movies demonstrate their paradoxical nature. At the same time, she addresses the divergences between popular and &quot;art&quot; cinema that destabilize the very distinction between these categories.\n\nPublisher: I. B. Tauris (January 19, 2010)\nLanguage: English\nISBN-10: 1845119509\nISBN-13: 978-1845119508\n\nEditorial Reviews\nReview\n&quot;An impressive introduction to new wave Turkish films...Suner is a good guide to a body of work that demands attention. The themes she identifies--&quot;home&quot; and identity--play out in a Turkey that is undergoing change and experiencing challenges from abroad and from &quot;home.&quot; Here one learns not only about contemporary Turkish film but also, even without seeing the films, about Turkey. Recommended.&quot;--Choice\n\nAbout the Author\nAsuman Suner has published widely on Turkish cinema, her articles appearing in such publications as Screen, Sight and Sound, and New Perspectives on Turkey. She is professor at the Department of Humanities and Social Sciences in Istanbul Technical University,Turkey","torrent":{"xt":"urn:btih:94ffeb62abf65863132b02125984955f2011d13d","amp;dn":"New+Turkish+Cinema+Belonging%2C+Identity+and+Memory%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ffeb62abf65863132b02125984955f2011d13d","infoHashBuffer":{"type":"Buffer","data":[148,255,235,98,171,246,88,99,19,43,2,18,89,132,149,95,32,17,209,61]},"announce":[],"urlList":[]}}