{"title":"Get Started Painting (gnv64)","uid":7885142,"size":32175077,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96eaa2789bde0c967adf637a7cee26a7af9b079b&amp;dn=Get+Started+Painting+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1354598471,"description":"Get Started Painting: Explore Acrylic, Oil, Pastel, and Watercolor (How to Draw and Paint Series: Beginner?s Guides)\nby Marla Baggetta, Tom Swimm, Geri Medway and Marilyn Grame\nWalter Foster | June 2007 | ISBN-10: 1600580459 | PDF | 32 pages | 30.6 mb &lt;a href=&quot;\nhttp://www.amazon.com/Get-Started-Painting-Watercolor-ebook/dp/B005P33OBY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Get-Started-Painting-Watercolor-ebook/dp/B005P33OBY&lt;/a&gt;\n\nLearn how to paint in four different media! Taking the first steps to learn how to paint can be a challenge, especially when beginning artists are unsure which medium best suits them. With this book, aspiring artists will discover the qualities and benefits of four painting media-acrylic, oil, pastel, and watercolor-making it easier for them to begin their artistic journey. After an in-depth introduction to the tools and materials needed for each medium, five accomplished artists guide readers step by step through the creation of their own works of art.\n\nAbout the Authors\nMarla Baggetta has been a self-employed, professional artist since 1983. She currently lives in Oregon and holds painting workshops.\nMarilyn Grame of Jamul, CA, has taught art for more than 20 years and has received numerous awards for her artwork at local, state, and national levels.\nTom Swimm has felt an instinctive need to paint since his early childhood. Although he is self-taught, he has long been inspired by the work of Van Gogh, Monet, and Hopper, and he considers these masters his teachers. Tom's first one-man exhibition was at the Pacific Edge Gallery in Laguna Beach, California. His work has also been displayed in several other California galleries, at ArtExpo New York, and at the APPAF Exhibition in Paris, France. His paintings have also appeared on the cover of Skyward Marketing's in-flight magazine in 2001, as well as on the cover of Artist's Magazine in 1992. And Tom's work is currently featured in several Walter Foster Publishing titles\nArtist Caroline Zimmermann of Laguna Beach, CA, spends much of her time traveling, painting, and exhibiting abroad.","torrent":{"xt":"urn:btih:96eaa2789bde0c967adf637a7cee26a7af9b079b","amp;dn":"Get+Started+Painting+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96eaa2789bde0c967adf637a7cee26a7af9b079b","infoHashBuffer":{"type":"Buffer","data":[150,234,162,120,155,222,12,150,122,223,99,122,124,238,38,167,175,155,7,155]},"announce":[],"urlList":[]}}