{"title":"Two Days in October (TV) [2005] PBS","uid":6966616,"size":1917402844,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:974ea2bb1457db2a3fffc342587d095bf489d655&amp;dn=Two+Days+in+October+%28TV%29+%5B2005%5D+PBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1326944247,"description":" &lt;a href=&quot;http://bayimg.com/AAllHaaDn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/AAllHaaDn&lt;/a&gt;\n\nThe American Experience\n \nTwo Days in October \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0769832/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0769832/&lt;/a&gt;\n\nOriginal Air Date:17 October 2005 \n\nSome stayed. Some went. All fought.\n\nIn October 1967, history turned a corner. In a jungle in Vietnam, a Viet Cong ambush nearly wiped out an American battalion, prompting some in power to question whether the war might be unwinnable. On a campus in Wisconsin, a student protest against the war spiraled out of control, marking the first time that a campus anti-war demonstration had turned violent.\n\nAmerican Experience presents Two Days in October, based on the book They Marched Into Sunlight by Pulitzer Prize-winning journalist David Maraniss. From director Robert Kenner (War Letters, Influenza 1918, John Brown's Holy War), this moving film examines the critical events that took place in the turbulent fall of 1967.\n\nThe emotionally wrenching parallel stories are told by the people whose lives were irrevocably changed by what happened -- American and Viet Cong soldiers, relatives of men killed in battle, protesting students, police officers, and university faculty and administrators. Collectively, their words speak to the heartbreak caused by the war and the stark division it wrought on the home front. &quot;Nearly forty years later, it's obvious that the pain lies just below the surface for those who were involved,&quot; says Kenner. &quot;They're still affected by those two days.&quot;\n\nOn October 17, Lieutenant Colonel Terry Allen, commander of the Black Lions special unit, was in low spirits. Thoughts of home weighed heavily on his mind. His wife, Jean Ponder Allen, speaks in the film of the &quot;Dear John&quot; letter she sent him from their El Paso home: &quot;I began to doubt what it means to be a military wife, and I began to have serious doubts about our own marriage.&quot; Allen led his men into the jungle, looking for engagement with the Viet Cong. Suddenly, medic Tom Hinger recalls, &quot;there was this series of clicking sounds, and then the battle started. It sounded like every weapon in the world was being fired from all directions on us.&quot; Of the 142 Americans who went out that day, 64 died, including Allen. &quot;A bullet came overhead and hit him,&quot; recalls Delta Commander Clark Welch. &quot;When he fell forward, I could see that he was holding a picture of his three little girls.&quot;\n\nLater that day, Nguyen Van Lam, a Viet Cong soldier who lived near the battlefield, remembers sneaking back to examine the damage. &quot;I thought, 'Did we kill them all?' What we saw made us shudder.&quot;\n\nJust one day after the bloody encounter in the jungle, students at the University of Wisconsin in Madison staged what began as a peaceful protest against the presence of Dow Chemical, makers of napalm, who had come to recruit on campus. The hundreds of anti-war protesters, who thought they had an ally in Chancellor William Sewell, were no match for the police he called in to remove the students from one of the main campus buildings. &quot;We didn't know what to expect, we just knew that we were way outnumbered,&quot; recalls Madison officer Keith Hackett. But the thirty police made up for their numbers with brute force, tear gas, and billy clubs. Jack Cipperly, an assistant dean at the time, recounts the shock of restraining a police officer about to club a student, then realizing that the officer was a former classmate. The melee landed sixty-five people in the hospital. &quot;It was the most brutal and violent thing I have ever witnessed in my life,&quot; says Jane Brotman, then a freshman at the university.\n\nDistrust of the government and the press began to run rampant. &quot;In the days after Dow, the newspapers came out with stories that essentially blamed the students for what happened,&quot; recalls Mark Greenside, a student protester. &quot;It just added to the credibility gap that we already felt with all of the institutions of authority.&quot; The surviving Black Lions were also dismayed by the news coverage of the fateful day in the jungle. &quot;It was a total fabrication of what really happened. I'm not a cynic, but I started to become one,&quot; says Major Jim Shelton. &quot;Who the hell knows what really happened if that's the way history is written?&quot; A sense of disillusionment set in on both sides.\n\nMaurice Zeitlin, then a professor at the University, concludes, &quot;The men who fought in that war carried the burden of being an American citizen. When they were sent to war, they fought. I carried the burden, not at all comparable, of being an American citizen by opposing that war. But we were both doing our duty.&quot;\n\n&quot;These two simultaneous events, half a world apart, offer a window into a moment that divided a nation and a war that continues to haunt us,&quot; says American Experience executive producer Mark Samels.\n\n\n","torrent":{"xt":"urn:btih:974ea2bb1457db2a3fffc342587d095bf489d655","amp;dn":"Two+Days+in+October+%28TV%29+%5B2005%5D+PBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"974ea2bb1457db2a3fffc342587d095bf489d655","infoHashBuffer":{"type":"Buffer","data":[151,78,162,187,20,87,219,42,63,255,195,66,88,125,9,91,244,137,214,85]},"announce":[],"urlList":[]}}