{"title":"Sam Bush - Laps In Seven [2006][EAC/FLAC]","uid":11760977,"size":364263737,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:98027d51305b8afb6958beeb3d8bd93af044b358&amp;dn=Sam+Bush+-+Laps+In+Seven+%5B2006%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":17,"time":1426584452,"description":" FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#:Sugar Hill #SHCD 4013\nCountry: USA\nYear: June 13, 2006\nGenre: americana bluegrass\nFormat: CD\n\n1.The River's Gonna Run \n2.Bringin' In The Georgia Mail \n3. The Dolphin Dance \n4. On The Road \n5. Riding That Bluegrass Train \n6. I Wanna Do Right \n7. Where There's A Road \n8. New Country \n9. Ballad For A Soldier \n10. River Take Me \n11. White Bird \n12. Laps In Seven\n\nWhen it comes to mandolin, Sam Bush has been a leading innovator for decades. He uses acoustic, electric and slide techniques. But, &quot;Laps in Seven&quot; also illustrates the master musician's proficiency on fiddle, guitar and as a lead and harmony vocalist. By the time he had graduated high school in Kentucky in 1970, Sam had won three Junior National Fiddle Championships and had produced the ground-breaking &quot;Poor Richard's Almanac&quot; album. Over the years, he's seemed to develop even greater affinity for and skill on mandolin, continually building his reputation as the &quot;greatest all-purpose mandolinist&quot; (as per David Grisman). Sam Bush is wired as a mandolin player; he once said he learned fiddle tunes by first learning them on the mandolin in order to visualize the song, where the notes sit and how they interact. As you listen to an album like this, try to get into his head and understand where he's coming from musically. \nThere are the rocking rhythms and syncopations that Sam is well-known for. There is his excellent sense of timing, largely a function of his right-hand technique along with his ability to play all over the mandolin's fingerboard with creative melodic licks that are of his own device. He co-wrote (with John Pennell) the song &quot;Ridin' That Bluegrass Train,&quot; that shows his loud, clear, sharp attack to music. He also knows how to get the best players and singers involved. Wizards like Scott Vestal (banjo), Keith Sewell (guitar), and Byron House (bass) can only make you sound better. Using Chris Brown on drums is a clear statement of Sam's intent to continue trying to find that balance in his newgrass music that also allows for mass market appeal and more widespread radio airplay than just on the mom-and-pop one-hour-a-week bluegrass shows. Those shows will air his driving rendition of &quot;Bringing in the Georgia Mail.&quot; \nSam may have mellowed a tad in recent times as his music evolves for this century. &quot;Laps In Seven&quot; also features four guest vocalists (Emmylou Harris, Tim O'Brien, Shaun Murphy, Andrea Zonn), and there's another wild ride (&quot;New Country&quot;) that has Jean Luc Ponty's electric violin in the mix for his original composition. Sam may not rock out as hard as he used to, but &quot;White Bird&quot; revisits that classic song from the sixties (originally done by It's A Beautiful Day). There are also songs with messages, such as Leon Russell's &quot;Ballad for a Soldier.&quot; Establishing a funky groove, &quot;I Wanna Do Right&quot; incorporates Vestal's banjo synthesizer and the Do-Right Singers (Shaun, Sam, Byron) in a tribute to Hurricane Katrina victims. &quot;The Dolphin Dance&quot; is a far-out instrumental that has the musical notes leaping and diving with playful, buoyant abandonment. \nDarrell Scott's &quot;River Take Me&quot; was learned at a recording session years ago, as was Robbie Fulks' &quot;Where There's A Road.&quot; John Hartford's &quot;On The Road&quot; with its 5/4 time signature is a statement about being all messed up while on the road. The title cut (and closer) for &quot;Laps in Seven&quot; was inspired by his dog, Ozzie, lapping his water in a syncopated 7/4 time signature. You actually hear him drinking from his waterbowl at the end of the generous nearly hour-long set. \nAll songs on the 55-minute project include: The River's Gonna Run, Bringing In The Georgia Mail, The Dolphin Dance, On The Road, Ridin' That Bluegrass Train, I Wanna Do Right, Where There's A Road, New Country, Ballad for a Soldier, River Take Me, White Bird, Laps in Seven\nSam Bush has a clear vision for his music with mandolin, fiddle, banjo, guitar, bass and drums. Still presenting string-band music, he's also picking his clarion notes so they blend and progress seamlessly and creatively into the future","torrent":{"xt":"urn:btih:98027d51305b8afb6958beeb3d8bd93af044b358","amp;dn":"Sam+Bush+-+Laps+In+Seven+%5B2006%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98027d51305b8afb6958beeb3d8bd93af044b358","infoHashBuffer":{"type":"Buffer","data":[152,2,125,81,48,91,138,251,105,88,190,235,61,139,217,58,240,68,179,88]},"announce":[],"urlList":[]}}