{"title":"Blondie - Island Of Lost Souls (Xvid-2nafish)","uid":6048850,"size":111995192,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:982a2d09506e1937b6e1f5def1a2937c7e46ddba&amp;dn=Blondie+-+Island+Of+Lost+Souls+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1292656070,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:47\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 3815 Kbps\nQuality Factor : 0.75 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Island Of Lost Souls&quot; is a song recorded by Blondie in 1981 and released as a single in April 1982. It was the first single released from their sixth studio album, The Hunter.\n\nDue to their ability to span different genres of music, including rock, disco, reggae and rap/hip-hop (all of which had given the band no.1 hits), Blondie delved into calypso music for &quot;Island of Lost Souls&quot;. The single peaked at #37 in the Billboard Hot 100, and #11 in the United Kingdom, becoming their last sizeable hit until &quot;Maria&quot; seventeen years later.\n\nThe Hunter is the sixth studio album by the US band Blondie, released in May 1982.\n\nWork began on the album in 1981 following the release of Debbie Harry's debut solo album Koo Koo. The Hunter would be Blondie's last album of new material until 1999's No Exit.\n\nThe album had two singles, &quot;Island of Lost Souls&quot; and &quot;War Child&quot; (the latter of which was also released as a 12&quot; extended version).\n\nThe song &quot;For Your Eyes Only&quot; was originally written for the 1981 James Bond film of the same name. The producers of the film however favoured a track composed by Bill Conti and Michael Leeson and asked Blondie to record that song instead. Blondie declined, the Conti/Leeson song was passed on to Sheena Easton and Deborah Harry and Chris Stein's Bond theme subsequently ended up on The Hunter.\n\nTracks on the album include Jimmy Destri's Motown pastiche &quot;Danceway&quot;, while &quot;Dragonfly&quot; has a science-fiction theme to its lyrics about a race in space. &quot;The Beast&quot; deals with Deborah Harry's experiences of becoming a public figure; &quot;I am the centre of attraction, by staying off the streets&quot;. &quot;English Boys&quot; is Harry and Chris Stein's melancholy tribute to &quot;those English boys who had long hair&quot;; The Beatles, recorded the year after John Lennon's assassination in New York City, describing the innocence and idealism of the 60's, while &quot;War Child&quot; references military conflicts in Cambodia and the Middle East. The album concludes with a cover version of Smokey Robinson's &quot;The Hunter Gets Captured by the Game&quot;, originally recorded by The Marvelettes in 1967; &quot;What's this whole world coming to? Things just ain't the same...&quot;. As producer Mike Chapman says in his liner notes to the 2001 re-issue of The Hunter; &quot;I knew that we were in a different and far less accessible artistic space. And that worried me. I could tell that things were different now, and I knew that this would be the last Blondie album.&quot;\n\nThe album peaked at #9 in the UK and #33 in US. Compared to Blondie's three previous albums with Chapman as producer (Parallel Lines, Eat to the Beat and Autoamerican), The Hunter proved to be a disappointment, both commercially and critically and six months after its release the band dissolved. The Tracks Across America Tour '82 was set to promote the album, but after twenty dates it was cancelled.\n\nThe Hunter was digitally remastered and re-issued by Chrysalis Records UK in 1994, and again by EMI-Capitol in 2001, both times with the 12&quot; version of &quot;War Child&quot; as the only bonus track.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:982a2d09506e1937b6e1f5def1a2937c7e46ddba","amp;dn":"Blondie+-+Island+Of+Lost+Souls+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"982a2d09506e1937b6e1f5def1a2937c7e46ddba","infoHashBuffer":{"type":"Buffer","data":[152,42,45,9,80,110,25,55,182,225,245,222,241,162,147,124,126,70,221,186]},"announce":[],"urlList":[]}}