{"title":"BLAQK AUDIO - CEX CELLS [FUDGESOCIETY]","uid":5471571,"size":61309877,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:993ae7ac64c6e7d8241dd965724417ced020e8da&amp;dn=BLAQK+AUDIO+-+CEX+CELLS+%5BFUDGESOCIETY%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FudgeSociety","files":-1,"time":1269915635,"description":"THE COMPLETE BLAQK AUDIO FIRST ALBUM\n::::::::::::::::::::::::::::::::::::\n\n\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nCEX CELLS:::Includes\n-Stiff Kittens\n-Between Breaths (an XX perspective)\n-Snuff On Digital\n-Bitter For Sweet\n-Where Would You Like Them Left?\n-The Fear Of Being Found\n-On A Friday\n-The Love Letter\n-Semiotic Love\n-Cities Of Night\n-Again, Again, And Again\n-Wake Up, Open The Door, And Escape To The Sea\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\nBlaqk Audio is an electronic music band formed by current AFI members Davey Havok and Jade Puget under Interscope Records. Their debut album CexCells was released on August 14, 2007 and reached #18 on the Billboard 200.\n\nAFI have increasingly included synthesized elements into their recent albums; 2003 release Sing the Sorrow and 2006 release Decemberunderground credit Puget with 'programming and keyboards'.[2][3] These synthesized elements are particularly apparent on songs such as &quot;Death of Seasons&quot; and &quot;37mm&quot;. In the August 2006 edition of Guitar World, Puget states that AFI songs &quot;37mm&quot; and &quot;Love Like Winter&quot; were both originally intended as part of the Blaqk Audio side project.[4] Elements of programming, however, can be found as early as 2000's The Art of Drowning, which featured a drum machine on &quot;The Despair Factor&quot;.[5]\n\nIn January 2007, Havok and Puget entered the studio to record several songs that formed CexCells, their first album.[6] Puget kept fans apprised with updates through his blog, before the Blaqk Audio MySpace[1] was created in February 2007 (he announced on July 27 that they had finished filming the video for their debut single &quot;Stiff Kittens&quot;, which has yet to be seen). Since then, both members of Blaqk Audio have posted several updates on their MySpace blog\n\n\nPLEASE COMMENT AND SUPPORT THIS TORRENT IS LEGIT\n\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nFUDGESOCIETY NOTE\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nI'm personally not a fan of Live albums, and greatest hits. Because it's honestly redundant. Why have more than what you need unless you're a die hard fan. And if you're a die hard fan of a band, you wouldn't be torrenting their music. You would be supporting and buying, which I still support for every band album I upload. I promote torrenting, seeing if the band is good, then going out and buying the album. In no way do I promote the soul use of my torrents without intent to buy the album. Don't ruin the internet for us, these torrents are just a way to see how a band sounds, and find any missing tracks that you might not have.\n\nThank you and please seed. The support of my torrents, will greatly increase the amount of uploading I do. More seeds, more torrents, more smileys! :D","torrent":{"xt":"urn:btih:993ae7ac64c6e7d8241dd965724417ced020e8da","amp;dn":"BLAQK+AUDIO+-+CEX+CELLS+%5BFUDGESOCIETY%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"993ae7ac64c6e7d8241dd965724417ced020e8da","infoHashBuffer":{"type":"Buffer","data":[153,58,231,172,100,198,231,216,36,29,217,101,114,68,23,206,208,32,232,218]},"announce":[],"urlList":[]}}