{"title":"BBC - Folk America, 2009, Music History, Complete, XviD","uid":4810070,"size":1484288000,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:99dffac071d1f3202dda3ef60468c147ae7f0910&amp;dn=BBC+-+Folk+America%2C+2009%2C+Music+History%2C+Complete%2C+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MartinBLCK","files":3,"time":1238346363,"description":"Folk America - Part 1 (BBC4 - 23 January 2009)\n1/3 - Birth of a Nation\n\nThree-part documentary series on American folk music, tracing its history from the recording boom of the 1920s to the folk revival of the 1960s.\nThe opening part looks at how, in the 1920s, record companies scoured the American south for talent to sell. This was a golden age of American music, as the likes of the Carter Family, Jimmie Rodgers, Blind Lemon Jefferson, Charlie Poole, Dock Boggs and Mississippi John Hurt burst onto record, eager to have a share in the new industry and the money it made, only tolapse into obscurity when the depression hit at the start of the 30s. Contributors include Judy Collins, Steve Earle, Tom Paxton and Pete Seeger, surviving relations of 1920s greats such as Mississippi John Hurt, the Carter Family and Uncle Dave Macon, plus three actual survivors of the era - guitarist Slim Bryant, banjoist Wade Mainer and Delta \nbluesman 'Honeyboy' Edwards.\n\nFolk America - Part 2\n2/3 - This Land is Your Land\n\nThree-part documentary series on American folk music, tracing its history from the recording boom of the 1920s to the folk revival of the 1960s. In the depression of the 1930s, John Lomax found convicted murderer Leadbelly in a southern jail. Leadbelly's music was never quite as pure and untouched by pop as Lomax believed, but it set a new agenda for folk music, redefining it as the voice of protest, the voice of the outsider and the oppressed.Dustbowl drifter Woody Guthrie fitted the mould perfectly and the two of them teamed up with Lomax's son Alan, Pete Seeger and Josh White - a group of friends who believed 'they could make a better world if they all got together and just sang about it'. Their songs and their radical \npolitics took them to high places of influence, but brought about their downfall in the blacklisting 1950s. Contributors include Pete Seeger, Rambling Jack Elliot, Anna Lomax, Tom Paxton, Roger McGuinn, Woody Guthrie's sister and daughter and Josh White's son.\n\nFolk America - Part 3\n3/3 - Blowin' in the Wind\n\nThe final part of the series covers what you might have thought the whole thing would be about: the folk explosion of the 1960s. It's the very roots of that decade's counterculture, as freewheeling gatherings in New York and the emergence of Bob Dylan, Judy Collins and Joan Baez overlapped with Civil Rights protests and the aftermath of McCarthyism. The new movement also embraced the old blues singers who featured earlier in this series. But folk's traditional sound couldn't survive: soon, Dylan went electric and the Byrds pioneered folk rock. Queen of \nthe anecdotes here is Michelle Phillips of the Mamas and the Papas, who recalls how she first took LSD, first heard the Beatles and first met Mama Cass, all in one night.\n\n----------------------------------------\n\nMore stuff here:   &lt;a href=&quot;\nhttp://thepiratebay.se/user/MartinBLCK/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/MartinBLCK/&lt;/a&gt;","torrent":{"xt":"urn:btih:99dffac071d1f3202dda3ef60468c147ae7f0910","amp;dn":"BBC+-+Folk+America%2C+2009%2C+Music+History%2C+Complete%2C+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99dffac071d1f3202dda3ef60468c147ae7f0910","infoHashBuffer":{"type":"Buffer","data":[153,223,250,192,113,209,243,32,45,218,62,246,4,104,193,71,174,127,9,16]},"announce":[],"urlList":[]}}