{"title":"What We Could Have Done With the Money - (Malestrom)","uid":4864088,"size":2037895,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99edda40e35c944dcfcf908e220af7565e8b956a&amp;dn=What+We+Could+Have+Done+With+the+Money+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1240388373,"description":" &lt;a href=&quot;http://www.image-upload.net/images/r3z4idh4zu872lfooxlu.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/r3z4idh4zu872lfooxlu.jpeg&lt;/a&gt;\n\nRob Simpson - What We Could Have Done With the Money:\n50 Ways to Spend the Trillion Dollars We've Spent on Iraq\nHyperion | 2008 | ISBN: 1401323081 | Pages: 128 | PDF \n\nThe war in Iraq is not only controversial, it's also astronomically expensive. Now Rob Simpson answers the question many concerned Americans have been asking: Wasn't there some other way the government could have spent one trillion of our tax dollars?\n\nWhat We Could Have Done with the Money presents 50 thought-provoking spending alternatives. With a trillion dollars, we could . . .\n\n* Fix Social Security right now: Stop worrying. Stop debating. It's done. Over. Fixed.\n* End homelessness in America: House 15 million homeless families, get a million kids out of foster care, and have change to spare!\n* Give everyone in the world satellite TV: Can we have the revolution later? I'm watching CSI right now.\n* Pay everyone in Iraq to be nice to each other: Hey! If someone tripled your salary for the next 20 years, wouldn't you behave?\n* Go Green: Give 100 million car buyers a $10,000 subsidy on their hybrid.\n* Or gold . . . : Pave every highway in America with gold leaf.\n* Play ball! : Fly everyone in Iraq to America, put them up in a nice hotel for three days with all the extras, take them to a baseball game and fly them home . . . and have a lot leftover.\n* Cure cancer: Double research spending for as long as it takes.\n\n. . . not to mention paying all credit card debt, buying everyone in the world an iPod, building 75 million solar-powered homes, and 39 other revealing pipe dreams.\n\nShocking, thought-provoking, and incredibly entertaining, Simpson takes a hard look at the government's top priorities--both what they are and what they should be.","torrent":{"xt":"urn:btih:99edda40e35c944dcfcf908e220af7565e8b956a","amp;dn":"What+We+Could+Have+Done+With+the+Money+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99edda40e35c944dcfcf908e220af7565e8b956a","infoHashBuffer":{"type":"Buffer","data":[153,237,218,64,227,92,148,77,207,207,144,142,34,10,247,86,94,139,149,106]},"announce":[],"urlList":[]}}