{"title":"The Novelist","uid":9359702,"size":740881959,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9a2818aa1ea4de58c02db79507df524c7cd6ef77&amp;dn=The+Novelist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":39,"time":1387289135,"description":"The Novelist asks one central question: can you achieve your dreams without pushing away the people you love? The game focuses on Dan Kaplan, a novelist struggling to write the most important book of his career while trying to be the best husband and father he can be. The Kaplans have come to a remote coastal home for the summer, unaware that they're sharing the house with a mysterious ghostly presence: you. \n\n Read the family's thoughts. Explore their memories. Uncover their desires and intervene in their lives. But stay out of sight; you can't help the Kaplans if they know there's a ghost in the house. It's up to you to decide how Dan's career and family life will evolve, but choose carefully; there are no easy answers, and every choice has a cost. \n\n Dan's relationships - to his work, his wife, and his son - react and shift in response to your choices. With a different sequence of events in every playthrough, The Novelist gives life to a unique experience each time you play. \n\n The decisions you make will define the Kaplan's lives, but they may also tell you something about yourself. \n\n\n Game Features: \n\n * A dynamic narrative, with character relationships and story developments that react to the player's decisions. \n\n * The ability to read the characters innermost thoughts, explore their memories, and learn about their lives. \n\n * Tense first-person stealth gameplay, as the player tries to remain undetected while shaping Dan Kaplan's life. \n\n * An atmospheric, procedurally-generated piano score that's different with every playthrough. \n\n\n ----------------------------------------------------------------- \n\n Install NFO: \n\n 1. No install needed. Just open the folder and run The Novelist.exe file. \n\n 2. Play and enjoy. \n\nA quote from the developer's bio.......\n\n\n\nQuote:\n\nAfter more than a decade working on AAA games like Deus Ex: Invisible War and BioShock 2, Kent Hudson grew creatively restless. So in October 2011, without a specific game idea or a plan beyond trying to make something he believed in, he quit his job and started working on a game in his apartment. The Novelist is the result of his foray into independent development. \n\n\n\n -------------------------------------------------------------------------------------------------------\n -------------------------------------------------------------------------------------------------------\n\n A few reviews from the critics.......\n\n\nRock Paper Shotgun wrote:\n\nThe Novelist affected me, deeply and painfully ... I frequently cried at the outcomes of the decisions I made for the Kaplan family. \n\n\n\n\nPolygon wrote:\n\nSincere, realistic writing and an inspired approach to player choice \n\n\n\n\nGameSpot wrote:\n\nA gripping game that causes you to reflect \n\n\n\n\nGame Informer wrote:\n\nAny experience that forms this kind of connection with the player is worth your consideration \n\n\n\n\nIndie Statik wrote:\n\nIt's a beautiful, if brief, game about what's really important in life, mixed in with a bit of suspense to keep you hooked. But I'd be lying if I said it didn't sock me right in the gut from its opening moments until the bitterly ironic end. \n\n\n\n\nPixelvolt wrote:\n\nTurns conventional gaming on its head -- 9/10 \n\n\n\n\nIndieGames.com wrote:\n\nPacks a powerful emotional punch \n\n\n\n\nGameGrin wrote:\n\nThe Novelist is the most personal and beautiful game I have ever experienced. The creator, Kent Hudson, has quite plainly poured his heart and soul into this game, and the outcome is genuinely something to behold. Never before have I felt so emotionally involved in the characters, their situation and potential future, as in this truly player-driven story. -- 10/10 \n\n\n\n\nSidequesting wrote:\n\nThe Novelist makes each choice matter -- 4.5/5 \n\n\n\n\nPC.MMGN.com wrote:\n\nThe Novelist is a wonderfully emotional, soul-enriching experience. Hudson might not have been a household name before, but he deserves to be for The Novelist. \n\n\n\n\nHardcore Gamer wrote:\n\nEmpathizing with a game is odd, but it is where this one shines brightest. The Novelist stirs up feelings. \n\n\n\n\nJayisGames wrote:\n\nAn engrossing and moving experience \n\n\n\n\nNJoystic wrote:\n\nFor better or worse, the Kaplan's future was the one I had earned through the decisions I had made. It was a wonderful feeling. \n\n\n\n -------------------------------------------------------------------------------------------------------\n\n=========================================================================\n\n\n Minimum System Requirements:\n\n * OS: Windows XP SP2 or higher\n\n * Processor: 1.8 GHz\n\n * Memory: 2 GB RAM\n\n * Graphics: 256 MB VRAM video card\n\n * Hard Drive: 800 MB available space\n\n\n Recommended System Requirements:\n\n * OS: Windows 7\n\n * Processor: 2 GHz\n\n * Memory: 4 GB RAM\n\n * Graphics: 512 MB VRAM video card\n\n\n =========================================================================","torrent":{"xt":"urn:btih:9a2818aa1ea4de58c02db79507df524c7cd6ef77","amp;dn":"The+Novelist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a2818aa1ea4de58c02db79507df524c7cd6ef77","infoHashBuffer":{"type":"Buffer","data":[154,40,24,170,30,164,222,88,192,45,183,149,7,223,82,76,124,214,239,119]},"announce":[],"urlList":[]}}