{"title":"ULTIMATE.Wii.SoftMod.Kit.4.2.REPACK-IMoTeP","uid":5423959,"size":37376495,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:9a36bf6492737e886052e1b63038cfc3ee0ece36&amp;dn=ULTIMATE.Wii.SoftMod.Kit.4.2.REPACK-IMoTeP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lordimotep","files":4,"time":1268178680,"description":"                                                                                                                        \n                                                                                                                        \n                                                                                                                        \n                ttRRtt  ZZZZZZ&quot;&quot;    RRZZRR;;                ZZZZZZZZZZZZZZkk              RRZZZZZZZZJJ                  \n                kkMMJJ  MMMMMMww  ;;MMMMMM&quot;&quot;                MMMMMMMMMMMMMMRR              MMMMMMMMMMMMkk                \n                JJMMJJ  MMMMMMMM  JJMMMMMM&quot;&quot;      JJJJ            MMMM        ttkk&quot;&quot;      MMMM    &quot;&quot;MMMM                \n                JJMMJJ  MMMMMMMM  ZZMMMMMM&quot;&quot;  JJMMMMMMMMJJ        MMMM      MMMMMMMMZZ    MMMM      MMMM                \n                JJMMJJ  MMMMwwMM;;MMMMZZMM;;  MMMM;;;;MMMM        MMMM    wwMMww  RRMMtt  MMMMJJkkRRMMMM                \n                JJMMJJ  MMMMttMMkkMMwwZZMM;;JJMMkk    kkMMJJ      MMMM    MMMM&quot;&quot;;;JJMMww  MMMMMMMMMMMM;;                \n                JJMMJJ  MMMM  MMMMMMJJZZMM;;JJMMkk    kkMMJJ      MMMM    MMMMMMMMMMMMww  MMMM;;&quot;&quot;;;                    \n                JJMMJJ  MMMM  MMMMMM;;ZZMM;;&quot;&quot;MMRR    RRMM&quot;&quot;      MMMM    RRMM    ttkk;;  MMMM                          \n                kkMMJJ  MMMM  ZZMMMM  ZZMM&quot;&quot;  MMMMMMMMMMRR        MMMM    &quot;&quot;MMMMZZMMMM    MMMM                          \n                ttRRtt  ZZRR  ttZZZZ  kkRR;;    wwMMMMww          RRZZ      ttRRMMRR;;    RRZZ                          \n\n\n                                               Proudly Presents:\n\n\n                                   ULTIMATE.Wii.SoftMod.Kit.4.2.REPACK-IMoTeP\n   \n                                              (8 march 2010)\n  \n\n                                              \n                                                ------------- \n                                                    NOTES\n                                                ------------- \n\n\nMy last release was a hit apparantly. Afterwards a lot of my friends started asking me to help\nthem mod their wii. My previous release told you how to upgrade firmwares 3.0 to 4.1, thisone\nwill help you hack 4.2 (It got tested on a European 4.2E, but should also work on 4.2U and 4.2J)\n\nExactly like my previous release, this will convert an untouched wii to one that can load\nbackup games from an external hard disk. That's the final goal.\n\nYou need to have a SD card (doesn't matter how big) and a SD Card reader/writer in your PC or laptop.\n\nMake sure the SD card is empty to begin with and unpack FirstSD.rar onto it.\nPut the SD card in the wii and start it. \nPress A to continue to the wii-menu\nIn the lower left corner, next to &quot;Wii&quot;, there's a little SD Card you can click on, do it.\nIt will ask you if you want to load boot.dol, say yes\nA message will appear saying you shoudn't pay for the software, be patient and wait 8 secs\nPress 1 to continue\n\nNow you can install The Homebrew Channel installer, DVDx and Bootmii.\nYou won't need help to install the Homebrew Channel or DVDx, as it's too easy\nNext click &quot;Bootmii....&quot;, then &quot;Install Bootmii as ios&quot;\nWhen done go to exit.\nTake out the SD Card\nAfterwards reboot your wii and you should have another icon that says 'The Homebrew Channel'\n\n[if you want to do a NAND backup this is a good time. If you don't know how you can just\ngoogle it very easy. A NAND backup will backup your wii's structure to a SD card so it can\nlater be restored in case anything happens. This step is not necessary and you can just\ncontinue this hack without doing it, altough most people recommend it]\n\nPut the SD Card back in your pc.\nDelete all files on it and extract SecondSD.rar onto it.\nPut it back in your wii, go into the homenbrew channel and press the 'home' button on the remote\nYou should have an option there to start bootmii\nA menu should load called WAD manager. \nPress A to continue and choose 'wii SD slot', A to continue\nIt should already say IOS249.WAD, A to continue\nmove arrow to the right and change option to UNINSTALL WAD, A to continue\nIt should say 4x OK and any key to continue\nPress the home button to leave the program\n\nYou can take the SD card out of the wii again and put it back in your pc.\nDelete all files on it and extract ThirdSD.rar onto it.\nAgain go to the homebrew channel, press home and launch bootmii\nA new installer will automatically load. \nIn the first screen IOS36 is already selected, this you need, so A to continue\nAfterwards the next option to choose is WAD install, this also what you need, so just A to continue\nSo it's actually just next next next\nWhen done it will say finished succesful and will reboot the wii\n\nYou can take the SD card out of the wii again and put it back in your pc.\nDelete all files on it and extract Last.rar onto it.\nPut the SD card in the wii.\nGo to the homebrew channel, start it, and there should be &quot;Configurable USB loader&quot;\n\nNormally you can now launch &quot;Configurable USB loader&quot; and play any game from usb you like, but you first need to prepare\nthe USB device. \n\nSo get a USB stick of over 4GB or an external USB hard disk and connect it to your PC.\nFormat it completely using FAT32 filesystem. If windows doesn't allow this use Partition Magic 8.0 to format your external hard disk to it.\nFor USB sticks there's a tool called HP usb format tool or something.\n\nRemember the drive letter the new formatted USB device got. \nGo to the Software folder that came with this kit and find &quot;WBFS Wii FileSystem for Windows&quot;. \nRun it, specify the drive letter your usb device is on. Format it to WBFS.\nAfterwards choose option &quot;01. Add&quot; to start adding .iso files. After all this is done reconnect the\nusb device to the lower USB port of your wii. \n\nLaunch &quot;Configurable USB loader&quot; and play the iso-game directly from USB..... ALL DONE !!\n\nFor details on installing new super mario bros see the snmb folder :)\n\n\nREPACK: The very first release had errors in the manual\n\n                                                ------------- \n                                                  Greetings\n                                                ------------- \n\n                 I wish ALL other release groups the very best. &quot;Scene&quot; or not, who cares anyway?","torrent":{"xt":"urn:btih:9a36bf6492737e886052e1b63038cfc3ee0ece36","amp;dn":"ULTIMATE.Wii.SoftMod.Kit.4.2.REPACK-IMoTeP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a36bf6492737e886052e1b63038cfc3ee0ece36","infoHashBuffer":{"type":"Buffer","data":[154,54,191,100,146,115,126,136,96,82,225,182,48,56,207,195,238,14,206,54]},"announce":[],"urlList":[]}}