{"title":"KCHESS ELITE CHESS GAME - PC","uid":3922003,"size":2566144,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9a945191a61898146d2fe5067dd1cd3a7728a54a&amp;dn=KCHESS+ELITE+CHESS+GAME+-+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asimpleson","files":1,"time":1196873567,"description":"KChess Elite is our most powerful chess program, allowing you to take complete control of your chess game. It is ideal for casual players, children learning to play chess, and anyone wanting to improve their game. \n\nKChess Elite has lots of features to help you play better chess. See the pieces that have been taken, where pieces can move, who can take what, which move the computer recommends, the name of the opening (from the Encyclopaedia of Chess Openings), a narration about the relative strength and position of both players, whether checkmate is inevitable, and more. An arrow highlights the last move so you can see clearly what has happened. Set the board to a specific layout, rotate it, enlarge it, change the set of pieces, and even add your own comments to a game. Click here for a full size picture. \n\nOther information available is hints for beginners, glossary of chess terms and tactics, tip of the day, the rules of chess, and helpful information about children and chess. \n\nUnlimited undo and redo, move hinting and replay, and the ability to set up multiple variation boards gives you complete control of the game and allows alternate strategies to be explored. Print board layouts, game details and move lists using a choice of 20 chess figurine fonts. Open and save games in multiple formats, including the internationally recognised PGN, FEN and EPD formats. \n\nBoard layouts can be saved in BMP, GIF, JPEG and PNG formats. Whole games can be saved to HTML as a web page, including any number of board layouts. \n\nKChess Elite can play with two players, one player against the computer (black or white), or the computer against itself. Choose from a variety of time restrictions, or none at all. Change the playing strength to suit yourself. There are dozens of options to customise the appearance and operation of the game. \n\nThere is full keyboard and mouse control, and an easy to use button bar. Special features make the program particularly good for blind or visually impaired players. Voice feedback can be male or female. There is extensive help, including a comprehensive glossary and the rules of chess. All versions of KChess Elite since version 2 have gained five star ratings from both Ziff Davis and C/Net. \n\nKChess Elite is also suited for use with screen reader software for the blind or visually impaired.\n\nwin9x, NT2K, XP\t\t","torrent":{"xt":"urn:btih:9a945191a61898146d2fe5067dd1cd3a7728a54a","amp;dn":"KCHESS+ELITE+CHESS+GAME+-+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a945191a61898146d2fe5067dd1cd3a7728a54a","infoHashBuffer":{"type":"Buffer","data":[154,148,81,145,166,24,152,20,109,47,229,6,125,209,205,58,119,40,165,74]},"announce":[],"urlList":[]}}