{"title":"The Necronomicon - AncientBlackMagic.com","uid":5430357,"size":1501997,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9aba27ee9ae1a61e9731f15a56b63c5d2abdeb63&amp;dn=The+Necronomicon+-+AncientBlackMagic.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LordSidonus","files":-1,"time":1268391814,"description":"This is a rather interesting e-book that I thought I'd upload for you, it is the acclaimed Necronomicon, or &quot;The Book of Dead Names&quot;.\n\nIf you are familiar with occult work, then you are most likely familiar with this name and its author H P Lovecraft, I shall give a brief description on this book and what it's about, this description is straight from ancientblackmagic.com\n\n&quot;Necronomicon-Within the last few decades, whispers have been going around on whether there actually was a real Necronomicon, the book of the dead other than Lovecrafts mythos, in existence. Many different versions of the Necronomicon have been released throughout the years such as the Necronomicon edited by George Hay, H.R. Giger's Necronomicon and most recently Necronomicon: The Wanderings Of Alhazred by Donald tyson. Debate has been exploding though the decades on whether any of them are really magickal grimoires or all copied from Lovecrafts myth. Many ignorant people even within the magick community have went about to condemn every one of these books without ever trying them out as a magical book,such as the Goetia.\n\nI have gone through every single one of the Necronomicons written above and many not listed which were written in other languages such as arabic and hebrew and also greek.I have personally read through these ancient versions of the true Necronomicon and have come to one final verdict. Every one of the Necronomicon that is commercially written are all works of fiction .Everyone except for only one. That one true book is the Simon Necronomicon.\n\nThe book of the dead by Simon does have its flaws; actually No they aren't flaws, they are actually Blinds built into the system by a responsible man who was torn between sharing the secret with everyone and giving to the public, something so dangerous that it could destroy one's life if used without caution. These blinds ensure that people can use the Necronomicon relatively safely and ensures that a competent user of Magick will be able to slowly uncover these blinds, the more they use the system. The entities in the system are real and ancient and the ancient ones can definitely do some irreversible damage if played around with carelessly, so I definitely advise caution.\n\nThat being said, I do sincerely hope that anyone wanting to use the Necronomicon starts out with at least a year to sharpen your astral senses through meditation, learn skrying , practice astral projection and cleanse yourself physically mentally and spiritually before you attempt any work with the book of the dead, The Necronomicon.&quot;\n\nIf you have any requests, feel free to email me at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;8ee2e1fceafde7eae1e0fbfdcee6e1fae3efe7e2a0ede1e3&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; and in the subject bar put thepiratebay, I bid thee all adieu.","torrent":{"xt":"urn:btih:9aba27ee9ae1a61e9731f15a56b63c5d2abdeb63","amp;dn":"The+Necronomicon+-+AncientBlackMagic.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9aba27ee9ae1a61e9731f15a56b63c5d2abdeb63","infoHashBuffer":{"type":"Buffer","data":[154,186,39,238,154,225,166,30,151,49,241,90,86,182,60,93,42,189,235,99]},"announce":[],"urlList":[]}}