{"title":"SmartDraw 2010.11","uid":5395030,"size":24446555,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9c388b6834ab23abfd0fdf18dca407674a5b5ff7&amp;dn=SmartDraw+2010.11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kadynwholdi","files":3,"time":1267202336,"description":"SmartDraw - The World's Most Popular Business Graphics software. Create professional-looking business graphics in minutes. No experience needed! SmartDraw's point-and-click drawing method makes it easy for anyone familiar with basic computer tasks to easily create professional-quality business graphics. SmartDraw lets you create the professional flowcharts, floor plans, org charts, technical diagrams, or calendars using our easy to use SmartTemplates. Plus, SmartDraw works hand in hand with Word, PowerPoint, Excel, and other tools. SmartDraw features dramatically improved graphics capability, with professionally designed gradients, textures, effects, styles, and themes. SmartDraw is software that helps you work smarter by communicating visually. Whether it's a flowchart to explain a business process, a Gantt chart to show a project schedule, or an organization chart, SmartDraw is unique because it draws more than 40 different types of visuals for you, including timelines, maps, charts, decision trees and floor plans.\n\nWith SmartDraw, anyone can create presentation-quality visuals in minutes. Because people are six times more likely to retain and understand information presented to them visually, SmartDraw helps millions of businesses increase their bottom line by improving communication, refining operations, completing projects on time, and successfully implementing their plans.","torrent":{"xt":"urn:btih:9c388b6834ab23abfd0fdf18dca407674a5b5ff7","amp;dn":"SmartDraw+2010.11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c388b6834ab23abfd0fdf18dca407674a5b5ff7","infoHashBuffer":{"type":"Buffer","data":[156,56,139,104,52,171,35,171,253,15,223,24,220,164,7,103,74,91,95,247]},"announce":[],"urlList":[]}}