{"title":"ABFOutlook Express Backup v 2.7.5.","uid":5153367,"size":3676932,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9c67055d3bf993f2a9bff0360627dfd9627de7f2&amp;dn=ABFOutlook+Express+Backup+v+2.7.5.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BLACKTROY","files":1,"time":1257702730,"description":"ABF Outlook Express Backup is a backup and synchronization tool for Outlook Express mail client. The program allows you to backup and restore email messages, address book contacts, mail and news accounts, message rules, blocked senders lists, signatures, stationeries and even your Internet Explorer favorites. \n\n\nAll Outlook Express data are stored in one backup file which can be password protected. You can choose an identity to backup or restore your data. If you want to restore into new identity you can create it directly from the program. All backup functions can be processed either separately or together.\n\nYou can use ABF Outlook Express Backup to synchronize Outlook Express between several computers. All what you need is to backup Outlook Express on one computer and restore to another one. Moreover, synchronization can be made automatically with Task Builder feature!\n\nABF Outlook Express Backup has easy to use multilingual interface, very useful for beginners. Click here to see screenshot \n\nABF Outlook Express Backup enables you to: \nbackup and restore email messages and other data in a few clicks \ntransfer Outlook Express between computers \nautomatically and periodically backup using Task Builder \nsynchronize Outlook Express between several computers, users or operating systems \ncreate self-extracting backup file, very useful when moving Outlook Express to the new computer \ncreate new identity directly from the program and restore the data into it \nprotect backup file with a password to keep you data safe ","torrent":{"xt":"urn:btih:9c67055d3bf993f2a9bff0360627dfd9627de7f2","amp;dn":"ABFOutlook+Express+Backup+v+2.7.5.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c67055d3bf993f2a9bff0360627dfd9627de7f2","infoHashBuffer":{"type":"Buffer","data":[156,103,5,93,59,249,147,242,169,191,240,54,6,39,223,217,98,125,231,242]},"announce":[],"urlList":[]}}