{"title":"mIRC v7.44","uid":15419989,"size":2740536,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9d428715d27ef431a97af5272bbdf69eb19a169b&amp;dn=mIRC+v7.44&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LxByte","files":1,"time":1469625548,"description":"mIRC v7.44\r\n\r\nThis is a small update that addresses a number of issues reported by users since the last release. It includes improvements, changes and fixes to a number of features, including:\r\n\r\nUpdated to OpenSSL 1.0.2g, PCRE 8.38, and TagLib 1.11 libraries.\r\nExtended $regex() to allow unlimited backreferences.\r\nUpdated all file dialogs, including the send file dialog, to use modern file dialogs.\r\nUpdated to NSIS 2.50 installer and related plugins.\r\nFixed mode +q event being processed as on OWNER/DEOWNER event on networks that use +q as a channel mode.\r\nFixed if/while bracket parsing bug that caused mIRC to freeze with a certain combination of separators and brackets.\r\nAdded check for servers that include MONITOR in numeric 005 but do not actually support it. mIRC reverts back to ISON in this case.\r\nAdded &quot;Certficate&quot; menu item to status window system menu that allows viewing of the SSL certificate for an SSL connection.\r\nAdded $regmlex(name,M,N) that returns array of matches in the case of a /g global match.\r\nExtended $url to work with browsers that do not support DDE, like Microsoft Edge and Google Chrome.\r\nUpdated $os and manifest files for Windows 10 compatibility.\r\nAdded support for extended numeric 338 reply with IPv6 address.\r\nAdded /sockopen -46 switches to specify the IPv4/IPv6 context when resolving named addresses.\r\nChanged /server to base its IPv4/IPv6 context on the IP address if one is used.\r\nFixed $msgtags not being reset immediately after an event.\r\nFixed $eval() bug that caused over-evaluation in some cases.\r\nFixed log view dialog file size bug with large log files.\r\nExtended $com() to allow passing parameters in from and results out to binary variables.\r\nUpdated code signing certificate to SHA-256. Binaries are now dual code-signed with SHA-1 and SHA-256.\r\nOther changes and bug fixes. \r\n\r\nIn total there have been around 50 changes since the last release and although most of them are only small fixes and tweaks, we hope that they result in a more useful and stable mIRC for you.\r\n\r\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\r\n\r\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, IPv6, SSL encryption, proxy support, UTF-8 display, UPnP, customizable sounds, spoken messages, tray notifications, message logging, and more.\r\n\r\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\r\n\r\nmIRC has been in development for over two decades and is constantly being improved and updated with new technologies. The most recent changes can be found on the latest news page\r\n\r\nOfficial Website: http://www.mirc.com/","torrent":{"xt":"urn:btih:9d428715d27ef431a97af5272bbdf69eb19a169b","amp;dn":"mIRC+v7.44","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d428715d27ef431a97af5272bbdf69eb19a169b","infoHashBuffer":{"type":"Buffer","data":[157,66,135,21,210,126,244,49,169,122,245,39,43,189,246,158,177,154,22,155]},"announce":[],"urlList":[]}}