{"title":"Planetbase version 1.06 repack Mr DJ","uid":12739665,"size":265277230,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9d905b0f6622f398c791fcf0c46a13f869739cec&amp;dn=Planetbase+version+1.06+repack+Mr+DJ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rock840","files":2,"time":1447223476,"description":"Title: Planetbase\r\n Genre: Indie, Simulation, Strategy\r\n Developer: Madruga Works\r\n Publisher: Madruga Works \r\n Release Date: 15 Oct, 2015\r\n Crack based on : 3DM ;\r\n\r\nAbout This Game\r\n\r\nPlanetbase is a strategy game where you guide a group of space settlers trying to establish an outpost on a remote planet.\r\n\r\nIn the game you play the role of the base architect and manager, telling your colonists where to build the structures they will need to survive. You will have to ensure that they have a constant supply of oxygen, food and water to stay alive.\r\n\r\nYou will get them to collect energy, extract water, mine metal, grow food, manufacture bots, and build a fully self-sufficient base.\r\n\r\nEven if the game is not intended to be a simulator, all the mechanics are plausible, and based on what the expected challenges of establishing a colony in an new planet would be.\r\n\r\nSystem Requirements\r\n\r\n Minimum:\r\n OS: Windows Vista/7/8/10\r\n Processor: 2 GHz Dual Core\r\n Memory: 2 GB RAM\r\n Graphics: 512 MB VRAM (Shader Model 3)\r\n DirectX: Version 9.0c\r\n Hard Drive: 550 MB available space \r\n\r\nChangelog:\r\n\r\nNEW FEATURE \r\n - Now the game can load third party translations from Documents/Planetbase/Strings \r\n\r\nGAMEPLAY CHANGES \r\n - Trading Ships now have a maximum cargo capacity, and can't trade if they are over it (60 for small ships, 120 for the large ones) \r\n - You can now set buildings in construction as high priority to make the AI take care of them first \r\n - Wind Turbines now decay a bit slower (55 min now, from 45 min before) \r\n\r\nAI TWEAKS \r\n - Reduced the amount of people taking resources to traders \r\n - Engineers and Constructor Bots are now very likely to build connections after building structures \r\n - Biologists will tend to maintain more damaged Vegetable Pads first \r\n\r\nUI IMPROVEMENTS \r\n - Certain panels (Landing Permissions, Security Controls...) are now accessible from the info panel after selecting certain structures \r\n - Stats window now displays how many guards are armed \r\n\r\nFIXES \r\n - If you have a Starport and delete the Landing Pad, you can still build more Starports and access the Landing Permissions \r\n - Fixed engineers getting confused when an unconnected interior structure got damaged \r\n - Fixed pathing issues due to rocks blocking areas near airlocks \r\n - Fixed colonists taking guns to the armory even if it was full \r\n - Fixed issue with preventing colonists from arriving to the base when loading a game with a solar flare in progress in planet1on 1.0.4 \r\n - Stability fixes\r\n\r\nNote: Save games from previous repacks which are based on ALI213 cracks may not be compatible with this repack , i'll upload ALI213 based repack when i found ALI213's crack ....\r\n\r\n**INSTALL INSTRUCTIONS:\r\n\r\nOpen Planetbase v1.06.exe , wait for a bit for the self extractor to open, specify the directory where u want to extract the game folder, open the extracted folder and play.....\r\n OR\r\nExtarct it yourself using 'WinRAR'\r\n\r\nAlways open the game using run as administrator\r\n\r\nCheck my FB page for more :\r\nMr DJ repacks","torrent":{"xt":"urn:btih:9d905b0f6622f398c791fcf0c46a13f869739cec","amp;dn":"Planetbase+version+1.06+repack+Mr+DJ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d905b0f6622f398c791fcf0c46a13f869739cec","infoHashBuffer":{"type":"Buffer","data":[157,144,91,15,102,34,243,152,199,145,252,240,196,106,19,248,105,115,156,236]},"announce":[],"urlList":[]}}