{"title":"Primus - Wynona's Big Brown Beaver (Xvid-2nafish)","uid":5961558,"size":110266680,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9d92d080bda926f3d1e59c03a3bddd45921dc88c&amp;dn=Primus+-+Wynona%5C%27s+Big+Brown+Beaver+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1289974302,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:26\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 3184 Kbps\nQuality Factor : 0.63 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Wynona's Big Brown Beaver&quot; is the first single off Primus's 1995 album Tales From the Punchbowl.\n\nThe band also filmed a music video for &quot;Wynona's Big Brown Beaver,&quot; centered on the band dressed as comical-looking, shiny latex-suited cowboys. The costumes bore a strong resemblance to those used in a popular Duracell advertising campaign at the time which featured a family of battery-powered, toy-like people (the Puttermans). In an interview, bandleader Les Claypool revealed the suits were intended to resemble &quot;cheap plastic cowboy action figures.&quot; The video jumps between shots of the band playing in a barn and of the band engaged in parodies of cowboy activities. The video also features some airbrushed drawings done by Claypool. The video's live action sequences were filmed at Claypool's home, known as Rancho Relaxo. The video marks the second video appearance of Les' red jazz bass.\n\nBecause the band's cowboy suits were so cumbersome, they played along to the track slowed down significantly to more easily coordinate their actions to the music. In the video, Tim Alexander's bass drum reads &quot;Buck Naked and the Bare Bottom Boy.&quot; This was meant as a tribute to Phillip Bury, who went under the name Buck. He was a close friend to the band, who had died in 1992. He was in the aforementioned Buck Naked and the Bare Bottom Boys. The video appeared on Primus' Tales from the Punchbowl [CD-ROM] album as well as 2003 EP/DVD release Animals Should Not Try to Act Like People, along with an in-depth making-of feature.\n\nThe song epitomizes Primus's musical eccentricities, whereby the group's signature funk metal stylings are comically inflected with a sound vaguely reminiscent of bluegrass and southern rock. During the song's guitar solos, Larry LaLonde's playing shifts from almost &quot;noise&quot; guitar in the first solo to a somewhat country-sounding technique and banjo-style finger-picking on the second (inspired by Jerry Garcia). The song's lyrics constitute an absurd, rambling tale about a woman named Wynona and her &quot;beaver.&quot; They combine an on-the-surface crude sexual double entendre in &quot;beaver&quot; with the more purely nonsensical silliness typical of the band (e.g., strange references to baboons, Taco Bell, carnies, and porcupines).\n\nTales from the Punchbowl is the fourth studio album by Primus, released on May 23, 1995. It is the band's last album with Tim Alexander before he rejoined Primus seven years later. Punchbowl was certified Gold on July 20, 1995.\n\nIn 1996 the album was re-released as an Enhanced CD for Macintosh and Windows. As printed on the back inlay for this version, &quot;Combining high end production values, 3-D graphics, spectacular effects and loads of insanely cool stuff, the 'Tales From The Punchbowl' Enhanced CD, played on a CD-ROM drive, sends the viewer through a surreal virtual experience that features the complete album in CD sound quality (which you can hear on a stereo CD player as well).&quot; Players must &quot;navigate from the helm of Captain Shiner's ferryboat through an enchanted liquid atmosphere to many strange and mysterious islands. Many experiences are to be had, all in a rose-colored waterworld filled with visuals reminiscent of DalÃƒÂ­ and Bosch.&quot; Printed on the actual CD is a ship helm instead of the large image of Captain Shiner's face that appeared on the original, more common pressing.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9d92d080bda926f3d1e59c03a3bddd45921dc88c","amp;dn":"Primus+-+Wynona%5C%27s+Big+Brown+Beaver+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d92d080bda926f3d1e59c03a3bddd45921dc88c","infoHashBuffer":{"type":"Buffer","data":[157,146,208,128,189,169,38,243,209,229,156,3,163,189,221,69,146,29,200,140]},"announce":[],"urlList":[]}}