{"title":"Kimya Dawson - I'm Sorry That Sometimes I'm Mean [FLAC]","uid":4965463,"size":246141229,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9d9c10a4f7eacbd762aeffacde44abe5d8b35a88&amp;dn=Kimya+Dawson+-+I%5C%27m+Sorry+That+Sometimes+I%5C%27m+Mean+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sixcrates","files":-1,"time":1245513057,"description":"One of the best albums by Kimya Dawson and the only one I could find in stores :)\n\n\nBiography (by Christina Saraceno, allmusic.com)\n\nSinger/songwriter Kimya Dawson is best known as part of the New York City anti-folk outfit the Moldy Peaches. In 2002 Dawson released her debut solo album, I'm Sorry That Sometimes I'm Mean, a collection of spare tunes sung to an acoustic guitar and Dawson's voice, which breaks with hurt over tales of abuse and longing.\n\nThe 30-year-old songwriter was born and raised in Bedford Hills, NY, where her parents run a day-care center from their home. Dawson and fellow Moldy Peach Adam Green met in 1995 at a record store in Mt. Kisco, NY, where she worked. For the next four years, Dawson moved back and forth between New York and Washington, but she and Green had become friends and began writing songs together. In 1999 Green followed Dawson to Washington, where they formed the Moldy Peaches. After a year, Green returned to New York, with Dawson following later. Eventually, the Moldy Peaches -- Dawson, Green, drummer Strictly Beats, bassist Steve Mertens, and guitarists Jack Dishel and Toby Goodshank -- began playing the anti-folk circuit. \n\n\nRip info\n\nRipped using EAC without errors, no AccurateRip info though - seems like I was the first one.","torrent":{"xt":"urn:btih:9d9c10a4f7eacbd762aeffacde44abe5d8b35a88","amp;dn":"Kimya+Dawson+-+I%5C%27m+Sorry+That+Sometimes+I%5C%27m+Mean+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d9c10a4f7eacbd762aeffacde44abe5d8b35a88","infoHashBuffer":{"type":"Buffer","data":[157,156,16,164,247,234,203,215,98,174,255,172,222,68,171,229,216,179,90,136]},"announce":[],"urlList":[]}}