{"title":"Mr. Bean pc","uid":5674576,"size":107923456,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9dd42a5c193f60bb19ebf82412caf1470a8a1454&amp;dn=Mr.+Bean+pc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"donald047","files":1,"time":1278471139,"description":"Mr. Bean | Genre: 3D Platformer | 103 Mb\nPublisher: Blast! Entertainment Ltd | Developer: Blast! Ent.|\n\n\nMr Bean is on his wackiest adventure yet -- and he inviting you along for the ride. Teddy's been kidnapped by a mysterious villain, and Mr Bean needs your help to find the ransom -- 1,000 cat biscuits! This action-packed comedy game is based on the smash hit animated TV series and stars all Mr Bean's famous friends and foes, including his beloved Irma Gobb and Scrapper, the mischievous moggy!\nGame Features:\n* 12 fun-packed levels full of cunning puzzles, crazy traps and wacky enemies.\n* Two players can play against each other in over 20 mini-games.\n* Unlock exclusive clips from the hilarious animated TV show!\nexciting minigames, some of which you can play against a friend in a two-player mode.\n* Use a pickaxe to search for hidden treasure in Mrs Wicket garden and test your speed in super-fast frantic play, catching frogs in the net.\n* Progress through the game collecting various objects and use them to help Mr Bean get out of the hilarious scrapes he gets himself into.\n* Take part in a fairground style shooting range and see how many points you can score Get behind the wheel of Mr Bean Mini or Irma three-wheeler and test your speed in the craziest race ever.\n* Explore the wacky world Blow up breakable walls, discover exciting maze areas, avoid piranha plants and dodge deadly trees.\n* Thrilling gameplay, absorbing activities, simple controls and hours of fun - all this and more in this fantastic new game on your PC.\n","torrent":{"xt":"urn:btih:9dd42a5c193f60bb19ebf82412caf1470a8a1454","amp;dn":"Mr.+Bean+pc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dd42a5c193f60bb19ebf82412caf1470a8a1454","infoHashBuffer":{"type":"Buffer","data":[157,212,42,92,25,63,96,187,25,235,248,36,18,202,241,71,10,138,20,84]},"announce":[],"urlList":[]}}