{"title":"Texas Series 1-4 (Complete) by Fern Michaels (Epub)","uid":10800466,"size":7783854,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9eee132443c078f346481be515bfca1aacdebb07&amp;dn=Texas+Series+1-4+%28Complete%29+by+Fern+Michaels+%28Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":4,"time":1408341487,"description":"Texas Rich: This is the captivating story of four generations of Colemans. There's Moss, living in his father's shadow; Jessica, the doomed mother; Moss and Billie's children, trying to live up to insurmountable expectations; and the grandchildren, heirs to a tarnished empire. Most of all this is the triumphant story of Billie Ames Coleman, who holds them all together.Texas Heat: The magnificent Austin empire now belongs to Moss and Billie's daughter Maggie. She has invited the whole family to a Fourth of July barbecue in celebration of a renewed sense of family pride. But as loved ones gather, they bring along old resentments and new temptations destined to generate more than a little heat.Texas Fury: For Amelia Coleman Assante, the last surviving child of a legendary tycoon, it is a time of transition. As her family's kingdom faces new challenges on the horizon, she starts a fateful journey that recalls a troubled past controlled by a father's iron will. Texas Sunrise: Billie Coleman Kingsley, beloved matriarch of the clan, is dying. As her family gathers together, the indomitable Billie offers new hope to heal the rifts that separate them. Even as her own strength fails, Billie instills courage, fortitude, and her conviction that life goes on after tragedy.","torrent":{"xt":"urn:btih:9eee132443c078f346481be515bfca1aacdebb07","amp;dn":"Texas+Series+1-4+%28Complete%29+by+Fern+Michaels+%28Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eee132443c078f346481be515bfca1aacdebb07","infoHashBuffer":{"type":"Buffer","data":[158,238,19,36,67,192,120,243,70,72,27,229,21,191,202,26,172,222,187,7]},"announce":[],"urlList":[]}}