{"title":"Abducted (1996) XXX DVDRip","uid":11832658,"size":1791275685,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9fa88bcbad8c19878a0fe0c939cb79c01c649286&amp;dn=Abducted+%281996%29+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"HighCode","files":6,"time":1429644559,"description":"Scene 1:  Tracey Love gets abducted by two guys and is put in this weird industrial looking room.   They start by putting her on a gyno chair and start kissing and eating her out while she wears only her panties.  Then some nice fingering quickly turns into a simultaneous blowjob and fuck scene.  Then they move into fingercuffs position, Tracey completely nude at this point.   She then moves ontop to a reverse anal cowgirl position on one of the guys, while the other is on his computer and takes notes.  Then they all participate again in a DP cowgirl.  The guys both finish on her face as she enjoys the facial.  Tracey then wakes up in her car, nude and covered in alien sperm, not knowing how she got there.\n\nScene 2: Alex Sanders and Steve Hatcher nab Julie Rage from outside and take her to the same room as scene one.   They start by aggressively undressing eachother.  They all strip down and start kissing and fingering Julie.  She then starts blowing Alex as Steve eats her out from behind, doggy style.  They change positions and Alex fucks her from behind while Steve takes the BJ.  They are all nude at this point.  They then flip her around and fuck her missionary while she takes a cock in her mouth while on her back.  Then cut to a doggy-style anal position, then to a DP cowgirl.   Then they both finish in her mouth.  She also wakes up outside covered in goo, but seems to be really enjoying it.\n\nScene 3: Alex Dane is sitting on her couch enjoying a book, when the door suddenly rings and she's abducted.  Taken to the same room, she's laid out on the gyno chair and fingered.  She quickly starts getting eaten out and sucking cock.  Then they all completley strip down and take her missionary as she still sucks cock.  They then move her into a finger-cuff doggy positoin, while she still sucks cock.  She then takes one of the dudes anally doggy style while he plays with her clit.  They flip her over and take her anally missionary as well, this time she plays with herself while taking it, and sucking more cock.  Then they both finish on her face and she can't get enough as she keeps sucking them off.   She then wakes up on her couch covered in alien semen, totally unaware of what happened.\n\nScene 4: This scene opens with Nikki Brantz giving head to her boyfriend in the car.  Two dudes come by and carjack her, leaving the boyfriend behind.  They take her to the same room and start stripping and kissing her.  She quickly takes a cock in hand and starts sucking while the other dude is eating her out and fingering her (with her panties still on).  She then gets on all fours on the chair and starts sucking on them both, really good and sloppy too.  She even takes them both and sword-fights in her mouth.  They then take her doggy while she continues to blow.  They flip her over for missionary, while she continues to blow.  Then one of the dudes gets her missionary anally.  Then it quickly cuts to a Reverse Anal Cowgirl DAP.  She sure is a trooper taking both dudes in her rear at the same time!  Then they both give her the final facial of the flick.\nShe then wakes up back in her car, covered in alien goo as well, and her boyfriend is out cold too.\n\nVHS-Rip:\n\nQuality: Good/Very Good\nFile Format: AVI\nVideo Codec: MPEG4 (DivX/Xvid compatible)\nFile Size: 1.66 GB\nFrame Size: 720 x 540\nData Bitrate:  2510 kbps\n\nFrame Rate: 29.97 fps\nAudio Codec: MP3\nSample Rate: 48000Hz 16 bit\nBitrate: 320 kps\n\nTotal Bitrate: 2830 kps\n\n  Screenshots:  &lt;a href=&quot;\nhttp://imgclover.com/image/IR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/IR&lt;/a&gt; &lt;a href=&quot;\nhttp://imgclover.com/image/IZ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/IZ&lt;/a&gt;","torrent":{"xt":"urn:btih:9fa88bcbad8c19878a0fe0c939cb79c01c649286","amp;dn":"Abducted+%281996%29+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fa88bcbad8c19878a0fe0c939cb79c01c649286","infoHashBuffer":{"type":"Buffer","data":[159,168,139,203,173,140,25,135,138,15,224,201,57,203,121,192,28,100,146,134]},"announce":[],"urlList":[]}}