{"title":"Legend Of Grimrock [GoG]","uid":8452693,"size":456306732,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a036a0d7cc26260036995dee251afd5126683cc4&amp;dn=Legend+Of+Grimrock+%5BGoG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GOG-Upp","files":1,"time":1368039282,"description":"REQUESTED BY -\n &lt;a href=&quot;\nhttp://www.gog.com/gamecard/legend_of_grimrock&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/gamecard/legend_of_grimrock&lt;/a&gt;\n\nWhat's cool about it:\nUse the Dungeon Editor to build entirely new adventures and challenges for other players to solve!\nExplore a vast network of ancient tunnels, discover secrets, and find a way to survive in the perilous dungeons of Mount Grimrock.\nCast spells with runes, craft potions with herbs, and fight murderous monsters with a wide variety of weapons.\nCreate a party of four characters and customize them with different races, classes, skills, and traits.\nPure-blooded dungeon crawling game with grid-based movement and thousands of squares, riddled with hidden switches, pressure plates, sliding walls, floating crystals, forgotten altars, trapdoors, and more.\nOverview:\nLegend of Grimrock is a dungeon crawling role playing game with an oldschool heart mated with modern execution. A group of prisoners are sentenced to certain death by exile to the secluded Mount Grimrock for vile crimes they may or may not have committed. Unbeknownst to the captives, the mountain is riddled with ancient tunnels, dungeons and tombs built by crumbled civilizations of days long past. If they ever wish to see daylight again and reclaim their freedom, the ragtag group of prisoners must form a team and descend through the mountain, level by level.\n\nThe game brings back an oldschool challenge with highly tactical real-time combat and grid-based movement, devious hidden switches and secrets as well as deadly traps and horrible monsters. Legend of Grimrock puts an emphasis on puzzles and exploration, and the wits and perception of the player are more important tools than even the sharpest of swords would be. And if you are a hardened dungeon crawling veteran and you crave an extra challenge, you can arm yourself with a stack of grid paper and turn on the Oldschool Mode, which disables the luxury of the automap! Are you ready for some classic dungeon-crawling first person perspective party-based RPG action? Are you ready to venture forth and unravel the mysteries of Mount Grimrock?\n\n-------------\n\nIF YOU HAVE ANY REQUESTS, PLEASE WRITE THEM IN COMMENTS, ENJOY AND DON'T FORGET TO SEED IT BACK.\n\nWAITING ON THE REQUEST LIST TO BE UPLOADED:\n\nFAR CRY\nFAR CRY 2: FORTUNE'S EDITION\nMEDAL OF HONOR: ALLIED ASSAULT WAR CHEST\t\nAlan Wake American Nightmare\nPsychonauts\nMoto Racer 1, 2\nGothic 3: Forsaken Gods Enhanced Edition\nGreat Battles Collector's Edition\nSilent Hunter 2\nPolice Quest 1-2-3-4\nPrince of Persia 2008\nLionheart: Legacy of the Crusade\nBeyond Divinity\nStonekeep\nDeus Ex 2: Invisible War\nDriftmoon\nSilver\nRunaway series\n\n--------------\nREQUESTS THAT I CAN'T FULFILL AT THE MOMENT\n\nLeisure Suit Larry Language Pack\nDon't Starve\nKing of Dragon Pass\nGalactic Civilizations I Ultimate Edition\nThe Cat Lady\nDYAD\nSword of the Stars: The Pit\nEtherlords 2\nBioforge\nAvernum: The Complete Saga\nRetro City Rampage\nOmerta: City of Gangsters\nEdna &amp; Harvey: TB + HE\n\n--------------\n\nIF POSSIBLE, DON'T FORGET TO SUPPORT THE COMPANIES AND GOG.COM FOR THEIR GREAT SERVICE.\n\n\n\n","torrent":{"xt":"urn:btih:a036a0d7cc26260036995dee251afd5126683cc4","amp;dn":"Legend+Of+Grimrock+%5BGoG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a036a0d7cc26260036995dee251afd5126683cc4","infoHashBuffer":{"type":"Buffer","data":[160,54,160,215,204,38,38,0,54,153,93,238,37,26,253,81,38,104,60,196]},"announce":[],"urlList":[]}}