{"title":"Classic Western Roundup-1 - Canyon Passage (1946) Xvid 1cd - Wes","uid":9177945,"size":733308928,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a077c3f2e12c614001485162fc63390126ef835d&amp;dn=Classic+Western+Roundup-1+-+Canyon+Passage+%281946%29+Xvid+1cd+-+Wes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1384185753,"description":"Classic Western Roundup-1 - Canyon Passage (1946) Xvid 1cd - Western [DDR]\n\nCanyon Passage is a 1946 Western film directed by Jacques Tourneur and set in frontier Oregon.[2] Featuring love triangles and a Native American uprising, it was adapted from the Saturday Evening Post novel Canyon Passage by Ernest Haycox. Hoagy Carmichael (music) and Jack Brooks (lyrics) were nominated for Academy Award for Best Original Song for &quot;Ole Buttermilk Sky&quot;.\nContents\n\n    CAST:-\n    Dana Andrews as Logan Stuart\n    Brian Donlevy as George Camrose\n    Susan Hayward as Lucy Overmire\n    Patricia Roc as Caroline Marsh. This was Roc's only Hollywood film.\n    Ward Bond as Honey Bragg\n    Hoagy Carmichael as Hi Linnet\n    Fay Holden as Mrs. Overmire\n    Stanley Ridges as Jonas Overmire\n    Lloyd Bridges as Johnny Steele\n    Andy Devine as Ben Dance\n    Victor Cutler as Vane Blazier\n    Rose Hobart as Marta Lestrade\n    Halliwell Hobbes as Clenchfield, another of Logan's employees\n    James Cardwell as Gray Bartlett\n    Onslow Stevens as Jack Lestrade\n\nDirected by Jacques Tourneur\nProduced by Walter Wanger\nWritten by Ernest Pascal, Ernest Haycox \n\nSYNOPSIS:- Canyon Passage (1946)\nIn 1856, ambitious freight company and store owner Logan Stuart (Dana Andrews) agrees to escort Lucy Overmire (Susan Hayward) home to the settlement of Jacksonville, Oregon, along with his latest shipment. Lucy is engaged to Logan's best friend, George Camrose (Brian Donlevy). The night before they depart, however, Logan has to defend himself from a sneak attack in his hotel room; though it is too dark to be sure, he believes his assailant is Honey Bragg (Ward Bond). Later, he explains to Susan that he once saw Bragg leaving the vicinity of two murdered miners. Despite Logan's unwillingness to accuse Bragg (since he did not actually witness the crime), Bragg apparently wants to take no chances.\n\nOn their journey, Logan and Lucy become attracted to each other. They stop one night at the homestead of Ben Dance (Andy Devine) and his family. There, Logan introduces Lucy to his girlfriend, Caroline Marsh (Patricia Roc).\n\nIn Jacksonville, Logan tries to get George to stop playing poker with (and losing to) professional gambler Jack Lestrade (Onslow Stevens), even giving him $2000 to pay off his debts, but George is more interested in the prospect of getting rich quick without hard work. What Logan does not know is that George has been stealing gold dust left in his safekeeping by the miners to pay some of his losses. George also has a secret he is keeping from Lucy; he keeps propositioning Lestrade's wife Marta (Rose Hobart), though she shows no interest in him.\n\nMeanwhile, the burly Bragg keeps trying to provoke Logan into a fight. Finally, he succeeds. Logan wins, but does not kill his opponent when he has the chance. A humiliated Bragg tries to ride Logan down on his way out of town.\n\nGeorge decides to move away to make a fresh start and finally gets Lucy to agree to marry him. Logan then proposes to Caroline and is accepted, much to the disappointment of Vane Blazier, Logan's employee, who is in love with Caroline himself.\n\nLucy decides to accompany Logan to San Francisco to pick out a wedding dress. Along the way, they are ambushed by Bragg. Though their horses are shot dead, they get away and return to town, only to discover that George is in grave trouble.\n\nWhen a miner appears months earlier than George had expected and informs him that he wants to get his gold the next day, George kills the drunk man late that night. However, his crimes are traced to him; shopkeeper Hi Linnet (Hoagy Carmichael) saw him stealing some gold, and the miner's lucky gold nugget is found in George's possession. The locals, led by Johnny Steele (Lloyd Bridges), find George guilty of murder and lock him up, intending a late-night lynching. However, when one of the settlers rides in with the warning that the Indians are on the warpath after Bragg killed one of their women, Logan helps his friend escape in the confusion.\n\nLogan organizes a party to fight. When Bragg seeks their protection, Logan drives him off, to be killed by the Indians. They are then driven off by Logan's men.\n\nAfterward, Logan and Lucy learn that George was found and killed by one of the townsfolk. Caroline also has second thoughts about marriage to a man who is away so frequently on business; she breaks their engagement and accepts Vane. Logan and Lucy are free to follow their hearts.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 845 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio:1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nSubtitles:NONE\nRipped by: Trinidad [DDR]  \nDuration: 1:31:50\n\n","torrent":{"xt":"urn:btih:a077c3f2e12c614001485162fc63390126ef835d","amp;dn":"Classic+Western+Roundup-1+-+Canyon+Passage+%281946%29+Xvid+1cd+-+Wes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a077c3f2e12c614001485162fc63390126ef835d","infoHashBuffer":{"type":"Buffer","data":[160,119,195,242,225,44,97,64,1,72,81,98,252,99,57,1,38,239,131,93]},"announce":[],"urlList":[]}}