{"title":"Text to Speech Maker v1.6.0 WinAll Incl Keygen-CRD","uid":3848272,"size":8849693,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a102464993b8ab5276edac349297bcca6453d366&amp;dn=Text+to+Speech+Maker+v1.6.0+WinAll+Incl+Keygen-CRD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Antje14","files":1,"time":1192784890,"description":"This is one for all you lazy bums, now you can have a nice generic computer voice read your emails, word docs and other various things for you. Thanks to CRD who have released Text to Speech Maker 1.6, it?s quite easy. The release comes in 4 archives with a keygen included.\n\nText to Speech Maker is an award-winning text-to-speech player that lets you listen to documents, e-mails or web pages instead of reading on screen. Text to Speech Maker it also allows you to convert text to WAV,MP3 orVOX files for listening later with your portable MP3 player. Text to Speech Maker supports dozens of female, male and robotic voices for Britain English, German and French.\n\nProgram Features:\n\n    * Powerful functions: Text to Speech Maker is a text-to-speech player that lets you listen to documents, e-mails or web pages instead of reading on screen. It also allows you to convert text to WAV, MP3 or VOX files for listening later with your portable MP3 player\n    * More Voice Support: Support dozens of male, female and robotic voices for Britain English, German and French. You can download more voices at http://www.microsoft.com/reader/developers/downloads/tts.asp .\n    * Fast Converting Speed: Reading and Converting is performed directly without any temporary files, and thus enables high converting speed and economy of hard disk space.\n    * Support Optional MP3 Quality: The ?Output Sample Frequencies? and ?Output Bitrates? options allow you to make a choice between the quality and the size.\n    * Copy and Paste: Support copy/cut to clipboard and paste from clipboard, that make it easy for you to read any text soucre, such as emails, web pages, documents, and so on.\n    * Support Font Settings: You can setup font(size, color and style) of the text easily. User-friendly interface, very easy to use.\n\nRelease Name: Text.to.Speech.Maker.v1.6.0.WinAll.Incl.Keygen-CRD\nSize: 8.45 MB (8,859,562 bytes), cxx0879*","torrent":{"xt":"urn:btih:a102464993b8ab5276edac349297bcca6453d366","amp;dn":"Text+to+Speech+Maker+v1.6.0+WinAll+Incl+Keygen-CRD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a102464993b8ab5276edac349297bcca6453d366","infoHashBuffer":{"type":"Buffer","data":[161,2,70,73,147,184,171,82,118,237,172,52,146,151,188,202,100,83,211,102]},"announce":[],"urlList":[]}}