{"title":"DNA in the Sands of Time by J.Justice","uid":7417687,"size":3928907,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a3c74ba692ddcedcd6a2359d0db5c8ad3344a659&amp;dn=DNA+in+the+Sands+of+Time+by+J.Justice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GT107","files":-1,"time":1341574268,"description":"his book is spiritual dynamite. The information within it has the potential to create a firestorm of spiritual, religious and political controversy. It will shatter the frozen concepts of what the human race thinks it knows about itself, it's history, DNA and the human brain.\nThis book will warm you heart and chill your bones at the same time. Some will become angry, denying it's truth, others will rejoice over it's revelations while it will rock the foundation of traditional belief systems. It will stretch your mind to the point you cannot go back to your old way of thinking about life. It will stir your imagination and emotions, not allowing your mind to rest. Hidden truth and unknown knowledge of the human race is revealed about it's true purpose, creation and evolution. You will meet your Gods, Creator, your local Satan, the first Savior of the human race and your future Destiny. A hidden group influencing your life today without your knowledge is exposed. A frightening warning is also given from the Spiritual Realm as the world is blindly heading toward an irreversible disaster. You have the privilege to view the unknown bigger picture of your past as it actually happened and your present as it is now happening.\n\nToday's greatest question, &quot;Is there alien life out there in the universe?&quot; will be answered. You will also discover, humans are an experiment and the experiment is over. Are you ready to receive a higher knowledge and learn about yourself? Inside this book is the untold and unknown rest of the story. It comes from the Akashic Records, known to many as the Book of Life, often referred to, as the Book of the Final Judgement of the Human Race. This is the first time recorded history from the Akashic Records will be directly revealed to the human race. It will answer some of the greatest Questions and Mysteries of Science and Religion about the past, present and future.\n\nYou will quickly come to realize, life is not what you think it is. For the spiritually awake, you will find a clear understanding about the End Times and the immediate upcoming event called the Ascension. The knowledge to know how to ascend and why you may want to, is actually a complete guide to Ascension. The information given is complete, nothing is missing. You now have the knowledge to understand the mystery of life. This is a life changing book.","torrent":{"xt":"urn:btih:a3c74ba692ddcedcd6a2359d0db5c8ad3344a659","amp;dn":"DNA+in+the+Sands+of+Time+by+J.Justice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3c74ba692ddcedcd6a2359d0db5c8ad3344a659","infoHashBuffer":{"type":"Buffer","data":[163,199,75,166,146,221,206,220,214,162,53,157,13,181,200,173,51,68,166,89]},"announce":[],"urlList":[]}}