{"title":"Sonny.Vincent.[&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;71464621041f1a031e121a312733235f13085f3918253d4223&quot;&gt;[email protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;]","uid":6078552,"size":1262146667,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a4425e9d7b1425f0f68b3ec95b968823a44209bb&amp;dn=Sonny.Vincent.%5B77Punkrock%40VBR.by.HiTL3R%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"-roAch-","files":-1,"time":1293996616,"description":"Sonny Vincent (born 1952) is a punk rock musician. He has been active since the mid-1970s, when he was part of the New York City punk rock scene.\n\nVincent formed the 'Testors' in 1976 with Gene Sinigalliano (guitar) and Gregory R (drums). Later line-ups included Surealist Ron Pieniak (Rex Pharaoh) on bass, Jeff Couganour (Jeff West) on drums and Kenneth Huebner (Kenneth Brighton) on bass. They played New York clubs such as Max's Kansas City and CBGB and The Hot Club in Philadelphia with groups such as Mink DeVille, Teenage Jesus and the Jerks, The Cramps and Suicide, and toured nationwide with the Dead Boys. Testors released a 7&quot; single, &quot;Together&quot; b/w &quot;Time Is Mine&quot;.\n\nIn 1981, Testors disbanded and Vincent moved to Minneapolis where he formed Sonny Vincent and The Extreme with Michael Phillips (guitar), Jeff Rogers (drums) and the late Mort Bauman (bass guitar). The group toured the U.S. and released another single, &quot;SVE&quot; with the songs, &quot;Wingdale&quot;, &quot;Top Dog&quot; and &quot;Phantom.&quot; The group also made the bizarre film Mannequin World on the streets of Minneapolis. It was shown on television in the Twin Cities only once, after which the host of the program remarked, &quot;I sure hope the boss wasn't watching.&quot; In 1983, Sonny was involved in a performance art project that saw him banned from the grounds of the Minneapolis College of Art and Design. During his time living in Minneapolis/St. Paul Sonny Vincent also became involved with film-making and multimedia arts.\n\nAfter The Extreme disbanded and Vincent went on to form other groups, such as Model Prisoners (line-up included Bob Stinson from The Replacements), Shotgun Rationale (a revolving line-up that included at one time or another Cheetah Chrome of the Dead Boys and Bob Stinson who incidentally were in the group together in what Sonny referred to while being interviewed as a &quot;therapist's nightmare&quot;, Greg Norton - HÃƒÂ¼sker DÃƒÂ¼, The Dons a group he formed in Holland with two Dutch musicians, Sonny Vincent and the Guevaras, Sonny Vincent and his Rat Race Choir (Scott Asheton - Stooges, Cheetah Crome - Dead Boys and Captain Sensible - The Damned). Currently Vincent records and performs under his own name.\n\nVincent has performed and recorded with musicians such as Wayne Kramer, Maureen Tucker, Scott Asheton, Captain Sensible, Cheetah Chrome, Bob Stinson, Walter Lure, Brian James, Thurston Moore, Richard Lloyd, Lou Reed, John Cale, Sterling Morrison, Jad Fair, John Sluggett, Greg Ginn, John Reis, Lance of Athens GA and Kim Shattuk.\n\nVincent continues to perform and record with various musicians that he has met and worked with over the years. Due to Sonny's well known insistence on keeping his personal life and family history private, little is known of his family history. Sonny Vincent still tours much of Europe on a regular basis performing his songs\n\nen.wikipedi*.org/wiki/Sonny_Vincent\nwww.mysp*ce.com/sonnyvincent\nwww.*ngelfire.com/ny/punkrocknroll/\n\n---&gt;  due to TPB url denial filter: * = a\n\n\n\n\nÃ‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°\nThis torrent contains various albums of Sonny Vincent, The Testors, and Shotgun Rationale. eighteen albums, to be exact. but i am really not in the mood for\ntyping them all down in here. if you\\'re into 77-style Punkrock you will not regret this download, trust me...  :-D\n\nÃ‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°Ã‚Â°","torrent":{"xt":"urn:btih:a4425e9d7b1425f0f68b3ec95b968823a44209bb","amp;dn":"Sonny.Vincent.%5B77Punkrock%40VBR.by.HiTL3R%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4425e9d7b1425f0f68b3ec95b968823a44209bb","infoHashBuffer":{"type":"Buffer","data":[164,66,94,157,123,20,37,240,246,139,62,201,91,150,136,35,164,66,9,187]},"announce":[],"urlList":[]}}