{"title":"Railworks TS2014 AP  Class 150/153/156 Sound Pack (Pro)","uid":10133839,"size":48787606,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a4d01545fe70a3ca3610000b7c41b61130e7d0d7&amp;dn=Railworks+TS2014+AP++Class+150%2F153%2F156+Sound+Pack+%28Pro%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tygn547","files":-1,"time":1399927292,"description":"Armstrong Powerhouse presents a Pro sound pack for the class 150/153/156 diesel multiple unit.\n\nHow is a Pro sound pack different to a standard one?\n\nIf a sound pack is classed as being Pro, it means that most, if not all, of the sounds used have been recorded using state-of-the-art equipment at an especially organised recording session. This allows us to acquire the exact kind of sounds we require to create the best experience within the simulator. In the case of this pack, the majority of sounds were recorded from a class 150 at Bristol St. Philip's Marsh depot. As well as excellent audio quality, Pro packs include separate cab and exterior sounds because as anyone who's been in the cab of one of these units knows, there is really quite a difference! Finally, all efforts have been made to make sure the sounds are as realistic as possible. One way we have achieved this is by employing realistic volume levels which means that the volume differential between idling and full power is prototypically large so as to make you really feel the power of the engine when it revs up.\n\nWhat is exactly featured?\n\nEngine start up/shut down\n\nDistinctive engine rev-up\n\nUser operable two-tone horn using the space-bar and 'B' key\n\nBrake release/application sounds (150/156 &amp; 153 specific versions)\n\nBogie run sounds to give the sensation of movement\n\nBrake rub sound\n\nCab instrument sounds\n\nJointed track sounds\n\nFlange sounds\n\nSeparate cab sounds\n\nRealistic sound fading effects\n\nAccurate volume levels. This means the quietest sounds are as quiet as they should be in relation to the loudest as per reality.\n\nDuring the installation process, these sounds will be applied to all liveries contained within the Thomson Interactive/Oovee Class 150, Just Trains Class 153 Advanced &amp; Oovee Class 156 packs.\n\nScenario Requirements\n\nPlease note that these items are only required if you would like to use the scenario supplied with this pack. If you only want to make use of the sounds or perhaps use them in your own scenarios instead of the included one then these items are not required.\n\nRS.com Riviera Line: Exeter to Paignton \n\n\nTHIS IS THE UPDATED VERSION TO SUPPORT (153 support fix &amp; 150/156 NRN radio )\n\nSEED AND ENJOYYY PEOPLE!!!\n","torrent":{"xt":"urn:btih:a4d01545fe70a3ca3610000b7c41b61130e7d0d7","amp;dn":"Railworks+TS2014+AP++Class+150%2F153%2F156+Sound+Pack+%28Pro%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4d01545fe70a3ca3610000b7c41b61130e7d0d7","infoHashBuffer":{"type":"Buffer","data":[164,208,21,69,254,112,163,202,54,16,0,11,124,65,182,17,48,231,208,215]},"announce":[],"urlList":[]}}