{"title":"Zines Mini Small Press 24 Hour Alternative Comics Vol 1","uid":8739160,"size":2417245891,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a4e2cde64a4392aae2a92d0b76e96bfea7a0ba83&amp;dn=Zines+Mini+Small+Press+24+Hour+Alternative+Comics+Vol+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1374743712,"description":"Nearly all of these are available at Issuu, but it doesn't appear as if anyone has taken the time to compile and upload them. I did. There's a ton more, I'm sure, I'm just taking a break from the process of finding and downloading them for a bit to focus on some other &quot;stuff&quot;.\n\nA vast majority of the artists/writers/creators whose work is included in this upload have websites where you can find out more about them, check out their free web comic series, or purchase work from them directly.\n\nFor a big jump into a world of comic books that still remains largely underground, check out the 'Spit and a Half' and 'Quimby's Store' websites. The 'Retrofit Comics' website has a small selection of good stuff as well, but they also have a great list of retailers you could (and should) check out on their front page.\n\nSo, this upload contains over 150 comic zines, mini-comics, small press, alternative and 24 hour comics. Normally I would take the time to list them all for your convenience, but that's just too many. I will say that there is some genuinely GREAT stuff in the mix, but there's also probably some stuff you may delete after one look. But hey, everybody likes something different and I'm sure most of the people who regularly download my torrents will find something they like. I did take the time to open each file and remove any files that were of questionable quality. You'll still likely need to adjust the zoom in or out on most of these (depending on what you're viewing on), but I think I got everything out of the folder that I just couldn't make look good.","torrent":{"xt":"urn:btih:a4e2cde64a4392aae2a92d0b76e96bfea7a0ba83","amp;dn":"Zines+Mini+Small+Press+24+Hour+Alternative+Comics+Vol+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4e2cde64a4392aae2a92d0b76e96bfea7a0ba83","infoHashBuffer":{"type":"Buffer","data":[164,226,205,230,74,67,146,170,226,169,45,11,118,233,107,254,167,160,186,131]},"announce":[],"urlList":[]}}