{"title":"I Garden - Urban Style - Reggie Solomon","uid":7426137,"size":4973508,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5731f3fa6cfc7312e17cc2a4ec7c037608c28ae&amp;dn=I+Garden+-+Urban+Style+-+Reggie+Solomon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"DaRule762","files":-1,"time":1341809312,"description":"\nA Garden for Your Space &amp; Your Style\nYou can grow delicious, healthy vegetables and beautiful flowers in your urban setting. No yard? No problem, you have more options available than you think from containers and window boxes to raised beds and community plots. No time? No worries, there are plants and containers that accommodate even the busiest schedule.\n\nInside you'll find:\nIdeas for growing plants in any available space no matter how small or soil deficient\nStep-by-step instructions on growing plants from seed\nSuggestions for plants and containers that fit various styles and schedules, including: no-fuss hardy producers; stunning plantscapes; and plants that attract birds and butterflies\nAdvice on composting, pest control, watering and fertilizing\nStrategies for maintaining your garden while you are away\nMore than 20 recipes featuring fresh ingredients you can grow\nResources to help you build a gardening community in your neighborhood or on the Internet\n\nReggie Solomon and Michael Nolan of the popular website UrbanGardenCasual.com show you everything you need to know to grow a garden that fits your tight urban space and busy schedule. Shed your work clothes, grab your iPod and start enjoying your urban garden today.\n\nThe Urban Garden Casual Philosophy is about reclaiming the peace, relaxation and satisfaction that comes from growing something yourself.\n","torrent":{"xt":"urn:btih:a5731f3fa6cfc7312e17cc2a4ec7c037608c28ae","amp;dn":"I+Garden+-+Urban+Style+-+Reggie+Solomon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5731f3fa6cfc7312e17cc2a4ec7c037608c28ae","infoHashBuffer":{"type":"Buffer","data":[165,115,31,63,166,207,199,49,46,23,204,42,78,199,192,55,96,140,40,174]},"announce":[],"urlList":[]}}