{"title":"Ultimate Beavis And Butt-Head Collection by VampyrKodi","uid":5544786,"size":38153273644,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a5a5adf061d250c9e2c05a4064cd53ea6eb713d7&amp;dn=Ultimate+Beavis+And+Butt-Head+Collection+by+VampyrKodi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HarrySachz","files":1,"time":1273347511,"description":"This is the culmination of three months work.  My wife thought I was nuts, but here it is.\n\nI wasn't happy with the other Beavis And Butt-Head torrents out there. Mostly the video was low quality and they were stuffed with extraneous crap that made the files huge.\n\nThis torrent is quite simply, every single Beavis And Butt-Head (even the pilots from Liquid Television) in chronological order, plus the movie, in the highest quality video I could find (some from my archives and some from the web).  The audio and video were tweak in Sony Vegas to raise quality when only low quality videos was found.  I've even included DVD Jackets.\n\nAll the cover art is by Mike Judge (or his staff) except the front of &quot;Beavis Christ&quot;.  That one is mine and it is a joke, so no hate mail people.\n\nAll you have to do is un-rar, burn the ISOs, and print the covers.\n\nEnjoy!\n\nP.S.  In response to several Questions:\n\nNo Music Videos!!! THEY ARE LAME.\n\nI Said Chronological order because they are in chronilogical order conformied against numerous episode guides.\n\nAnd it wouldn't be every single episode if it didn't have the holiday specials. Would it?\n\nKing Turds collection was good.  Got some of these from there, but it was missing episodes.  Got most from my old VHS tapes from original runs. All references to fire and guns are intact.\n\nIf you are looking for music videos, PC games, musical duets with Cher,  THIS IS NOT FOR YOU. This is about the TV show and Movie ONLY!!!\n\nIf you want pure Beavis and Butt-head, Uncensored; already set up on a DVD with chapter markers for each episode, and printable covers; Download this.","torrent":{"xt":"urn:btih:a5a5adf061d250c9e2c05a4064cd53ea6eb713d7","amp;dn":"Ultimate+Beavis+And+Butt-Head+Collection+by+VampyrKodi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5a5adf061d250c9e2c05a4064cd53ea6eb713d7","infoHashBuffer":{"type":"Buffer","data":[165,165,173,240,97,210,80,201,226,192,90,64,100,205,83,234,110,183,19,215]},"announce":[],"urlList":[]}}