{"title":"Away All Boats","uid":10400082,"size":1396678823,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a5c1e91e2b240288017c3ecbd60099cecc895230&amp;dn=Away+All+Boats&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strawberry5","files":-1,"time":1403347134,"description":"Away All Boats\n\nEditor Note: I am ex Air Force, and have many 'Salty' friends.\nThis is not only a great WWII movie, it is also a story about camaraderie and what it takes to become the very best that we can be. This is an adult film about the Navy; but it is also about what it takes to be a successful human being, especially in a time of great danger or challenge.\n\nIMDB:\nI am going to give reasons here why &quot;Away All Boats&quot; is just about the best naval drama ever put onto film. Self-evidently, this unpretentious but absorbing movie has a lot going for it, Among its assets are beautiful color photography, a stellar cast headed by Jeff Chandler as Captain Jeb Hawks, steady direction by Joseph Pevney, a very good cast, dramatic situations and very interesting characters. Standouts in the very unusually-large cast include Richard Boone, Charles Mcgraw, Keith Andes, Arthur Space, Frank Faylen and James Westerfield. All the creators and technicians involved have given this film a very spacious and attractive look. Kenneth Dodson's intelligent novel has been realized here as a very in-depth look at how the US Navy's officers and enlisted men got their job done in WWII. If anything was missing from the final product, it was three minor elements. Jeff Chandler, fresh off his most charismatic work in &quot;Flame of Araby&quot; here acts well but lacks his usual voltage to a degree; George Naderis attractive and adequate as his heir apparent, but Keith Andes should have played this vital role. And there could perhaps have been a bit more character development accorded to some of the other crewmen along the way in Ted Sherdeman's generally excellent film script. But the several battle scenes are very excitingly-mounted and staged; the dialogue is always above average; Hawks' warning the kamikaze planes away from his vessel is an unforgettable moment; and the long climax as the men try to save their ship after the captain has been killed, following his dying advice, is an unforgettable achievement. Julie Adams plays Nader's lovely wife, and there is comedy and incompetence, bravery and extreme ingenuity on exhibit throughout. This is an adult film about the Navy; but it is also about what it takes to be a successful human being, especially in a time of great danger or challenge. One of my favorite never-missed and always-recommended cinematic works.","torrent":{"xt":"urn:btih:a5c1e91e2b240288017c3ecbd60099cecc895230","amp;dn":"Away+All+Boats","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5c1e91e2b240288017c3ecbd60099cecc895230","infoHashBuffer":{"type":"Buffer","data":[165,193,233,30,43,36,2,136,1,124,62,203,214,0,153,206,204,137,82,48]},"announce":[],"urlList":[]}}