{"title":"Kukuczka - Jerzy Porebski","uid":12504401,"size":757036686,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a88c03c60715d2e37b755bd4b09d5f00dab595b6&amp;dn=Kukuczka+-+Jerzy+Porebski+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"n0n4m3xxx","files":1,"time":1443428540,"description":"http://steepedge.com/categories/mountaineering/kukuczka.html\r\n\r\nPolish mountaineer Jerzy (Jurek) Kukuckza raced Reinhold Messner to become the first man to have climbed all fourteen 8000 metre peaks in the world. Jurek entered the race late, and Messner won, but the race was probably more a media fabrication than a reality. Kukuczka completed the task in an amazing eight years and more often than not by new routes and winter ascents during his quest. It was definitely not just about the numbers.\r\nThe story of Polish climbing in the cold war era has been brought to the world's attention by Bernadette MacDonald's book Freedom Climbers (2010). This film captures the essence of one of the most influential climbers of his age and those who know him.\r\n(Polish with English subtitles.)\r\nBernadette McDonald describes the film:\r\n\r\n'This is a film that explores one of the most important figures in Himalayan climbing history. Jerzy Kukuczka dominated the world of Himalayan climbing for a decade, setting new standards with new routes and winter ascents of the Himalayan giants. But this film is much more than a recounting of his climbing achievements. It is a sensitive portrait of the complete Kukuczka, told from the perspective of his family, his peers, his competitors and in his own words. It is a magnificent story about a legendary character told very, very well.\r\n\r\n'Like any true champion he made it look easy: Jerzy Kukuczka awed fellow mountaineers time and again with 8000er summits bagged in alpine style and the dead cold of winter.The wonder-climber's accomplishments were overshadowed in media by the &quot;second&quot; position he held in the 14x8000ers race behind South Tyrolean Messner and a new documentary about the Polish legend is therefore anticipated by the core mountaineering community.'","torrent":{"xt":"urn:btih:a88c03c60715d2e37b755bd4b09d5f00dab595b6","amp;dn":"Kukuczka+-+Jerzy+Porebski+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a88c03c60715d2e37b755bd4b09d5f00dab595b6","infoHashBuffer":{"type":"Buffer","data":[168,140,3,198,7,21,210,227,123,117,91,212,176,157,95,0,218,181,149,182]},"announce":[],"urlList":[]}}