{"title":"The Adventures of Oloorin and Co collection","uid":9545046,"size":2589591,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa2658e8a8eec14d85f9c23c67ab7c011d948727&amp;dn=The+Adventures+of+Oloorin+and+Co+collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"theapemania","files":1,"time":1391116107,"description":"I have re-uploaded my torrent of the Oloorin books, since I forgot a few tags which were probably important n stuff. This torrent contains all the books released so far (Both kindle and PDF versions) in the series 'The Adventures of Oloorin and Co'. They are basically a Dungeons &amp; Dragons fan fiction, following Oloorin and his friends as they wander the lands in search of adventure, treasure and fame.\n\nBeing the author of the books, I chose to upload these here in hopes of reaching a wider audience. This series is the first series I have written, I myself see it as no masterpiece but acceptable enough for the first few books I have written. They are not the first ever book I have written, but the first ever books I have published (via Amazon kindle publishing). The important thing is that I tried to write as good as I could.\n\nIf any of you pirate folk like my books, feel free to purchase one. They are currently available as ebooks (2.99$) or printed books (9.99$ + shipment). Its easy to find my books on Amazon, just search for their names or my author name (Mikael B Lind).\n\nWould also love any feedback, both in the form of reviews and comments. Regardless, I hope you all enjoy my books and that they are worth reading.\n\nMay the Emprah be with you\nMikael B Lind","torrent":{"xt":"urn:btih:aa2658e8a8eec14d85f9c23c67ab7c011d948727","amp;dn":"The+Adventures+of+Oloorin+and+Co+collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa2658e8a8eec14d85f9c23c67ab7c011d948727","infoHashBuffer":{"type":"Buffer","data":[170,38,88,232,168,238,193,77,133,249,194,60,103,171,124,1,29,148,135,39]},"announce":[],"urlList":[]}}