{"title":"Avatar Media Pack - HD WallPapers, FLAC Soundtrack, Trailer Musi","uid":5255764,"size":1805496522,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:aa79c8aa9e48b30262c7aab152ebf811b7a5ccdd&amp;dn=Avatar+Media+Pack+-+HD+WallPapers%2C+FLAC+Soundtrack%2C+Trailer+Musi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rewt528491","files":299,"time":1262543853,"description":"Avatar\nMedia Pack - HD WallPapers, FLAC Soundtrack, Trailer Music, PC Demo, script, HD Trailers, and Music Video\n\nIncluded:\nALL SONGS FROM THE TRAILER!!!! I did a lot of searching last night to find the best mp3s of the songs made by Audiomachine. The first song in the trailer was easy since that is from the movie The Island and that song I included in the torrent in flac format! The songs by Audiomachine range from 128kbps to 320kbps depending on the song they were the best copies I could find\n\nThe Soundtrack to the movie IN FLAC FORMAT!\n\nEVERY SINGLE Hi Definition Wallpaper I could find including lots from torrents I downloaded. There are some repeated images mixed together but every torrent and website I visited had wallpapers the other didn't so there are a whole lot of different ones including movie screenshots, wallpapers, behind the scenes shots, promotion shots, fan art, video game concept art, etc.\n\nBOTH Hi-Definition Trailers in 1080p resolution\n\nAvatar The Game PC Demo\n\nLeona Lewis Music Video with the theme from Avatar &quot;I See You&quot; (music video includes footage from the movie)\n\nAnd lastly the Avatar scriptment.\n\nI had the Nintendo DS Rom for the game on this but removed it since on a lot of torrent websites a lot of people said they were having trouble getting it to work on R4 flash cards though I heard it works on CycloDS. When my cyclods arrives in the mail later this week I'll test it and if it works I'll make a torrent for it.\n\nEnjoy! Please seed at least 100%....preferably 200%.","torrent":{"xt":"urn:btih:aa79c8aa9e48b30262c7aab152ebf811b7a5ccdd","amp;dn":"Avatar+Media+Pack+-+HD+WallPapers%2C+FLAC+Soundtrack%2C+Trailer+Musi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa79c8aa9e48b30262c7aab152ebf811b7a5ccdd","infoHashBuffer":{"type":"Buffer","data":[170,121,200,170,158,72,179,2,98,199,170,177,82,235,248,17,183,165,204,221]},"announce":[],"urlList":[]}}