{"title":"NEOScavenger v0.986b","uid":9968983,"size":46417158,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aa90231bc25478b8ab81792220e352fbd35599af&amp;dn=NEOScavenger+v0.986b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AppRipper","files":-1,"time":1397601974,"description":"NEO Scavenger\n(c) Blue Bottle Games\n\nRelease date: 9/13/2013 \nProtection: DRM-Free\nLanguage: English\nVersion: 0.986b\n\n\nNEO Scavenger is a turn-based, rogue-like RPG where you must\nsurvive in the wasteland long enough to figure out who you are\nEach turn you must decide where to go, how to scavenge for\nsupplies, and how to deal with anything and anyone you encounter\nAnd with each passing minute, the pit in your stomach grows, your\ndehydration worsens, your muscles tire, and your body temperature\ndrops in the cold autumn air. Choose your starting abilities\ncarefully, because they and your wit are the only tools you have in\nthe apocalypse!\n    &lt;a href=&quot;\nhttp://bluebottlegames.com/main/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bluebottlegames.com/main/&lt;/a&gt;\n\nInstructions:\n1) Unzip\n2) Enjoy!\n\nIt's DRM-Free as far as I know, however I would block it on your firewall anyway.\n\nHope you all enjoy this game! Buy it and support the developer! He really deserves it!\n\n-AppRipper &quot;Happy Hacking!&quot;\n\n*** CHANGELOG ****\n\nAdded new AUTO layout mode, which chooses a resolution that best fits the screen.\nAdded new 4:3 layout mode, which fits 1024x768 screens and other standard aspect ratios.\nAdded ability to adjust music, sound, and master audio levels independently.\nAdded ability to limit framerate from 10fps to 60fps, for machines that struggle with performance.\nAdded new weather/time of day icon to UI, to replace old &quot;dawn/day/dusk&quot; text.\nAdded messages alerting player to time of day changes.\nAdded precise time and date info to weather icon when timepiece equipped (e.g. active phone, tablet).\nAdded code to forbid AI from entering/spawning into certain areas. (E.g. ATN).\nAdded new help screen, with links to wiki and manual.\nAdded exit button to main menu, for closing the app.\nAdded encounter to alert player when they are ambushed in their sleep.\nAdded warning message to title screen if save system cannot save data. Click link for more info, or try again.\nAdded code to creature's dropitem method to try camp if ground is full.\nAdded code to spawn creatures nearby if scavenge results fail to redirect nearby NPCs.\nAdded code to restore fullscreen on game launch if player ended in fullscreen last session.\nAdded code to silently degrade certain items (food, bracelet) based on property flag.\nAdded night vision goggles to DMC sniper loadout.\nAdded &quot;flame source&quot; as a forbidden property on the &quot;medium shaft&quot; ingredient requirement.\nAdded sweating condition before heat exhaustion, with thirst, and sleep effects.\nAdded min max safe temp changes due to sweating and shivering.\nAdded sweating effects to other overheating conditions.\nAdded slight fatigue to shivering.\nAdded rollover text to nex","torrent":{"xt":"urn:btih:aa90231bc25478b8ab81792220e352fbd35599af","amp;dn":"NEOScavenger+v0.986b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa90231bc25478b8ab81792220e352fbd35599af","infoHashBuffer":{"type":"Buffer","data":[170,144,35,27,194,84,120,184,171,129,121,34,32,227,82,251,211,85,153,175]},"announce":[],"urlList":[]}}