{"title":"1916 - What the People Saw (2013)  By Mick O'Farrell (epub,mobi,","uid":9566545,"size":16141665,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aac89882214ccc80e7ae2d0d007968a1ec96797a&amp;dn=1916+-+What+the+People+Saw+%282013%29++By+Mick+O%27Farrell+%28epub%2Cmobi%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1391527550,"description":"Format: mobi/epub/azw3\nLength: 336 pages\nGenre: History\nDate: 6 December 2013\n\nWhen the rebellion of 1916 had ended, more than 400 people were dead and over 2,000 wounded. More than half of these were civilians, but even for those civilians who were not direct casualties, the rising was one of the most momentous experiences of their lives. The accounts that Mick O'Farrell has collected come from letters, diaries, extracts from otherwise unrelated biographies, and contemporary magazine and newspaper articles.\n\nSome common themes are present in the accounts. For instance, a fear of going hungry, which resulted in constant, and dangerous, attempts to stock up with supplies. There was also a grim realisation (despite two years of World War) that war had arrived on their doorstep: 'We know a bit what War is like now'. For some, there was even an undeniable element of excitement - one witness writes that 'now that it's over, none of us would've missed it for the world'. After watching a woman shot in the street, another witness notes that he 'saw a man rush out and take a snapshot'. Elsewhere, there are 'crowds looking on as if at a sham battle'. For most, however, it was the kind of excitement they could do without:\n\nComplimenting the many historical accounts of the rising and statements from the participants, this book gives a real flavour of what it was like to live through history in the making.\n\nAuthor:\n\nMick O'Farrell was born in Dublin in 1966, the year of the 50th anniversary of the Easter Rising. He has been studying the history and locations of the Rising for some years.He is the author of '50 Things You Didn't know about 1916' and 'A Walk Through Rebel Dublin 1916'.","torrent":{"xt":"urn:btih:aac89882214ccc80e7ae2d0d007968a1ec96797a","amp;dn":"1916+-+What+the+People+Saw+%282013%29++By+Mick+O%27Farrell+%28epub%2Cmobi%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aac89882214ccc80e7ae2d0d007968a1ec96797a","infoHashBuffer":{"type":"Buffer","data":[170,200,152,130,33,76,204,128,231,174,45,13,0,121,104,161,236,150,121,122]},"announce":[],"urlList":[]}}