{"title":"Women's Lives in Medieval Europe - Emilie Amt","uid":13439829,"size":3054221,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab2df7c55d0066eb0a49d90714c5c0394f25c348&amp;dn=Women%27s+Lives+in+Medieval+Europe+-+Emilie+Amt&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1454687691,"description":"Praise for the first edition:\r\n\r\n'It is difficult to imagine another book in which one could find all this diverse material, and no doubt Amt's collection, in its richness, and in its genuine clarity and simplicity will takes prominent place in our expanded, diversified medieval curriculum, a curriculum that takes class, gender, and ethnicity as central to an understanding of world cultural history.' - The Medieval Review\r\n\r\nLong considered to be a definitive and truly groundbreaking collection of sources, Women’s Lives in Medieval Europe uniquely presents the everyday lives and experiences of women in the Middle Ages. This indispensible text has now been thoroughly updated and expanded to reflect new research, and includes previously unavailable source material.\r\n\r\nThis new edition includes expanded sections on marriage and sexuality, and on peasant women and townswomen, as well as a new section on women and the law. There are brief introductions both to the period and to the individual documents, study questions to accompany each reading, a glossary of terms and a fully updated bibliography. Working within a multi-cultural framework, the book focuses not just on the Christian majority, but also present material about women in minority groups in Europe, such as Jews, Muslims, and those considered to be heretics. Incorporating both the laws, regulations and religious texts that shaped the way women lived their lives, and personal narratives by and about medieval women, the book is unique in examining women’s lives through the lens of daily activities, and in doing so as far as possible through the voices of women themselves","torrent":{"xt":"urn:btih:ab2df7c55d0066eb0a49d90714c5c0394f25c348","amp;dn":"Women%27s+Lives+in+Medieval+Europe+-+Emilie+Amt","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab2df7c55d0066eb0a49d90714c5c0394f25c348","infoHashBuffer":{"type":"Buffer","data":[171,45,247,197,93,0,102,235,10,73,217,7,20,197,192,57,79,37,195,72]},"announce":[],"urlList":[]}}