{"title":"Super Club Hits (2011)[mp3]","uid":6878287,"size":1832634492,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ac2532c73a54b28561c992c756793a87b039599a&amp;dn=Super+Club+Hits+%282011%29%5Bmp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Black1000","files":-1,"time":1323540621,"description":"Super Club Hits (2011)\n\n001. LNM Project feat. Elise - Watching Me Move (Bellatrax Radio Edit)\n002. Alex De Vito - Im A Fucking Vip\n003. Serge Devant Feat. Emma Hewitt - Take Me With You (Adam K &amp; Soha Radio Edit)\n004. Hannah - Shadow On The Wall (Riff And Rays Mix)\n005. Tensnake - Coma Cat (Round Table Knights Remix)\n006. Baby Alice - Sexy (Radio Edit)\n007. Bingo Players - Tom's Diner\n008. Peter Luts feat. Jerique - Cant Fight This Feeling (Radio Edit)\n009. Andrey Vakulenko - Loco Coco (Colombian Radio Mix)\n010. Gina Starr - I Want It Now (Robbie Rivera Remix Edit)\n011. Elena - Disco Romancing (Video Edit)\n012. Henrik B - Now And Forever feat. Christian Alvestam (Norman Doray Cazzo Remix)\n013. Zoe Badwi - Freefallin\n014. Florian Arndt - Let Freedom Reign (Houseshaker Mix)\n015. Natalia Kills - Mirrors (Moto Blanco Radio)\n016. Niels Van Gogh Vs Voltaxx - Bomb The Bass (Voltaxx Mix Edit)\n017. Jeremy de Koste - Drive Me Insane (Radio Edit)\n018. Kurd Maverick - Shine A Light (Botz &amp; Flydrums &amp; Dani Villa Remode Mix)\n019. Edward Maya Feat. Vika Jigulina - Desert Rain (Radio Edit)\n020. DJ F.R.A.N.K - Discotex! (Yah!)\n021. Stan Kolev - Farewell (Ben Coda And Ad Brown Main Room Remix)\n022. House Rockerz - Herzrasen\n023. Kesha - We R Who We R (Fred Falke Remix Radio Edit)\n024. Nervo Feat. Ollie James - Irresistible\n025. Tim Berg Norman Doray And Sebastien Drums - Tweet It (Dbn Remix Edit)\n026. Laurent Wery &amp; Swiftkid - Hey Hey Hey (Radio Mix)\n027. Morning Parade - Under The Stars (Labyrinth Ear Remix)\n028. Gianni Kosta - I Want To Give You (Taito Remix)\n029. Houseclap And Max C - On And On (Mikael Weermets Remix)\n030. Timofey &amp; Bartosz Brenes vs. Terri B! - Heaven\n031. Laserkraft 3d - Nein Mann (Tocadisco Remix Edit)\n032. Matt Caseli And Danny Freakazoid - Sign Your Name (Across My Heart)(Radio Edit)\n033. Empire Of The Sun - We Are The People (The Shapeshifters Vocal Remix)\n034. Deadmau5 feat. Rob Swire - Ghosts'N'Stuff\n035. Deadmau5 Und Wolfgang Gartner - Animal Rights\n036. Amoko - Believe feat. C. Bastio (Jun-X Remix)\n037. Carra And Rudari Feat Sam Wood - Music In Me (Radio Edit)\n038. Chuckie &amp; Hardwell Ft Ambush - Move It 2 The Drum (Tech Mix)\n039. Cheryl Cole - The Flood (Wideboys Radio Edit)\n040. Dj Ortzy - Infected (George F And Eran Hersh And Darmon Remix)\n041. Tim Royko Feat. Kediva - Dreamer (Original Mix Edit)\n042. Moonbeam Feat. Avis Vox - Star Way (Ts Radio Edit)\n043. Craig David - One More Lie (Standing In The Shadows)\n044. Afrojack Feat. Eva Simons - Take Over Control (Ian Carey Remix)\n045. Tristan Garner feat. Polina - Fallin (Radio Edit)\n046. Kazaky - In The Middle\n047. Mariya feat. Ja Rule - I'm Here (Remix)\n048. Funkerman - Unconditional Love (feat Ida Corr) (Firebeatz remix edit)\n049. Serge Devant Feat. Emma Hewitt - Take Me With You (Original Club Cut)\n050. Jasper Forks - Alone\n051. George F And Tekkman - Lolita (Original Mix)\n052. Michael Mind Project Feat. Mandy Ventrice And Carlprit - Delirious\n053. Gyptian - Hold You (Major Lazer Remix)\n054. Boney M - Marilyn Monroe vs. Barbra Streisand (Radio Mix)\n055. Shining Point - Girlz Luv Djs (Radio Edit)\n056. Victoria Silvstedt - Saturday Night\n057. Diego Miranda Feat. Liliana - Ibiza For Dreams (Ralvero And Bassjackers Remix Edit)\n058. Max Farenthide - Happy People\n059. Greg Armano - Stars (Radio Edit)\n060. Romantica - You Want My Love (Radio Edit)\n061. Tomcraft - Room 414 (Cant Get Away) (Tube And Berger Remix Edit)\n062. Remady Feat. Craig David - Do It On My Own\n063. Atb - Twisted Love (Airplay Mix)\n064. Bastian Van Shield - Whith Dust\n065. Nick Skitz Vs Dj Lotus - Only Girl (In The World) (Freddy O Edit)\n066. Paffendorf feat. Fara - Will I Ever (Matt Rixx Edit)\n067. Chocolate Puma - Tonco Tone (Original Mix Edit)\n068. Eric Prydz - Niton (The Reason)\n069. Pendulum - The Island (Radio Edit)\n070. Kitsch 2.0 Feat. Craig Smart And Theory - Sugar In My Feet (Kitsch 2.0 Mix)\n071. Kate Ryan - Sage Comme Un Image\n072. Mike Candys - Together Again (Christophers Radio Edit)\n073. Jay Style - Reach Up (Datamotion Edit Radio Remix)\n074. Fedde Le Grand Feat. Mitch Crown - Rockin High (Johnny Deekay Remix Edit)\n075. Alain Bertoni feat. Jimmy Slitter - Shining Star (Thierry de Broca Remix)\n076. Tim Berg - Seek Bromance (Samuele Sartini Mix)\n077. The Noisettes - Don't Upset The Rhythm (Go Baby Go)\n078. Soundforgers - The Buzz (E-Techno Edit)\n079. Spencer And Hill - Yeah Yeah Yeah\n080. Alex Alvarez &amp; Muttonheads - Moment Of Happiness (Original Mix)\n081. Toni Granello - Wings of Love (Remady Radio Mix)\n082. John Houseback feat. Sandie Amantini - Flying (Radio Edit)\n083. Primo - Sexy Sax (Radio Edit)\n084. Gianni Kosta - Crazy feat. Paolo Ravley (Club Mix)\n085. Loic Penillo feat. Audrey Valorzi - Pura Vida (Spanish Radio Edit)\n086. Meck - Windmills (Radio Edit)\n087. Guenta K - Turbullar Bells\n088. Nirvana, Michael Jackson - Smells Like Rockin' Robin\n089. Jes - Awaken (Coco Channel Radio Edit)\n090. Example - Kickstarts (Klaas Radio Mix)\n091. The Saturdays - Work (Cahill Radio Edit)\n092. Christopher S &amp; Mike Candys - Rhythm Is A Dancer (Radio Edit)\n093. Armin van Buuren vs. Sophie Ellis-Bextor - Not Giving Up On Love\n094. Sady K - Ich Liebe Dich (Eric Chase Club Mix)\n095. Agnes - I Need You Now (Uk Radio Edit)\n096. Marq Markuz &amp; Dj Erohin - Dj, Kill Me By Your Music\n097. Blackfeel Wite - Immortals (Original Mix)\n098. Milk And Sugar Feat. Ayak And Lady Chann - Crazy (Yves Murasca And Ezzy Safaris Piano Remix\n099. Roger Sanchez - 2gether (Antoine Clamaran Radio Edit)\n100. Duck Sauce - Barbra Streisand (Afrojack Meat Mix)\n101. Spencer And Hill - Lost In Space ((Matteo Marini Remix)\n102. LG Performers feat. Stevie H - I Have to Be Alone (Radio Edit)\n103. Picco - Venga (Db Pure Radio Edit)\n104. DJ Moms - Pray (Radio Edit)\n105. Jean Claude Ades feat. Sam Obe - Work Of Art\n106. R.I.O. - Like I Love You (Money G Radio Edit)\n107. Finger And Kadel - Nachtmusik\n108. Axwell Feat. Errol Reid - Ive Got Nothing But Love (Remode)\n109. Cher - You Havent Seen The Last Of Me (Dave Aude Club Mix)\n110. Scarmix Remakerz feat. Kdeeja - Hit Me (Radio Edit)\n111. Dj Falk - Jaana (Twin Pack Remix Edit)\n112. Sandy Rivera And Rae - Hide U (Norman Doray Remix)\n113. John Dahlback Feat. Terri B - Flirt (Original Extended Mix)\n114. Doodge And Viper - Boom (Electro Version Edit)\n115. Armin Van Buuren Feat. Christian Burns - This Light Between Us (Radio Edit)\n116. Bob Sinclar - Kiss My Eyes (Andrey Zenkoff &amp; Mishel Lopes Radio Edit)\n117. Mattara feat. Winston - Dreams Of My Life (Andrea T Mendoza vs Mattara Radio)\n118. Coming Out - Start Again (Datamotion Edit Remix)\n119. Michael Feiner And Eric Amarillo - Music Will Turn You On (Dabruck And Klein Remix Edit)\n120. Rico Bernasconi Vs. Vaya Con Dios - Nah Neh Nah\n121. Noel Sanger - Everglade Anthem (Original Mix)\n122. Stephan M, Laurent Simeca - Roxanne (Niklas Gustavsson Remix)\n123. Mischa Daniels And Tara Mcdonald - Beats For You\n124. Hi Tack - Say Say Say (Waiting 4 U) (Koen Groeneveld &amp; Addy Van Der Zwan's Gotta Wait Remix)\n125. Lazee Feat. Mohombi - Do It (Jay Frogs All Night Mix)\n126. Ph Electro - Every Breath You Take\n127. Jessie J Feat. B.O.B - Price Tag (Benny Page Remix)\n128. SykenSugarstarr - Like That Sound (Radio Edit)\n129. P SIX - Git Wit U (Single Edit)\n130. Tony Nocera - 7 Minutes After Midnight (Jam Limmat Full Vocal Remix)\n131. Micha Moor - Tonight (Original Edit)\n132. Tony Marquez feat. Phylly - In Love With the Music (Radio Edit)\n133. Javier Gonzalez - Andreas Song (Gonzalo Shaggy Garcia Remix)\n134. Jeremy Kalls - Anything for You (Short Dance Edit)\n135. Tom Novy Feat. Lima - Now Or Never (2011) (Lissat And Voltaxx Edit)\n136. Jean Claude Ades - Vallee Des Larmes (Pleasurekraft Sideshow Remix Edit)\n137. Kalls and Arc - U Got It (Radio Edit)\n138. Greg Parys - Why Don't We Just Fuck (Radio Edit)\n139. Kalls and Arc feat. Ellington - U Got It (Jeremy Kalls Radio Edit)\n140. The Whiteliner - Saphir (Original Mix)\n141. C &amp; C Music Factory - Gonna Make You Sweat (Dj Kashtan &amp; Dj Kirillich Remix Radio)\n142. Eric Chase - Everybody Surrender\n143. Dj Gregory And Gregor Salto Feat. Serafim Crew - Paris Luanda (Steven Jamal Edit)\n144. Submission Dj - Babarabatiri (Original Mix)\n145. Kevin Rudolf feat. Rick Ross - Welcome To The World\n146. Distant People Feat. Hannah K. - Rhythm Of My Love (Cosmic Funk Remix Edit)\n147. Britney Spears - Hold It Against Me The Alias (Radio Remix)\n148. Bellini - Samba All Night (Radio version)\n149. Alex Kenji - Lets Get This Thing Started (Original Mix Edit)\n150. Milk &amp; Sugar Vs Vaya Con Dios - Hey Nah Neh Nah (Milksugar Radio Version)\n151. Koen Groeneveld And Addy Van Der Zwan - Do It Do It\n152. Dr. Alban - Sing Halelluah (Dj Oleg Petroff Remix)\n153. Alex Kraften - Forever Loved (Radio Edit)\n154. Nari &amp; Milani &amp; Cristian Marchi feat. Luciana - I Got My Eye On You (Cristian Marchi &amp; Paolo\n155. The Whitesharks - Pump It Up\n156. Goose - Cant Stop Me Now (The Bloody Beetroots Remix)\n157. Royaal N Black Feat Bryan B - Come Home 2011 (Djs From Mars Radio Edit)\n158. Mitch Crown - Crazy (Jordy Lishious Dope And Dirty Remix Edit)\n159. Medina - Addiction\n160. Bingo Players - Lame Brained (Original Mix)\n161. Andrew Spencer - Heart Of The Ocean (Titanic Theme) (STFU Remix Edit)\n162. Phunk Investigation Vs. Boy George - Generations Of Love 2011 (Da Fresh Mix)\n163. Zuri - Burn Out (Will Reckless Remix)\n164. Cristian Marin And Dj Gaston - The Situation (Move Out)\n165. Sidney Samson Feat. Sicerow - Fill U Up (5 Star Hotel Mix Edit)\n166. Paperboy feat. Naima - Let Yourself Go (Radio Edit)\n167. Riva Starr Feat. Noze - I Was Drunk (Original Mix Edit)\n168. Redroche Vs. Armstrong - Make Your Move (Radio Edit)\n169. Johnny Bravo And Mieczyk Feat. Free On Stage - Sunrise (I Feel)(Scibi Dub Edit)\n170. Mark Skyy feat. Big Daddi - Shes Supersonic (Radio Edit)\n171. Plastikbass Feat. Oliver Kobs - Es Wird Laut\n172. Pi - The Time (Dirty Bit)\n173. Afterlife - Far Away (Thor House Mix)\n174. Micha Moor And Epiphony - Break My World\n175. Mika Vyne - Just One More Night (Radio Edit)\n176. Levan - Right On (Central Avenue Dub Edit)\n177. Sacha M and Dave Mitz - Skyland (Radio Edit)\n178. Vanity - Gipsy Moves (Nah Neh Nah)\n179. Nari And Milani Feat. Carl Fanini - Smells Like Teen Spirit\n180. The Shapeshifters - She Freaks\n181. Hurts - Wonderful Life (Mantronix Remix)\n182. Coolio Vs. Kylian Mash &amp; Rico Bernasconi - Gangstas Paradise 211 (Splash Vs. Scotty Edit)\n183. Remady Feat. Lumidee And Chase Manhattan - Im No Superstar (Voodoo And Serano Club Mix)\n184. Dbn And Patric La Funk - Inside Out (Inpetto Remix Edit)\n185. Steve Shine - Nightbeat (Fred de F. Limited Remix)\n186. Inusa Dawuda Vs. Lissat Khetama - Love Train The Valentines Song (Radio Mix)\n187. Yves Murasca Feat. Linda Fields - Happy (The Good Guys Remix Edit)\n188. Dj Chrixx feat. Morri - Got to Let You Know (Radio Edit)\n189. Timati Feat. Kalenna - Welcome To St. Tropez (Dj Antoine Vs Mad Mark Radio Edit)\n190. The Dancer - Don't Go Away (Radio Edit)\n191. Power Francers - Pompo Nelle Casse (Belzebass Party Remix)\n192. Felix Wellcom - Talk to Me (Radio Edit)\n193. SUNDAY - Begin to Biguine (Radio Edit)\n194. The Shrink Reloaded Feat. Mc Pryme - Nervous Breakdown 211 (Timothy Allan Vocal Radio Mix)\n195. Swedish House Mafia Vs. Tinie Tempah - Miami 2 Ibiza\n196. Christophe Fontana feat. Joanna Ray - Armonia (Radio Vocal Mix)\n197. Jasper Forks - Alone (Sunrider Radio Edit)\n198. Sunrider - The Bomb (Electro Radio Edit)\n199. Katy Perry - Teenage Dream (Vandalism Le Pop Mix)\n200. Jazzbit - Sing Sing Sing (Yolanda Be Cool And D - Cup Edit)","torrent":{"xt":"urn:btih:ac2532c73a54b28561c992c756793a87b039599a","amp;dn":"Super+Club+Hits+%282011%29%5Bmp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac2532c73a54b28561c992c756793a87b039599a","infoHashBuffer":{"type":"Buffer","data":[172,37,50,199,58,84,178,133,97,201,146,199,86,121,58,135,176,57,89,154]},"announce":[],"urlList":[]}}