{"title":"Discovery.Edge.of.Existence.2of4.Oman.DVB.Xvid.AC3","uid":4326739,"size":780494848,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:aca1267ef9391ba9667d1d083ed3fde159f8394d&amp;dn=Discovery.Edge.of.Existence.2of4.Oman.DVB.Xvid.AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":1,"time":1217805149,"description":"\n\nCulture Documentary hosted by Donal MacIntyre and published by Discovery Channel in 2006 - English narration\n\n\nInformation\n------------------------------\n\nThroughout the world there are places so inhospitable that humans cannot survive there long term. In this new four-part series for Five, Donal MacIntyre puts his life and reputation on the line as he explores life in some of the most difficult environments on Earth. Donal shows what it is like to live on the very edge of these places and will experience the natural world at its harshest first hand. The series features some of the most spectacular locations in the world. Combining survival know-how, journalistic observation, anthropology and physical challenges, the outcome will never be certain for Donal in this brand new action adventure series.\n\n\n1) Bolivia \nThe Altiplano region of Bolivia is one of the highest inhabited places in the world where every breath is an effort. It is home to the Quechuan Indians who worship Mother Earth with blood sacrifices, both animal and human. Donal takes his chances at a Tinku festival where rival villages fight, sometimes to the death, in honour of Mother Earth and battles high altitude exhaustion as he struggles over mountain passes with a Llama train carrying salt to remote villages.\n\n2) Oman \nIt hasn&amp;#039;t rained for six years and the temperature regularly tops 50C in the Arabian Desert but the Bedouin still choose to live there rather than the comfort of a modern town. Donal moves in with the Al-Amri family on the edge of the Sharqiyah Sands in Oman and is quickly put to work milking goats, collecting firewood in a treeless desert, delivering dates on a three-day camel trek and riding the family&amp;#039;s prize camel in a death-defying race meeting.\n\n3) Papua New Guinea \nDonal travels to Papua New Guinea to witness first hand how a Tribe lives, Donal experiences life first hand with the Insect tribe in Papua New Guinea. The Insect Tribe of Papua New Guinea were unknown to the outside world until 50 years ago and have a reputation as fearless crocodile hunters. Donal joins the warriors on a terrifying night-time hunt in dug out canoes, where the tribesmen think nothing of spearing crocodiles as big as their canoes. The tribe still uses seashells for money, but things are changing fast as the 21st century encroaches on their lives.\n\n4) Borneo \nOff the coast of Borneo he tracks down the Bajau Laut, a tribe of sea gypsies who are born, live and die on their boats, barely ever setting foot on land. They are true nomads who belong nowhere but the sea and have never been filmed before. Donal joins a family of 20 on their crowded boat where he must pay his way by free diving for fish. The sea gypsies can stay under water for minutes at a time but, as Donal discovers, it can be deadly dangerous.\n\nScreenshots\n\nTechnical Specs\n------------------------------\n\nVideo Codec: XviD MPEG-4 codec\nVideo Bitrate: 1930 KB/s\nVideo Aspect Ratio: 16:9\nVideo Resolution: 720 x 400\nAudio Codec: FAST Multimedia AG DVM (Dolby AC3)\nAudio BitRate: 192 KB/s (CBR)\nAudio Channels: 2 Ch\nRunTime: 00:48\nFramerate: 25 FPS\nNumber Of Parts: 4\nPart Size: 744 MB\nEncoded by: gavin63\nSubtitles: No TV Cap\nSource: DVB\n.\n\nLinks\n------------------------------\n\n1) Related Documentaries \n* Journeys to the Ends of the Earth\n* Around the World in 80 Treasures\n\n2) ed2k Links \n\n\n\n\n\n\nSource: http://docuwiki.net/index.php?title=Edge_of_Existence","torrent":{"xt":"urn:btih:aca1267ef9391ba9667d1d083ed3fde159f8394d","amp;dn":"Discovery.Edge.of.Existence.2of4.Oman.DVB.Xvid.AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aca1267ef9391ba9667d1d083ed3fde159f8394d","infoHashBuffer":{"type":"Buffer","data":[172,161,38,126,249,57,27,169,102,125,29,8,62,211,253,225,89,248,57,77]},"announce":[],"urlList":[]}}