{"title":"Between Women - Sharon Marcus.epub","uid":9396049,"size":5672619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad39b8f557bfd83d8c94a37c402204eb9e1feba9&amp;dn=Between+Women+-+Sharon+Marcus.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387984934,"description":"Women in Victorian England wore jewelry made from each other's hair and wrote poems celebrating decades of friendship. They pored over magazines that described the dangerous pleasures of corporal punishment. A few had sexual relationships with each other, exchanged rings and vows, willed each other property, and lived together in long-term partnerships described as marriages. But, as Sharon Marcus shows, these women were not seen as gender outlaws. Their desires were fanned by consumer culture, and their friendships and unions were accepted and even encouraged by family, society, and church. Far from being sexless angels defined only by male desires, Victorian women openly enjoyed looking at and even dominating other women. Their friendships helped realize the ideal of companionate love between men and women celebrated by novels, and their unions influenced politicians and social thinkers to reform marriage law.\n\nThrough a close examination of literature, memoirs, letters, domestic magazines, and political debates, Marcus reveals how relationships between women were a crucial component of femininity. Deeply researched, powerfully argued, and filled with original readings of familiar and surprising sources, Between Women overturns everything we thought we knew about Victorian women and the history of marriage and family life. It offers a new paradigm for theorizing gender and sexuality--not just in the Victorian period, but in our own.","torrent":{"xt":"urn:btih:ad39b8f557bfd83d8c94a37c402204eb9e1feba9","amp;dn":"Between+Women+-+Sharon+Marcus.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad39b8f557bfd83d8c94a37c402204eb9e1feba9","infoHashBuffer":{"type":"Buffer","data":[173,57,184,245,87,191,216,61,140,148,163,124,64,34,4,235,158,31,235,169]},"announce":[],"urlList":[]}}