{"title":"Battlefield 1942 The Complete Anthology","uid":4005713,"size":2538816714,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ad56ec6f1cafeff34f006ba2f9cbc0663b97933b&amp;dn=Battlefield+1942+The+Complete+Anthology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheApplication","files":-1,"time":1201814699,"description":"Battlefield 1942' is a 3D World War II first-person shooter (FPS) computer game  developed by Swedish company Digital Illusions CE and published by Electronic Arts for Microsoft Windows (2002) and Apple Macintosh (2004). The game can be played in singleplayer mode against computer game bots or in multiplayer mode against players on the Internet or in a Local Area Network. It is also a popular platform for mod  developers, with a large number of released modifications that alter the gameplay and theme.\n\nIn-game, players assume the role of one of five classes of infantry: Scout, Assault, Anti-Tank, Medic, and Engineer. Players also have the ability to fly various World War II fighter aircraft and bombers, navigate capital ships, submarines and aircraft carriers, man coastal artillery defenses, drive tanks, APCs |and jeeps, and take control of anti-aircraft guns and mounted machine guns.\n\nEach battle takes place on one of several maps located in a variety of places and famous battlefields in all of the major theaters of World War II: the Pacific, European, North African, and Eastern Fronts. Combat is always fought between the Axis Powers and the Allies. The location determines which nation-specific armies are used (for example, on the Wake Island map, it is Japan versus the United States, while on the Battle of Britain map, it is Germany versus the United Kingdom). The maps in Battlefield 1942 are based on real battles and are somewhat realistically portrayed.\n\n&quot;(c)&quot; Wikipedia\n\n+----------------------------------------------------------------------------------+\n\n\nInstructions:\n\n1. Mount the &quot;Battlefield 1942 CD1&quot; image using whatever mounting software you have.\n2. Leave at least Battlefield 1942 and the two expansions checked.\n3. Begin the install. When it asks for the second CD, mount &quot;Battlefield 1942 CD2&quot; and finish the install.\n4. When it asks you for CD3, that is the expansion &quot;Road to Rome&quot;. Therefore, mount that CD and install the expansion.\n5. After that another prompt will ask you for CD4; that is Secret Weapons of WWII image. Mount it and install it.\n6. At the very end of the installation (after all expansions) run the patch. Update the registry (prompt at the end) and play the game. That patch cracks all games for you\n\nPS - Make sure to use each keygen for each appropriate game. Keygens are sometimes detected as trojans by anti-virus software; they are NOT viruses, they just act like them in order to generate those keys.\n\n\n&gt;&gt;&gt;&gt;&gt; Thanks to superman101 for excellent instructions! &lt;&lt;&lt;&lt;&lt;&lt;\n\n","torrent":{"xt":"urn:btih:ad56ec6f1cafeff34f006ba2f9cbc0663b97933b","amp;dn":"Battlefield+1942+The+Complete+Anthology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad56ec6f1cafeff34f006ba2f9cbc0663b97933b","infoHashBuffer":{"type":"Buffer","data":[173,86,236,111,28,175,239,243,79,0,107,162,249,203,192,102,59,151,147,59]},"announce":[],"urlList":[]}}