{"title":"Boduf Songs - Burnt Up On Re-Entry [2013][EAC,log,cue. FLAC]","uid":8209238,"size":315045380,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ae3d43ebb7fd772bfbbf5c23e561de17a7e202ba&amp;dn=Boduf+Songs+-+Burnt+Up+On+Re-Entry+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1362195445,"description":"The dead air surrounding the shreds of melody and Mat Sweet's voice on Boduf Songs' early albums felt like it contained the weight of the world. However, on Burnt Up on Re-Entry, he's concerned with a different kind of space. As on his brilliant 2010 album This Alone Above All Else in Spite of Everything, Sweet adds more accompaniment to his compelling whispers, incorporating searing guitars and chittering electronics that suggest he's singing from a spacecraft, far from any other living beings. Burnt Up on Re-Entry begins with its boldest departure: &quot;Fiery the Angels Fell&quot; swells into thrash-worthy riffs as it pulses along to a brisk beat that feels twice as fast as any of Boduf Songs' previous tracks. Later, &quot;Song to Keep Me Still&quot; sounds like a devotional as well as the closest thing to a pop song that Sweet has written to date, while &quot;Whither Thou Goest Cretin,&quot; his most electronically enhanced track yet, pairs despair with a brittle drum pattern and a surprisingly pretty coda that drifts off into space. While the description &quot;dystopian rock with beats&quot; conjures up visions of Nine Inch Nails and Radiohead -- and fans of those artists may find a lot to like about this album -- Sweet retains Boduf Songs' essence even as he expands his reach. His deadpan, drawn-out vocals, which have remained constant from the skeletal electro-folk of his early days to these more elaborate sounds, remain the heart of his music; tracks without his voice, like the eerie sound collage &quot;Oh My Overlord&quot; or the robotic chanting of &quot;Drexelius Sick Man Quarles Emblemes Closed Heaven,&quot; add to the album's atmosphere but aren't as immediately gripping. As always, Sweet doesn't &quot;sell&quot; his lyrics. Instead, he presents terrible things and feelings so matter of factly that it's perversely comforting, as on &quot;Everyone Will Let You Down in the End,&quot; which lets its drums and guitars fall with a heavy inevitability, or &quot;Maggot Ending,&quot; a song about the &quot;end of the line&quot; that shows Sweet still uses silence like few others can. At first the cleaner, more detailed approach Sweet takes feels jarring and almost naked-sounding compared to the shadowy quality of his other albums, but &quot;A Brilliant Shaft of Light from Out of the Night Sky&quot; and &quot;Between the Palisades&quot; blend their instrumentation into slow-burning epics that carry a subtle menace, like a stare that's held just a little too long. Though Burnt Up on Re-Entry trades a little of his earlier work's singularity for a more flexible approach, it shows Sweet can defy expectations, and should pique the interest of anyone partial to metal's more experimental side or post-rock's heavier side.","torrent":{"xt":"urn:btih:ae3d43ebb7fd772bfbbf5c23e561de17a7e202ba","amp;dn":"Boduf+Songs+-+Burnt+Up+On+Re-Entry+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae3d43ebb7fd772bfbbf5c23e561de17a7e202ba","infoHashBuffer":{"type":"Buffer","data":[174,61,67,235,183,253,119,43,251,191,92,35,229,97,222,23,167,226,2,186]},"announce":[],"urlList":[]}}