{"title":"Scanning Microscopy for Nanotechnology - Techniques and Applicat","uid":15358037,"size":121222399,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae63b78bc9c5ba819e8211d6f7f91845054c0121&amp;dn=Scanning+Microscopy+for+Nanotechnology+-+Techniques+and+Applicat&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469002565,"description":"Scanning Microscopy for Nanotechnology - Techniques and Applications - W. Zhou, Z.L. Wang (Springer, 2006).pdf\r\n\r\nISBN 978-0-387-33325-0\r\n\r\nScanning electron microscopy (SEM) can be exploited not only for nanomaterials characterization but also integrated with new technologies for in-situ nanomaterials engineering and manipulation. Scanning Microscopy for Nanotechnology addresses the rapid development of these techniques for nanotechnology, in both technique and application chapters by leading practitioners. The book covers topics including nanomaterials imaging, X-ray microanalysis, high-resolution SEM, low kV SEM, cryo-SEM, as well as new techniques such as electron back scatter diffraction (EBSD) and scanning transmission electron microscopy (STEM). Fabrication techniques integrated with SEM, such as e-beam nanolithography, nanomanipulation, and focused ion beam nanofabrication, are major new dimensions for SEM application. Application areas include the study of nanoparticles, nanowires and nanotubes, three-dimensional nanostructures, quantum dots, magnetic nanomaterials, photonic structures, and bio-inspired nanomaterials. This book will appeal not only to a broad spectrum of nanomaterials researchers, but also to SEM development specialists","torrent":{"xt":"urn:btih:ae63b78bc9c5ba819e8211d6f7f91845054c0121","amp;dn":"Scanning+Microscopy+for+Nanotechnology+-+Techniques+and+Applicat","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae63b78bc9c5ba819e8211d6f7f91845054c0121","infoHashBuffer":{"type":"Buffer","data":[174,99,183,139,201,197,186,129,158,130,17,214,247,249,24,69,5,76,1,33]},"announce":[],"urlList":[]}}