{"title":"Baby Charles (2008)","uid":4126292,"size":63388487,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:afa615099dc3b4649000d10ddde66a77c5aeb179&amp;dn=Baby+Charles+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"danelectro","files":13,"time":1207805269,"description":" &lt;a href=&quot;http://www.babycharles.co.uk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.babycharles.co.uk/&lt;/a&gt;\n\n\n\nBaby Charles are a special band. Their funky music is simultaneously tight but loose, heavy but soulful and dirty... yet beautiful.\n\nFronted by soul sensation Dionne Charles; the guitar, bass, keys, drums, congas, flute, sax and trombone lay down the deeply funky tunes. Inspired by the late-sixties sounds from the likes of The J.B.s and The Meters, Baby Charles know how to deliver the soulful goods.\n\nTheir fans include some of the highest ranking funk djs including: Snowboy, Keb Darge, Jazzman Gerald, Monk One, and especially Andy Smith, who snapped up their debut 45 for his ?Let?s Boogaloo Vol 4? compilation, and got them to play at the album?s launch party at Cargo. Mark Lamarr was so impressed by their debut single, he invited the band to record six tracks live in session for his God?s Jukebox show on Radio 2.\n\nIn July 2007, Baby Charles supported The James Taylor Quartet at the Soul Cookers Hammond Funk Festival in Saint-Paul, Marseilles. That same funky month, the mixing of the band?s debut album was completed and sent to Mark Lamarr, who played their cover version of the Arctic Monkeys track ?I Bet You Look Good on the Dancefloor? on the Jonathan Ross Radio2 Show. Mr Lamarr has also kindly written the sleeve notes for the Baby Charles debut album, which is due for release by the Italian label Record Kicks in March 2008.\n\n---\n\nReleased on torrent by Daniel Poeira and poeiradiscos.blogspot.com\n\nSuppor this band by buying their albums, attending to their concerts, adding comments to their blog and myspace... anyway, do something instead of just buying things!","torrent":{"xt":"urn:btih:afa615099dc3b4649000d10ddde66a77c5aeb179","amp;dn":"Baby+Charles+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afa615099dc3b4649000d10ddde66a77c5aeb179","infoHashBuffer":{"type":"Buffer","data":[175,166,21,9,157,195,180,100,144,0,209,13,221,230,106,119,197,174,177,121]},"announce":[],"urlList":[]}}