{"title":"TiK ToK(Kesha) 320kbps+Lyrics-ANM","uid":6111060,"size":8115543,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b2a2d8f083a32043449b2d0351c78606b93c5ff1&amp;dn=TiK+ToK%28Kesha%29+320kbps%2BLyrics-ANM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AmpleNM","files":-1,"time":1295309507,"description":"\n                            TiK ToK(Kesha) 320kbps+Lyrics-ANM\n\n\n&quot;Tik Tok&quot; (styled as &quot;TiK ToK&quot;) is the debut single by American recording artist Kesha. The song was produced by Benny Blanco and Dr. Luke and co-written by Blanco, Dr. Luke and Kesha. It was released on August 7, 2009 as the lead single from Kesha's debut studio album, Animal. The initial writing of the song consisted of Kesha coming home half-drunk and stumbling after a night out partying. Kesha would usually write down a few words of a song, then the next morning, she would wake up with the story waiting to be told. The song's opening line came from an experience in which Kesha woke up one morning where she was surrounded by &quot;beautiful women&quot;, the experience made her think of Diddy being in a similar scenario. Lyrically, the song speaks about not letting anything bring you down.\nThe song received mixed reviews from music critics. Some praised the lyrics and celebration of party lifestyle, others have criticized the song for sounding &quot;irritating&quot;, and being too similar to other tracks performed by the likes of Lady Gaga, and Uffie. It achieved commercial success by topping the charts in eleven countries. The song performed best in the United States where it scored the biggest single-week sum of all time for a female artist selling 610,000 digital downloads in one week. As of July 2010 the single has sold 5 million downloads in the United States alone.\n\n\n\n\n\n\nReleased\tAugust 7, 2009\nFormat\t        Digital download\nRecorded\tConway Recording Studios, Los Angeles, California\nGenre\t        Dance-pop, electropop\nLength\t        3:20\nLabel\t        RCA\nWriter(s)\tKesha Sebert, Lukasz Gottwald, Benjamin Levin\nProducer\tDr. Luke, Benny Blanco\n\n\n\n\n\n","torrent":{"xt":"urn:btih:b2a2d8f083a32043449b2d0351c78606b93c5ff1","amp;dn":"TiK+ToK%28Kesha%29+320kbps%2BLyrics-ANM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2a2d8f083a32043449b2d0351c78606b93c5ff1","infoHashBuffer":{"type":"Buffer","data":[178,162,216,240,131,163,32,67,68,155,45,3,81,199,134,6,185,60,95,241]},"announce":[],"urlList":[]}}