{"title":"The Long and the Short and the Tall aka Jungle Fighters 1961 Dvd","uid":9825876,"size":1017499608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b2e633aac592c73c6dfdd00920dc4ae2d2ef7e5b&amp;dn=The+Long+and+the+Short+and+the+Tall+aka+Jungle+Fighters+1961+Dvd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xultfoad","files":1,"time":1395775840,"description":"The Long and the Short and the Tall aka Jungle Fighters 1961 DvdRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0054037/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0054037/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/The_Long_and_the_Short_and_the_Tall_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/The_Long_and_the_Short_and_the_Tall_(film)&lt;/a&gt;\n\nThe title is derived from the lyrics of a popular wartime ballad Bless 'Em All. This is, indeed, a war picture, set in Malaya. The British troops encamped therein believe they've gotten a break when they capture a Japanese scout (Kenji Takaki)--but it's all part of an enemy trap. The rest of the film concentrates on a battle of wills rather than bullets, though a few spurts of action keep the war-film aficionados happy. Played against the larger tapestry of the world conflict are the fluctuating tensions among the British soldiers themselves. Adapted from a play by Willis Hall, The Long and the Short and the Tall was released as both The Long the Short and the Tall (big whoop) and Jungle Fighters in the United States.\n\nIt's set in the Far East jungle during the Japanese campaign. A small patrol led by a sergeant (Richard Todd) is cut off. Suddenly 'sparks' makes radio contact and jabbering Japanese voices nearby cause them to realize that they're in a spot.\n\nA lone Japanese scout moves into their position and Todd insists that they must get him back to base alive as a source of information. The remainder want to bump him off with the solitary, surprise exception of a loudmouthed and brash private (Laurence Harvey).\n\nStandout performance comes from Harvey. It is dramatic license that enables him to behave in a way that would undoubtedly have had him up on a charge in a real situation.\n\nThe bewildered Jap, subtly played by Kenji Takaki, is another very sound performance. In fact there is no weak link in the cast. Todd is a dogged, worried sergeant; Richard Harris shapes very good as his righthand man, and Ronald Fraser is fine as a dour Scot.\n\nVIDEO\nSize.... 970mb\nDuration.... 01:41:27\nCodec.... divx\nFrame Width.... 720\nFrame Height.... 576\nData Rate.... 1209kbps\nFrame Rate.... 25 F/S\nAUDIO\nBit Rate.... 128kbps\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:b2e633aac592c73c6dfdd00920dc4ae2d2ef7e5b","amp;dn":"The+Long+and+the+Short+and+the+Tall+aka+Jungle+Fighters+1961+Dvd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2e633aac592c73c6dfdd00920dc4ae2d2ef7e5b","infoHashBuffer":{"type":"Buffer","data":[178,230,51,170,197,146,199,60,109,253,208,9,32,220,74,226,210,239,126,91]},"announce":[],"urlList":[]}}