{"title":"Wire Technology: Process Engineering and Metallurgy{BBS}","uid":6803027,"size":3701334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b304d253173fe01a5567415c6980ea6cf46209e3&amp;dn=Wire+Technology%3A+Process+Engineering+and+Metallurgy%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1320758439,"description":"Wire drawing is a metalworking process used to reduce the diameter of a wire by pulling the wire through a single, or series of, drawing die(s). The engineering applications of wire drawing are broad and far-reaching, including electrical wiring, cables, tension-loaded structural components, springs, paper clips and spokes for wheels.\n\nThis all-new, classical text is the first to explain the complex theory and sophisticated engineering concepts with relation to wire drawing in an accessible and universal way for practicing engineers.\n\nDesigned to facilitate the entry and training of new engineers and upgrade the professional practice of those already in the field in the face of increased product demands and tightening specifications, this essential resource by industry expert Roger Wright provides:\n\n    * A technical overview and introduction of engineering concepts related to wire drawing, suitable for beginners and practiced engineers looking to brush up on the theory behind the process\n    * An interface with basic engineering education so as to provide an accessible introduction for engineers new to the field\n    * Real-world worked examples, problems and protocols based on true life engineering scenarios and challenges\n    * Unique coverage of the author's own pass design and risk prediction calculations, developed through decades of research and wire industry consulting\n\nWhilst most competing titles are less practical in their approach and focus on either ferrous, non-ferrous or electrical, our book takes a universal approach more suited to the practicing engineer who needs knowledge of wire drawing across the board. Ideal for use as a complete insight into the process from start to finish or a dip-in resource for practical problem-solving, this versatile work-a-day guide, training tool and desk reference will help readers train their staff and adapt and improve processes at minimal cost for maximum performance.\n\n\n    * Provides a unique universal approach, covering ferrous and non-ferrous metals\n\n    * Authored by an internationally-recognized specialist in wire drawing with extensive academic and industry experience\n\n    * Real-world worked examples, problems and protocols based on true life engineering scenarios and challenges allow engineers to easily apply the theory to their workplace to improve processes, productivity and efficiency\n\n    * Compact, concise and practical in comparison to the large, competing handbook tomes that are overwhelming for beginners and impractical for day-to-day work use\n\n    * Ideal for use as a complete insight into the process from start to finish or as a dip-in resource for practical \n\n\nAbout the Author\nRoger Wright is a leading industry trainer and consultant specializing in wire technology and professor of materials engineering at the Rensselaer Polytechnic Institute, a major US engineering school. As an active metallurgical and manufacturing consultant with 30+ years' experience working with those in the wire drawing industry, Roger has the much sought after skill of introducing sophisticated theory and concepts in an accessible and practical way to help improve the work and efficiency of engineers involved with wire.\n\nProduct Details\n\n    * Hardcover: 332 pages\n    * Publisher: Butterworth-Heinemann; 1 edition (November 17, 2010)\n    * Language: English\n    * ISBN-10: 0123820928\n    * ISBN-13: 978-0123820921","torrent":{"xt":"urn:btih:b304d253173fe01a5567415c6980ea6cf46209e3","amp;dn":"Wire+Technology%3A+Process+Engineering+and+Metallurgy%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b304d253173fe01a5567415c6980ea6cf46209e3","infoHashBuffer":{"type":"Buffer","data":[179,4,210,83,23,63,224,26,85,103,65,92,105,128,234,108,244,98,9,227]},"announce":[],"urlList":[]}}