{"title":"Ocster Backup Pro v6.05 bilingual+serials","uid":6029142,"size":31426869,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b32df57fdb949b0157a9c09b2614f28d2462b2a5&amp;dn=Ocster+Backup+Pro+v6.05+bilingual%2Bserials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Slickinator","files":2,"time":1292012502,"description":"New in Version 6.05 bilingual\n &lt;a href=&quot;\nhttp://www.ocster.com/screenshots/ocster_backup_pro6_main_en.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ocster.com/screenshots/ocster_backup_pro6_main_en.png&lt;/a&gt;\n\n    * Quicker than ever: up to 600% faster backup speed*\n    * 1 : 1 File Copy: simple mirroring of files to other media\n    * Internet Explorer bookmark backup\n    * Mozilla Firefox backup: bookmarks, settings and add-ons\n    * Mozilla Thunderbird: backup emails, calenders, settings and add-ons\n    * Windows contacts backup\n    * New backup rules: more choice with extended filtering capabilities\n\nFeatures\n\n    * Fully Automatic: Creates fully automatic backups of your data\n    * Easy to use\n    * Fast backup speed\n    * Versioning: Easily access and restore different older versions of your files.\n    * Automatic Pausing: Backups are done in the background and are automatically paused to prevent them from slowing down other programs. \n\nVarious system characteristics are monitored, e.g. CPU usage, I/O usage, fullscreen applications, etc.\n    * Microsoft Outlook email and calendar backup (for Outlook 2003 or higher).\n    * Internet Explorer bookmark backup\n    * Mozilla Firefox backup: bookmarks, settings and add-ons\n    * Mozilla Thunderbird backup: emails, calenders, settings and add-ons\n    * Windows Contacts: Back up the Windows Contacts folder.\n    * 1 : 1 File Copy mode: Optional mode for simple mirroring of files to other media\n    * Comprehensive backup rules: More choice with extended filtering capabilities\n    * Stop &amp; Resume: Backups can be stopped and resumed. This is handy when the computer needs to be shut down, for example.\n    * Backup Reports: Detailed backup reports can be generated each time the backup is updated. The contents of the reports can be \n\nconfigured.\n    * Backup Report Emails: Backup reports can be automatically sent to an email address. That way you can be up-to-date on the state of \n\nyour backups even when you are on a business trip or if the computer is simply a server in your attic.\n    * Network support: Files and folders on network drives can also be backed up. The backup data can also be stored on network drives if \n\nthat is desired.\n    * Encryption: Backups are strongly encrypted and protected with a user password. The encryption algorithm can be configured, if that is \n\ndesired.\n    * Compression: Backups are compressed intelligently to save space. Different compression types are available: from fast ones with \n\nmoderate compression to slower ones with excellent compression.\n    * Scheduled: Backups can be started either automatically at scheduled times or manually by clicking a button.\n    * Storage Types: Backups can be stored on hard disk, USB sticks, network drives and Ocster Secure Storage.\n    * Supports Ocster Secure Storage:\n          o Stores the files in professional data centers\n          o Much safer than using hard disks or USB sticks\n          o The backups are protected against fire, water damage, lightning, theft, hurricanes, ...\n          o Multiple copies are kept in different locations\n          o The data is transmitted to the data centers via a highly secured internet channel\n          o Available for a small subscription fee.\n    * Incremental backup: after an initial full backup only the changes to the previous state are stored. This saves space and reduces \n\ntransfer times.\n    * Open File Support: Files and folders that are in use can be backed up as well.\n    * Hard Link and Symbolic Link Support: Hard links and symbolic links can be backed up and are properly restored as hard links and \n\nsymbolic links.\n    * Special Files: Compressed, encrypted and sparse files can also be backed up.\n    * Encryption Algorithms: Backup can be encrypted the following algithms: AES 256 Bit, AES 128 Bit, BlowFish, Cast-128\n    * Compression Algorithms: The software supports the following compression types: ZLib, LZMA Quick, LZMA Normal, LZMA Best\n    * Small File Optimization: Through smart uses of compression the software can achieve high compression rates, even with many small \n\nfiles.\n\nSystem Requirements\n\n    * Windows XP, Windows Vista, Windows 7, Windows Server 2003 or Windows Server 2008 (the 64 Bit version of each operating system \n\nis also supported)\n    * 512 MB RAM\n    * Free space on hard disk: ca. 125 MB\n\n* The exact value can vary because the speed depends on the file and folder structure of the data to back up. However, the new version is \n\nalways quite a lot faster than its predecessor. \n\nInstallation Info:\n1)install setup\n2)use one of the serials and click on middle of page above purchase and test\non enter key if you past that point click on help in the program and enter licence key \n3)enjoy from Slickinator","torrent":{"xt":"urn:btih:b32df57fdb949b0157a9c09b2614f28d2462b2a5","amp;dn":"Ocster+Backup+Pro+v6.05+bilingual%2Bserials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b32df57fdb949b0157a9c09b2614f28d2462b2a5","infoHashBuffer":{"type":"Buffer","data":[179,45,245,127,219,148,155,1,87,169,192,155,38,20,242,141,36,98,178,165]},"announce":[],"urlList":[]}}