{"title":"Erik Nordgren - The Bergman suites 1998","uid":6864209,"size":225616574,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b39cd910b0de0127628733b80d4836c61b06c029&amp;dn=Erik+Nordgren+-+The+Bergman+suites+1998&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1323030140,"description":"Erik Nordgren (1913-1992) studied the violin, conducting and composition at the Stockholm Royal Academy of Music, qualifying as a teacher in 1941. In 1948 he became recording consultant at Swedish EMI/HMV in Stockholm and from 1952 to 1967 he was music director at Svensk Filmindustri. From then until 1976 he was in charge of the orchestra section of the Swedish Broadcasting Corporation. His compositions include concertos for clarinet and for bassoon, in 1950 and 1966 respectively, a Chamber Symphony (1944), chamber music, including three string quartets, songs and a considerable quantity of electronic music created in his own sound studio. Nordgren wrote incidental music for some forty films directed by Ingmar Bergman, Alf Kjellin, Lars-Eric Kjellgren, Jan Troell, Gustav Molander and Alf SjÃƒÂ¶berg.\n\nOf Nordgren's seventeen scores written for Ingmar Bergman, Secrets of Women, Smiles of a Summer Night, The Seventh Seal and Wild Strawberries can be considered the most accomplished. The close collaboration between director and composer may be compared with that of Eisenstein and Prokofiev, Hitchcock and Herrmann, Fellini and Rota and Cocteau and Auric. It was based on friendship and on Nordgren's understanding of the necessity of compromise, as a film composer. A break between the two came when Bergman, after his marriage to the Estonian pianist KÃƒÂ¤bi Laretei, found himself dealing with music every day and in a totally different way. At that time Bergman began his involvement with opera as an assistant director and completely reassessed his conception of music, scoring his films thereafter mainly with instrumental music by Bach, Mozart and Chopin. The Pleasure Garden (1961) was the last original score that Nordgren wrote for Bergman.\n\n- - -\n\nErik Nordgren - The Bergman suites - the classic film music of Erik Nordgren 1998\n(Hong Kong Marco Polo)\n\n 1. Theme\n 2. Variation 1\n 3. Variation 2\n 4. Variation 3\n 5. Variation 4\n 6. Variation 5\n 7. Chaste Love\n 8. March\n 9. Galop\n10. The Coach\n11. Dangerous Wine\n12. Crisis\n13. Menuet\n14. Gavotte\n15. The Park\n16. Escape \n17. Emotions\n18. Memories\n19. Dreams\n20. Swindle and Deceit\n21. March\n22. The Face, film music- Galop\n23. Secret Chambers of the Heart\n24. Small-Town Affairs\n\n\nMusic from the films:\nKvinnors vÃƒÂ¤ntan (Women's waiting) (1-6)\nSommarnattens leende (Smiles of a summer night) (7-16)\nSmultronstÃƒÂ¤llet (Wild strawberries) (17-19)\nAnsiktet (The face) (20-22)\nLustgÃƒÂ¥rden (The garden of Eden) (23-24)\n\nPermormed by Slovak Radio Symphony Orchestra\nAdriano, dir.\n","torrent":{"xt":"urn:btih:b39cd910b0de0127628733b80d4836c61b06c029","amp;dn":"Erik+Nordgren+-+The+Bergman+suites+1998","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b39cd910b0de0127628733b80d4836c61b06c029","infoHashBuffer":{"type":"Buffer","data":[179,156,217,16,176,222,1,39,98,135,51,184,13,72,54,198,27,6,192,41]},"announce":[],"urlList":[]}}