{"title":"The Monstrosity of Christ - Zizek/Milbank","uid":8065363,"size":1180185,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b43220f0de89bc0cdc29279b1fc486e825791cfd&amp;dn=The+Monstrosity+of+Christ+-+Zizek%2FMilbank&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ArielC","files":1,"time":1359162074,"description":"Slavoj Å½iÅ¾ek/John Milbank - &quot;The Monstrosity of Christ: Paradox or Dialectic?&quot; \n\n\nThe MIT Press (2011)\n\nPDF\n\n320 Pages\n\n\n&quot;What matters is not so much that Å½iÅ¾ek is endorsing a demythologized, disenchanted Christianity without transcendence, as that he is offering in the end (despite what he sometimes claims) a heterodox version of Christian belief.&quot;--John Milbank\n\n&quot;To put it even more bluntly, my claim is that it is Milbank who is effectively guilty of heterodoxy, ultimately of a regression to paganism: in my atheism, I am more Christian than Milbank.&quot;--Slavoj Å½iÅ¾ek\n\n\nIn this corner, philosopher Slavoj Å½iÅ¾ek, a militant atheist who represents the critical-materialist stance against religion's illusions; in the other corner, &quot;Radical Orthodox&quot; theologian John Milbank, an influential and provocative thinker who argues that theology is the only foundation upon which knowledge, politics, and ethics can stand. In The Monstrosity of Christ, Å½iÅ¾ek and Milbank go head to head for three rounds, employing an impressive arsenal of moves to advance their positions and press their respective advantages. By the closing bell, they have not only proven themselves worthy adversaries, they have shown that faith and reason are not simply and intractably opposed. Å½iÅ¾ek has long been interested in the emancipatory potential offered by Christian theology. And Milbank, seeing global capitalism as the new century's greatest ethical challenge, has pushed his own ontology in more political and materialist directions. \n\nTheir debate in The Monstrosity of Christ concerns the future of religion, secularity, and political hope in light of a monsterful event--God becoming human. For the first time since Å½iÅ¾ek's turn toward theology, we have a true debate between an atheist and a theologian about the very meaning of theology, Christ, the Church, the Holy Ghost, Universality, and the foundations of logic. The result goes far beyond the popularized atheist/theist point/counterpoint of recent books by Christopher Hitchens, Richard Dawkins, and others. Å½iÅ¾ek begins, and Milbank answers, countering dialectics with &quot;paradox.&quot; \n\nThe debate centers on the nature of and relation between paradox and parallax, between analogy and dialectics, between transcendent glory and liberation. Slavoj Å½iÅ¾ek is a philosopher and cultural critic. He has published over thirty books, including Looking Awry, The Puppet and the Dwarf, and The Parallax View (these three published by the MIT Press). John Milbank is an influential Christian theologian and the author of Theology and Social Theory: Beyond Secular Reason and other books. Creston Davis, who conceived of this encounter, studied under both Å½iÅ¾ek and Milbank.","torrent":{"xt":"urn:btih:b43220f0de89bc0cdc29279b1fc486e825791cfd","amp;dn":"The+Monstrosity+of+Christ+-+Zizek%2FMilbank","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b43220f0de89bc0cdc29279b1fc486e825791cfd","infoHashBuffer":{"type":"Buffer","data":[180,50,32,240,222,137,188,12,220,41,39,155,31,196,134,232,37,121,28,253]},"announce":[],"urlList":[]}}