{"title":"How to Prepare Your Curriculum Vitae","uid":6501465,"size":499453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4e16982234a9ddaf602cbc9c8f6d8309f56dace&amp;dn=How+to+Prepare+Your+Curriculum+Vitae&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309261666,"description":"You've received your bachelor's degree and after careful consideration have decided to continue your education at graduate or professional school. When you get your application, however, you are stymied by the requirement to send a curriculum vitae. You've heard of it, but you thought only hopeful college professors had to have one. And you certainly have no idea how to go about writing one for yourself. You are not alone. Many applicants are surprised to find that what used to be required of academic job seekers is now essential for undergraduates applying to graduate and professional schools as well as those seeking employment in research, teaching, or management.\nHow to Prepare Your Curriculum Vitae provides an in-depth explanation of the components of the curriculum vitae as well as step-by-step instructions for condensing your career history into a concise biographical sketch that underscores your assets. You'll learn to assess your educational and noneducational skills, inventory your accomplishments, and present the information in a format that follows the latest document guidelines. In addition, this newly revised edition includes:\n\nTips on producing a scannable CV\nA new chapter on international CVs\nSample CVs for a wide range of academic majors and professions\nSample correspondence that gives you content and format guidance\nWith its targeted advice and easy-to-follow plan, How to Prepare Your Curriculum Vitae offers everything you need to know to create a CV that will produce results and advance your academic or professional career. --This text refers to an alternate edition.","torrent":{"xt":"urn:btih:b4e16982234a9ddaf602cbc9c8f6d8309f56dace","amp;dn":"How+to+Prepare+Your+Curriculum+Vitae","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4e16982234a9ddaf602cbc9c8f6d8309f56dace","infoHashBuffer":{"type":"Buffer","data":[180,225,105,130,35,74,157,218,246,2,203,201,200,246,216,48,159,86,218,206]},"announce":[],"urlList":[]}}