{"title":"BusyBox Pro v9.6.3 Final By bobiras2009","uid":7661395,"size":3444661,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:b5062a075ff0ac4909c8b2fde7f24643e143c64c&amp;dn=BusyBox+Pro+v9.6.3+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1348314753,"description":"Follow my uploads here:                                &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:                                 &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: Android version 2.1 and higher\nOverview: The fastest, most trusted, and most popular BusyBox installer and uninstaller! Over 2 million installs! Winner of best Utility Software award for Android via Handster. This is the ONLY Installer on the market that will allow you to remove Busybox (If supported on your phone) AND the only open sourced installer!\n\nA must have for any rooted phone! Almost EVERY rooted applications needs BusyBox to perform their magic, if you have a rooted phone then you need BusyBox.\n\nPro version contains no ads or nag screens, uninstall feature, custom tune feature, the ability to hand pick the applets you want, safety check for missing applets on start, and better overall support. The pro version will receive more frequent updates than the free version will.\n\nThis installer has the smallest Busybox binaries available, right around 700kb unlike the other installers which are over a meg. Also this installer does not require you to download anything extra like other installers do and thus works much faster.\n\nPlease note I did not write BusyBox! I wrote this installer, cross compiled BusyBox for Android. Please see the about menu option for more details or here: http://www.BusyBox.net\n\nBusyBox is a software application that provides many standard Unix tools, much like the larger (but more capable) GNU Core Utilities. BusyBox is designed to be a small executable for use with the Linux kernel, which makes it ideal for use with embedded devices. It has been self-dubbed &quot;The Swiss Army Knife of Embedded Linux&quot;.\n\nThis version includes 1.19.4, 1.19.3, 1.19.2, 1.18.4, and 1.18.5 no need to have more than that because it takes up space on your phone and each newer version will still contain the older features, unless I forgot to compile them in.\n\nLeave this installed if you always want to get the latest version of busybox!\n\ntags: busybox, utility, terminal, emulator, root, stericson, adb, toolbox, rom, unlock, jailbreak, root, linux, unix, shell, script, tools, android, installer, busybox installer, (Confirmed Amazon)\n\nWhat's in this version:\nv9.6.3\nfixed issues with telnet, ping, wget not resolving hostnames. You need to reinstall busybox again to fix this.\nFixed an issue with the loading time of smart install.\nv9.6.2\nFixed null pointer exception\n\n                                By bobiras2009\t\t\n","torrent":{"xt":"urn:btih:b5062a075ff0ac4909c8b2fde7f24643e143c64c","amp;dn":"BusyBox+Pro+v9.6.3+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5062a075ff0ac4909c8b2fde7f24643e143c64c","infoHashBuffer":{"type":"Buffer","data":[181,6,42,7,95,240,172,73,9,200,178,253,231,242,70,67,225,67,198,76]},"announce":[],"urlList":[]}}