{"title":"Dying Light DLC+FIXapplied Portable 3-2PLAY","uid":11674968,"size":9712178629,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b53d4aa2a96425046b6b40740921e36a4c278aed&amp;dn=Dying+Light+DLC%2BFIXapplied+Portable+3-2PLAY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":3,"time":1422817943,"description":"Hi new nice PC games fans and welcome to play this game with portability ...\n\n\nONLY CLOSE 20 MINUTES EXTRACTION, JUST 1 EXECUTABLE AND 2 FOLDERS ON THE GAME FOLDER : 1 WITH THE GAME AND THE OTHER WITH THE DLC, THE CRACKFIX IS ALREADY APPLIED ... HAVE FUN ...\n\non the 1st run the game starts automatically ...\n\nGameplay\n\nThe free running mechanics in Dying Light allow players to jump from one roof to another.\n\nDying Light is a zombie apocalypse-themed game set in an open world. Players traverse an expansive urban environment overrun by a vicious pandemic, scavenging the world for supplies and crafting weapons to defend against the growing infected population with a heavy focus on freerunning mechanics.[2]\n\nThe game is mostly melee-based with the majority of fighting using melee weapons. There are more than 100 weapons that can be used and more when players begin crafting new weapons.\n\nDying Light contains a dynamic day and night cycle. During the day, the player has to go out and scavenge for supplies to send back to the safe zones. They can set up traps, save random survivors, and make their way to airdrops. The infected are slow, apathetic, and easily visible, allowing the player to simply make their way past them, but their danger grows in numbers. The game features a dynamic weather system, which includes a variety of conditions such as fog, rain, and wind.\n\nWhen the sun goes down in Dying Light, the infected transform become much more dangerous. Without daylight, the senses of the infected become more acute and accurate. They gain the ability to sprint after the player and have increased damage, as well as the ability to jump and climb buildings like the player. In order for players to avoid contact, they need to use their 'Survivor Sense' to locate zombies in the dark to stay out of their way. If spotted and trying to escape their pursuers, players can use distractions and traps to lower their numbers. Players can use sound to lure the zombies. The player's main defense against the zombies is UV light, which slows down the infected.\n\n\n...enjoy","torrent":{"xt":"urn:btih:b53d4aa2a96425046b6b40740921e36a4c278aed","amp;dn":"Dying+Light+DLC%2BFIXapplied+Portable+3-2PLAY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b53d4aa2a96425046b6b40740921e36a4c278aed","infoHashBuffer":{"type":"Buffer","data":[181,61,74,162,169,100,37,4,107,107,64,116,9,33,227,106,76,39,138,237]},"announce":[],"urlList":[]}}