{"title":"The Emerald Forest -Leading Role: Powers Boothe","uid":4513879,"size":799014447,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b556094af3a0796a9367d559feccd5cd85d88450&amp;dn=The+Emerald+Forest+-Leading+Role%3A+Powers+Boothe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jazz3","files":2,"time":1226893441,"description":"Movie Description\nDirector John Boorman explores the tension between primitive and developed societies in this film starring Powers Boothe as engineer Bill Markham. While working on a dam on the Amazon in Brazil, Bill&amp;#039;s son, Tommy (William Rodriquez), disappears while wandering in the forest, presumably kidnapped by Indians. A decade elapses, and the father continues to comb the jungle in search of the missing child, while shepherding the dam to completion. During one such search, Bill is wounded after a showdown with the Fierce People, an Indian tribe led by Jacareh (Claudio Moreno), and is rescued by a blond Indian teenager he recognizes as his son (Charley Boorman). But his joy is dimmed by the engineer&amp;#039;s growing awareness that his son is now acculturated to a life as part of his tribe, the Invisible People, and as the husband of his wife, Kachiri (Dira Pass). For him, everything beyond the jungle is now &quot;ghost land.&quot; During the absence of the tribe&amp;#039;s men, the Fierce People stage a raid on their village, kidnapping their young women, including Kachiri, to sell as go-go dancers and prostitutes for the dam workers. A worthy and intriguing attempt to dramatize the depredations of a supposedly civilized race on the Amazon rainforest, the film is well acted by all, including Boorman&amp;#039;s son, Charley, and is graced by Philippe Rousselot&amp;#039;s magnificent photography of the Amazon jungle.\n\nCredits \nCast: Powers Boothe \nDirector: John Boorman \n\nSynopsis\nIn director John Boorman&amp;#039;s THE EMERALD FOREST, an American engineer searches for his son, who has been kidnapped by Indians in an Amazonian rain forest. When, at long last, he finds his boy, he discovers that his son has become part of another world--a world ","torrent":{"xt":"urn:btih:b556094af3a0796a9367d559feccd5cd85d88450","amp;dn":"The+Emerald+Forest+-Leading+Role%3A+Powers+Boothe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b556094af3a0796a9367d559feccd5cd85d88450","infoHashBuffer":{"type":"Buffer","data":[181,86,9,74,243,160,121,106,147,103,213,89,254,204,213,205,133,216,132,80]},"announce":[],"urlList":[]}}