{"title":"Terror by Night by Terry Caffey","uid":9653329,"size":1697395,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6b19f18e0738eabebcd0a88dbb8d32fa15db193&amp;dn=Terror+by+Night+by+Terry+Caffey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":3,"time":1393131071,"description":"\nAt 3:00 a.m. on March 1, 2008, Terry Caffey awoke to find his daughter's boyfriend standing in his bedroom with a gun. An instant later the teen opened fire, killing Terry's wife, his two sons, and wounding him 12 times, before setting the house ablaze. Terry fell into deep depression and planned to kill himself, but God intervened. \n\nUpon visiting his burned-out property, Terry noticed a scorched scrap of paper from one of his wife's books leaning against a tree trunk. The page read: &quot;[God, ] I couldn't understand why You would take my family and leave me behind to struggle along without them. And I guess I still don't totally understand that part of it. But I do believe that You're sovereign; You're in control.&quot; That page was like a direct message from God, and it turned Terry's life around.\n\nNow, one year later, Terry is remarried, the adoptive father of two young sons, and working to rebuild his relationship with his 17-year-old daughter, who is currently serving two life sentences in a Texas state penitentiary for her involvement in the crimes. &quot;Terror by Night&quot; tells the compelling story of how Terry Caffey found peace after his wife and sons were brutally murdered and his teenage daughter implicated in the crime. \n\nSharing never-before-told details about the night of the crime and subsequent murder trial, it explains how Terry was able to forgive the men who murdered his family, and how he even interceded with the prosecutors on their behalf. A powerful example of how the power of forgiveness can bring healing after tragedy and great loss, it shows how God can bring good out of even the darkest tragedies.\n\nGenre: Non Fiction | Biography","torrent":{"xt":"urn:btih:b6b19f18e0738eabebcd0a88dbb8d32fa15db193","amp;dn":"Terror+by+Night+by+Terry+Caffey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6b19f18e0738eabebcd0a88dbb8d32fa15db193","infoHashBuffer":{"type":"Buffer","data":[182,177,159,24,224,115,142,171,235,205,10,136,219,184,211,47,161,93,177,147]},"announce":[],"urlList":[]}}