{"title":"Early Ray Collection (Country Music Videos) [CARG]","uid":9293654,"size":787336378,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b7433c207b1c56972524c18e49f718d332f9dadc&amp;dn=Early+Ray+Collection+%28Country+Music+Videos%29+%5BCARG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hard2Find2","files":-1,"time":1386129398,"description":"CARG proudly presents Charlotte's premier country act is Early Ray! \n\n\nTo have only been playing 3 years, this energetic young act has already made a huge impact on the scene! Often compared to contemporary acts like Zac Brown Band and Jason Aldean, they can also scale their show back to a more throwback style in the vein of Old Crow Medicine Show and Mumford and Sons. Depending on what your needs are we can arrange the band and set to fit any occasion.\nThe band's approach is to invite you along and to be fully interactive with the party. Every song in their set is a sing- a-long classic that your crowd will enjoy! From Garth Brooks, Alabama, Hank Williams to current favorites Eric Church, Zac Brown, Jason Aldean etc. Early Ray will have you singing, dancing and having a blast! Knowing that not everyone may not know the country hits, Early Ray has taken it upon themselves to countrify many popular songs from other genres. Everything from Cee-Lo to Guns n Roses to Michael Jackson and Prince! There won't be anyone left out of the party! Their set list of over 300 songs grows weekly. Got a special request song you wanna hear? Don't be afraid to ask!\n\nEarly Ray released a cd of original music in June of 2012 and it charted at #38 in the Country charts and top 10 in the Country EP charts.\nVideos for their songs &quot;Where The Wild Things Are&quot; and &quot;Fried Pickles&quot; are currently in rotation on the GAC (Great American Country) network.\nTheir single, &quot;Fried Pickles&quot; is in current rotation on XM country radio.\n\nThey have played along side major acts such as Dierks Bently, Charlie Daniels, Pat Green, Montgomery Gentry, Kip Moore, Tate Stevens, Corey Smith and more!\n\nThey have played for Speed Street, Memorial Stadium 4th of July Fireworks, ACC Football, Carolina Panthers and the NFL, University of South Carolina, Clemson University, Winthrop University, UNCC, Knights Castle and the White Sox (MLB) and over a dozen sorority and fraternity events across the south east.\n\n\n\n\nSpecs:\n----------\nFile Type: Mp4's\nVideo Codec: H264 - MPEG-4-AVC (part10)(avc1)\nResolution: 1280x720\nFrame Rate: 30\nAudio Codec: MPEG AAC Audio(mp4a)\nChannels: Stereo\nLanguage: English\nSubtitles: None\nSample Rate: 48000 Hz\nTested with VLC on PC and WDTV Media Player on T.V.\n\n\n\niTunes:  &lt;a href=&quot;\nhttps://itunes.apple.com/us/album/country-music-ep/id529881720&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://itunes.apple.com/us/album/country-music-ep/id529881720&lt;/a&gt;\n\nOfficial Website:  &lt;a href=&quot;\nhttp://earlyray.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://earlyray.com/&lt;/a&gt;  \n\nFacebook:  \n\n\n\nMuch admiration to release groups and encoders such as BS, IMMERSE, EVOLVE, KILLERS, CtrlHD, DHD, 2HD, YesTV, MVGroup and KiNGS.\n\nBackups and other CARG releases can be found at ExtraTorrent, KickassTorrent and The Pirate Bay.\n\n-------------------------------------------------------------------------------\t\n\n","torrent":{"xt":"urn:btih:b7433c207b1c56972524c18e49f718d332f9dadc","amp;dn":"Early+Ray+Collection+%28Country+Music+Videos%29+%5BCARG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7433c207b1c56972524c18e49f718d332f9dadc","infoHashBuffer":{"type":"Buffer","data":[183,67,60,32,123,28,86,151,37,36,193,142,73,247,24,211,50,249,218,220]},"announce":[],"urlList":[]}}