{"title":"Socially Responsible Finance and Investing: Financial Institutio","uid":9307217,"size":20271540,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b86be6d856bfa9f2036eadba2506476550a098af&amp;dn=Socially+Responsible+Finance+and+Investing%3A+Financial+Institutio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1386290657,"description":"Description\nA detailed look at the role of social responsibility in finance and investing\nThe concept of socially responsible finance and investing continues to grow, especially in the wake of one of the most devastating financial crises in history. This includes responsibility from the corporate side (corporate social responsibility) as well as the investor side (socially responsible investing) of the capital markets. Filled with in-depth insights and practical advice, Socially Responsible Finance and Investing offers an important basis of knowledge regarding both the theory and practice of this ever-evolving area of finance.\n\nAs part of the Robert W. Kolb Series in Finance, this book showcases contributed chapters from professionals and academics with extensive expertise on this particular subject. It provides a comprehensive view of socially responsible foundations and their applications to finance and investing as determined by the current state of research.\n\nDiscusses many important issues associated with socially responsible finance and investing, like moral hazard and the concept of &quot;too big to fail&quot;\nContains contributed chapters from numerous thought-leaders in the field of finance\nPresents comprehensive coverage starting with the basics and bringing you through to cutting-edge, current theory and practice\nNow more than ever, we need to be mindful of the social responsibilities of all investment practices. The recent financial crisis and recession has changed the financial landscape for years to come and Socially Responsible Finance and Investing is a timely guide to help us navigate this difficult terrain.\n\n\nTable of Contents\nAcknowledgments ix\n\n1 Socially Responsible Finance and Investing: An Overview 1\nH. Kent Baker and John R. Nofsinger\n\nPART I Foundations and Key Concepts 15\n\n2 Stakeholder Analysis 17\nLloyd S. Kurtz\n\n3 Corporate Social Responsibility 39\nHeather Elms and Michelle Westermann-Behaylo\n\n4 Business Models and Social Entrepreneurship 55\nMichael A. Pirson\n\n5 Fiduciary and Other Legal Duties 69\nBenjamin J. Richardson\n\n6 International and Cultural Views 87\nAstrid Juliane Salzmann\n\nPART II Finance and Society 109\n\n7 Social, Environmental, and Trust Issues in Business and Finance 111\nChristoph F. Biehl, Andreas G. F. Hoepner, and Jianghong Liu\n\n8 Religion and Finance 143\nLuc Renneboog and Christophe Spaenjers\n\n9 Social Finance and Banking 161\nOlaf Weber and Yayun Duan\n\n10 Managerial Compensation 181\nKose John and Samir Saadi\n\n11 Externalities in Financial Decision Making 197\nJanis Sarra\n\n12 Real Estate and Society 213\nPiet Eichholtz and Nils Kok\n\n13 Federal Housing Policies and the Recent Financial Crisis 239\nRonnie J. Phillips and Kenneth Spong\n\n14 Predatory Lending and Socially Responsible Investors 257\nChristopher L. Peterson\n\n15 Use and Misuse of Financial Secrecy in Global Banking 275\nIngo Walter\n\nPARTIII Corporate Engagement 297\n\n16 Corporate Social Responsibility and Corporate Governance 299\nLorenzo Sacconi\n\n17 Measuring Responsibility to the Different Stakeholders 323\nAmir Rubin and Eran Rubin\n\n18 Corporate Philanthropy 341\nJanet Kiholm Smith\n\n19 Institutional Investor Activism 359\nDiane Del Guercio and Hai Tran\n\n20 Social Activism and Nongovernmental Organizations 381\nJonathan P. Doh and Deborah Zachar\n\nPART IV Socially Responsible Investing 403\n\n21 Corporate Socially Responsible Investments 405\nJohn R. Becker-Blease\n\n22 SRIMutual Fund and Index Performance 425\nHalil Kiymaz\n\n23 Performance Implications of SR Investing: Past versus Future 443\nNadja Guenster\n\n24 Money-Flows of Socially Responsible Investment Funds around theWorld 455\nLuc Renneboog, Jenke Ter Horst, and Chendi Zhang\n\nAnswers to Chapter Discussion Questions 479\n\nIndex 503\n\n\nAuthor Information\nH. KENT BAKER, PhD, CFA, CMA, is University Professor of Finance and Kogod Research Professor at the Kogod School of Business at American University, Washington, D.C. As one of the most prolific finance academics, he has published 16 books, and more than 150 refereed articles in such publications as the Journal of Finance, Journal of Financial and Quantitative Analysis, Financial Management, Financial Analysts Journal, Journal of Portfolio Management, and Harvard Business Review. He has consulting and training experience with more than 100 organizations. Professor Baker holds a BSBA from Georgetown University; MEd, MBA, and DBA degrees from the University of Maryland; and a MA, MS, and two PhDs from American University. He also holds CFA and CMA designations.\n\nJOHN R. NOFSINGER is a Professor of Finance and Nihoul Faculty Fellow at Washington State University. He is one of the world's leading experts in behavioral finance and is a frequent speaker on this topic and socially responsible finance at investment management conferences, universities, and academic conferences. Professor Nofsinger has also published more than 50 articles in scholarly and practitioner journals. His research has appeared in the Journal of Finance, Journal of Business, Journal of Financial and Quantitative Analysis, Journal of Corporate Finance, Journal of Banking and Finance, Financial Management, Financial Analysts Journal, Journal of Behavioral Decision Making, and many others. Professor Nofsinger earned a PhD in finance from Washington State University.","torrent":{"xt":"urn:btih:b86be6d856bfa9f2036eadba2506476550a098af","amp;dn":"Socially+Responsible+Finance+and+Investing%3A+Financial+Institutio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b86be6d856bfa9f2036eadba2506476550a098af","infoHashBuffer":{"type":"Buffer","data":[184,107,230,216,86,191,169,242,3,110,173,186,37,6,71,101,80,160,152,175]},"announce":[],"urlList":[]}}