{"title":"100.Year.Old.Drivers.2016.07.20.Rebooted.s03e02.EN.SUB.MPup","uid":15378768,"size":551851171,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b89b7ea46daff64c01f92eafe4001a16b9ca8aac&amp;dn=100.Year.Old.Drivers.2016.07.20.Rebooted.s03e02.EN.SUB.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1469213176,"description":"100.Year.Old.Drivers.2016.07.20.Rebooted.s03e02.EN.SUB.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\nSize: 896x504\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nIn the second episode, romance is in the air as we follow 98-year-old Joseph Batty-Peirson playing the dating game. He's still got an eye for the ladies, and says: &quot;When the twinkle goes out of my eye for the ladies, I shall turn up my toes and die.&quot;\r\n \r\nHe wants to find a wealthy widow, and his internet dating profile sparks some interest. But Joseph has lied about his age, hoping to pass himself off as 83. Will he get away with it and find true love?\r\n \r\nThere are some familiar faces from previous series, including love-birds Ken and Edna Medlock, who have a combined age of 200. Last year, Edna was forced to move into a care home 200 miles from Ken, but has now returned and is determined to stay - especially as the pair are driving out for a date on their 76th wedding anniversary. Edna says: &quot;I wanted to get back to Ken as I worried about him a bit - he was on his own up here. It's much better being back here with Ken, because I can shout at him now.&quot;\r\n \r\nIn Ireland, 102-year-old Michael O'Connor uses his car to get to the shops and isn't planning to give up his keys just yet. He says: &quot;I would live driving, I would sleep driving, I would eat driving. I love driving.&quot;\r\n \r\nOur other drivers face challenges. 104 year-old Eileen Ash loves to go out and about in her little yellow mini, but for the first time in her life has been prevented from doing so by sciatica. Desperate to regain her independence she is following a rigorous physio and exercise regime to get fit again. She says: &quot;I realise now how difficult it is for people, their legs go, their knees go, they can't do this and they must be terribly frustrated, You don't feel that you're living, you feel that the end is coming.&quot;\r\n \r\nPaul Freedman's son Martin is worried because his 91-year-old dad's car is covered in dents and scrapes. Paul says: &quot;When you're driving, you are your own governor, it's nice to be independent and I don't think I've got any driving bad habits at all.&quot;\r\n \r\nSo concerned is Martin that now Paul must prove he's safe to stay on the road, or have the keys taken off him. Martin says: &quot;I've had a look at dad's car and I'm a little bit concerned about the scrapes and the dents that he has on there. If you ask him, he would probably say everyone else did it and it's amazing how many people knock into his car.&quot;\r\n \r\nAnd 96-year-old British pensioner Charles Eugster drives through heavy snow in Switzerland and puts himself through a punishing training regime to pass the mandatory Swiss physical examination for drivers over 70, done every two years. He says: &quot;I did meet a physician who said that people over 90 shouldn't be on the road, just like that. He only allowed me to pass the examination, how shall I put it, through gritted teeth.&quot;","torrent":{"xt":"urn:btih:b89b7ea46daff64c01f92eafe4001a16b9ca8aac","amp;dn":"100.Year.Old.Drivers.2016.07.20.Rebooted.s03e02.EN.SUB.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b89b7ea46daff64c01f92eafe4001a16b9ca8aac","infoHashBuffer":{"type":"Buffer","data":[184,155,126,164,109,175,246,76,1,249,46,175,228,0,26,22,185,202,138,172]},"announce":[],"urlList":[]}}