{"title":"Odin Sphere [Ntsc], Ps2","uid":5850960,"size":2703892423,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:b8e92ae28c785ca2dfae75044d75bde76d22209e&amp;dn=Odin+Sphere+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1285384609,"description":"Odin Sphere for the Ps2                                            Rel. 05/22/2007\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        RPG\nRating:        T (Teen)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nRelease Notes: This game is awesome, hope you like.\n\n\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nOdin Sphere is a side-scrolling action game with RPG elements, featuring a combination of 2D and 3D graphics. The game was designed as a spiritual successor to Atlus' own Princess Crown, and features the same kind of modular animation system, allowing for extremely smooth and varied motion for even the largest characters.\n\nThe action gameplay is similar to Princess Crown, but does not limit enemy encounters to one-on-one fights, instead, all fighting happens in real-time as the player progresses through circular areas. Upon defeating enemies, the player is rewarded with items and experience in order to level up the attack strength and magic capabilities of the character. Players can also plant seeds during combat that will grow as they absorb Phozons released by defeated enemies, eventually producing edible fruit. Phozons can also be absorbed by the character to power up their weapon. \n\nThe game features 5 distinct playable characters, each with his or her own storyline intertwined into one epic tale loosely based on Richard Wagner's Der Ring des Nibelungen.\n\n\nFeatures:\n\n* Gorgeous hand-drawn artwork and animations! \n\n* Intense side-scrolling action with astonishing attacks and magic effects! \n\n* Fully-voiced dialog that heightens the drama! \n\n* Fantastic bosses that tower over the heroine! \n\n* A robust cooking and alchemy system that can be used to create powerful attack \n  and recovery items.\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:b8e92ae28c785ca2dfae75044d75bde76d22209e","amp;dn":"Odin+Sphere+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8e92ae28c785ca2dfae75044d75bde76d22209e","infoHashBuffer":{"type":"Buffer","data":[184,233,42,226,140,120,92,162,223,174,117,4,77,117,189,231,109,34,32,158]},"announce":[],"urlList":[]}}