{"title":"Sticky Password PRO 6.0.5.415","uid":7736656,"size":14147654,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b9df1cab373a5bacdceb81f7eb771c65dd0b1209&amp;dn=Sticky+Password+PRO+6.0.5.415&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1350502065,"description":"Sticky Password Pro is a full-featured password manager designed to help you log into web accounts automatically, without having to look for the credentials yourself. The application is suited with support for automatic filling of the data as well as capturing user name and password from login pages.\nBesides safely keeping passwords and user names, Sticky Password also lets you store bookmarks as well as identities and secure memos. This comes in extremely handy especially when you create a portable version of the application and carry it on a removable device in order to use on different computers.\nAccess to the data can be protected through a master password, but additional options are available, such as detection of a Bluetooth or USB device.\nOne of the advantages available in Sticky Password is that it can work with a great number of web browsers, from the popular IE, Chrome, Opera or Firefox to less known ones such as Maxthon, Flock, or SeaMonkey. It integrates via its own add-on - you are prompted to install it in the browsers available on the system.\nSince the application can detect the credential fields on a web page filling them with the required information is done automatically. Adding a new entry to the database is also automatic.\nSticky Password features an import function which helps you easily transfer credentials stored in PWS, XML or INI format from a different password manager or from a web browser into the application. Export is also available as XML, HTML or plain text.\nThe built-in password generator lets you create countersigns as lengthy as 99 characters. It also features a tool that assesses the strength of the generated string and a history section.\nHandling Sticky Password does not pose any difficulty and it is a useful tool especially for those with large collections of login credentials.\n\nWHAT'S NEW IN VERSION Build 6.0.5.415 (October 9, 2012)\n\nfadded Dutch language\nadded support for Firefox/Thunderbird 17 and Seamonkey 2.14\nadded support for Mail.ru Agent 6.0\nadded localized Spanish default Secure Memo templates\nfixed Sticky Password not starting after upgrade from previous version\nfixed Sticky Password not working with applications under limited rights Windows XP user account\nfixed import from KeePass CSV files\nfixed imported items not showing on Groups tab\nfixed not working resetting password expiration reminders from systray balloon\nfixed issue when Firefox extension stops working if portable version is run after desktop version\nfixed slow performance in Firefox under certain circumstances\nfixed inactive or invisible button in Firefox under certain circumstances\nfixed new Identity not marked as active in FREE version\nfixed Remove Limitations dialog displaying too often under certain circumstances in FREE version\nvarious GUI and internal performance improvements\nfixed support for autofill on many websites","torrent":{"xt":"urn:btih:b9df1cab373a5bacdceb81f7eb771c65dd0b1209","amp;dn":"Sticky+Password+PRO+6.0.5.415","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9df1cab373a5bacdceb81f7eb771c65dd0b1209","infoHashBuffer":{"type":"Buffer","data":[185,223,28,171,55,58,91,172,220,235,129,247,235,119,28,101,221,11,18,9]},"announce":[],"urlList":[]}}