{"title":"Tyranny of Guilt; An Essay on Western Masochism (2010).pdf","uid":11470425,"size":2364508,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb1ab576c9c3beb2ba6b78e19312e5814dd736c6&amp;dn=Tyranny+of+Guilt%3B+An+Essay+on+Western+Masochism+%282010%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"interuniversal","files":-1,"time":1416075972,"description":"\nTyranny of Guilt; An Essay on Western Masochism\n\nAuthor: Pascal Bruckner\n\nTranslated by: Steven Rendall\n\nISBN: 9780691143767\n\nPublisher:Princeton University Press\n\nFascism, communism, genocide, slavery, racism, imperialism--the West has no shortage of reasons for guilt. And, indeed, since the Holocaust and the end of World War II, Europeans in particular have been consumed by remorse. But Pascal Bruckner argues that guilt has now gone too far. It has become a pathology, and even an obstacle to fighting today's atrocities. Bruckner, one of France's leading writers and public intellectuals, argues that obsessive guilt has obscured important realities. The West has no monopoly on evil, and has destroyed monsters as well as created them--leading in the abolition of slavery, renouncing colonialism, building peaceful and prosperous communities, and establishing rules and institutions that are models for the world. The West should be proud--and ready to defend itself and its values. In this, Europeans should learn from Americans, who still have sufficient self-esteem to act decisively in a world of chaos and violence. Lamenting the vice of anti-Americanism that grips so many European intellectuals, Bruckner urges a renewed transatlantic alliance, and advises Americans not to let recent foreign-policy misadventures sap their own confidence. This is a searing, provocative, and psychologically penetrating account of the crude thought and bad politics that arise from excessive bad conscience","torrent":{"xt":"urn:btih:bb1ab576c9c3beb2ba6b78e19312e5814dd736c6","amp;dn":"Tyranny+of+Guilt%3B+An+Essay+on+Western+Masochism+%282010%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb1ab576c9c3beb2ba6b78e19312e5814dd736c6","infoHashBuffer":{"type":"Buffer","data":[187,26,181,118,201,195,190,178,186,107,120,225,147,18,229,129,77,215,54,198]},"announce":[],"urlList":[]}}