{"title":"The Beatles - Your Mother Should Know [original promo].VOB","uid":11624531,"size":162056192,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bb22680ceab52703c60ae385fee25dba4ee1587e&amp;dn=The+Beatles+-+Your+Mother+Should+Know+%5Boriginal+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1417603380,"description":"The Beatles - Your Mother Should Know [original promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Your Mother Should Know&quot; is a song by the Beatles from their 1967 record Magical Mystery Tour, released in the US as an LP on 27 November 1967 and in the UK as a double-EP on 8 December 1967. It was written by Paul McCartney (credited to Lennon and McCartney) based on a line from the screenplay for A Taste of Honey. Paul McCartney played the song live for the first time ever on his 2013 Out There Tour.\n\nMcCartney said he wrote it as a production number for the movie Magical Mystery Tour, supporting an old-fashioned dance segment that starts with the Beatles coming down a grand staircase in white tuxedoes. After they descend, Boy Scouts, RAF cadets and other groups march through. John Lennon, George Harrison, and Ringo Starr are wearing red carnations, while McCartney's is black. The carnation difference contributed to the &quot;Paul is dead&quot; controversy.\n &lt;a href=&quot;\nhttp://bayimg.com/aaimGaAGA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/aaimGaAGA&lt;/a&gt;\n\nThe sequence was spoofed by &quot;Weird Al&quot; Yankovic as a part of his video for UHF.\n\nThe song was recorded in four sessions on 22 and 23 August, and on 16 and 29 September 1967. The remake from 16 September was left unused, and overdubs layered on the best take from 22 August. Mixing did not go any more smoothly, with sessions on 29 &amp; 30 September, and 7 November 1967.\n\n22 and 23 August sessions took place at Chappell Recording Studios because EMI Studios was unavailable that night. The remaining sessions were all at Abbey Road. It was during the latter Chappell Studio session that manager Brian Epstein made his last visit to a Beatles recording session before his death.\n\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Your_Mother_Should_Know&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Your_Mother_Should_Know&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/IAIlhaaGA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/IAIlhaaGA&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bits]\n   Duration: 00:02:33\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.7\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:bb22680ceab52703c60ae385fee25dba4ee1587e","amp;dn":"The+Beatles+-+Your+Mother+Should+Know+%5Boriginal+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb22680ceab52703c60ae385fee25dba4ee1587e","infoHashBuffer":{"type":"Buffer","data":[187,34,104,12,234,181,39,3,198,10,227,133,254,226,93,186,78,225,88,126]},"announce":[],"urlList":[]}}