{"title":"The Descent - Jeff Long","uid":8891992,"size":2104321,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bcd2cc38532ed13625c1ac9185a6423b1f12abb1&amp;dn=The+Descent+-+Jeff+Long&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheRose88","files":1,"time":1378604291,"description":"The Descent - Jeff Long (epub)\n\n\nIn a high Himalayan cave, among the death pits of Bosnia, in a newly excavated Java temple, Long's characters find out to their terror that humanity is not alone--that, as we have always really known, horned and vicious humanoids lurk in vast caverns beneath our feet. This audacious remaking of the old hollow-earth plot takes us, in no short order, to the new world regime that follows the genocidal harrowing of Hell by heavily armed, high-tech American forces. An ambitious tycoon sends an expedition of scientists, including a beautiful nun linguist and a hideously tattooed commando former prisoner of Hell, ever deeper into the unknown, among surviving, savage, horned tribes and the vast citadels of the civilizations that fell beneath the earth before ours arose. A conspiracy of scholars pursues the identity of the being known as Satan, coming up with unpalatable truths about the origins of human culture and the identity of the Turin Shroud, and are picked off one by bloody one. Long rehabilitates, madly, the novel of adventures among lost peoples--occasional clumsiness and promises of paranoid revelations on which he cannot entirely deliver fail to diminish the real achievement here; this feels like a story we have always known and dreaded.","torrent":{"xt":"urn:btih:bcd2cc38532ed13625c1ac9185a6423b1f12abb1","amp;dn":"The+Descent+-+Jeff+Long","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcd2cc38532ed13625c1ac9185a6423b1f12abb1","infoHashBuffer":{"type":"Buffer","data":[188,210,204,56,83,46,209,54,37,193,172,145,133,166,66,59,31,18,171,177]},"announce":[],"urlList":[]}}