{"title":"James Alan Gardner - Radiant (League of Peoples #7)","uid":13114706,"size":217408873,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bd25a0ef9b6a50186b43d5a43f90d69791913c3d&amp;dn=James+Alan+Gardner+-+Radiant+%28League+of+Peoples+%237%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":1,"time":1451550646,"description":"James Alan Gardner broke onto the sf scene with his debut novel, Expendable, which won him numerous fans for its blend of wry humor and fast-paced action set in a world where the flawed are designated as society's explorers. Now he makes his long-awaited hardcover debut with what might be his best book yet....\r\n\r\nExplorer Third Class Youn Sue is Expendable - a member of the highly skilled and highly disposable Explorer Corps trained to undertake hazardous missions so that the rest of humanity need not be upset by their (almost-certain) deaths. With her partner, Tut, Youn is sent to rescue an innocent planet from the extremely dangerous sentient Balrog. But how do you defeat an alien intelligence so advanced that it literally knows what you will do before you do ... especially when it has its own sinister plans?\r\n\r\nJoining forces with none other than the fabled Admiral Festina Ramos, Youn discovers that this is just the Balrog's opening gambit, and its next move could destroy them all. Fighting to stop the Balrog and save Youn's life, they head to an eerie, seemingly deserted planet. But this innocuous paradise has its own deadly secrets - including one that will destroy thousands if they cannot prevent it - and, perhaps, even the true plan behind the Explorers themselves.\r\n\r\n\r\n\r\nNarrated by: Katherine Gibson\r\nLength: 14 hrs and 33 mins \r\nFormat: M4A\r\nBitrate: 32 Kbps\r\nUnabridged Audiobook\r\nRelease Date:10-01-12\r\nPublisher: Audible Studios","torrent":{"xt":"urn:btih:bd25a0ef9b6a50186b43d5a43f90d69791913c3d","amp;dn":"James+Alan+Gardner+-+Radiant+%28League+of+Peoples+%237%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd25a0ef9b6a50186b43d5a43f90d69791913c3d","infoHashBuffer":{"type":"Buffer","data":[189,37,160,239,155,106,80,24,107,67,213,164,63,144,214,151,145,145,60,61]},"announce":[],"urlList":[]}}