{"title":"Spore Creatures (E) NDS","uid":4446799,"size":19983912,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:bd90c850a31d5bea5ca12781e7ed08433e6532b2&amp;dn=Spore+Creatures+%28E%29+NDS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xXSasoriXx","files":1,"time":1224085048,"description":"Save your species and the entire Galaxy in Spore Creatures. Guide and evolve your custom creature, starting as a simple creature and exploring your surroundings. Meet, befriend or fight other creatures in a number of unique Touch Screen based activities. As the story unfolds, evolve your creature&amp;#039;s look and add to its abilities by collecting and adding parts in the Creature Creator. Eventually uncover the mystery of the Galaxy&amp;#039;s troubles, and work to set things right. Share your creatures with other Spore Creatures players via Nintendo Wi-Fi Connection. You can store over 30 of your favorite creatures that might appear as characters in your game. Unlock cheats and additional parts by earning over 50 badges during gameplay. Spore Creatures for the DS is a unique game, custom-made for the Nintendo DS platform to take full advantage of the popular stylus and Touch Screen features. \n\nStore over 30 of your favorite creatures who might appear as characters in your game Unlock cheats and additional parts by earning over 50 badges during gameplay Custom-made for the Nintendo DS platform to take full advantage of the popular stylus and Touch Screen features ","torrent":{"xt":"urn:btih:bd90c850a31d5bea5ca12781e7ed08433e6532b2","amp;dn":"Spore+Creatures+%28E%29+NDS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd90c850a31d5bea5ca12781e7ed08433e6532b2","infoHashBuffer":{"type":"Buffer","data":[189,144,200,80,163,29,91,234,92,161,39,129,231,237,8,67,62,101,50,178]},"announce":[],"urlList":[]}}