{"title":"Diablo II Median XL Mod.exe","uid":5679700,"size":1884672104,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:be570894b45da9287e586572e265340bfad70bd9&amp;dn=Diablo+II+Median+XL+Mod.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1278741794,"description":"This is a stand-alone version of Diablo 2: Lord of Destruction with Median XL Mod set as default. \n\nTo play original Diablo 2, just replace the file &quot;Patch_D2.mpq&quot; in the folder Original Diablo 2 Mod directory with the one in the folder. You might want to backup the original first in case you want to go back. The same goes true for the other mods also included in this torrent.\n\nSince this is a mod, multiplayer does not work on Battle.net. Instead, you can find other Median XL players using Hamachi. Information can be found at the following link:\n\n\nWHAT IS MEDIAN XL?\n\nOverview\n\nMedian XL is the most popular mod, or unofficial modification, for Diablo II Lord of Destruction. It modifies the game by replacing character skills, improving items and monsters, and adding new uberquests.\n\nSo is this a cheat?\n\nMods are not cheats. A cheat makes the game easier. Median XL turns it into an entirely new game...\n\nFeatures\n\no New skill trees with 30 brand new skills per class.\nBored with Blessed Hammer? Median XL offers brand new skill trees. Each class has 25 main skills, 3 uberskills and 2 challenge reward skills. If you ever wanted a crossbow necromancer or summoner amazon, here is your chance!\n\no Improved monsters.\nWhen was the last time a frog killed you? The monsters are much more aggressive and dangerous, and many have learned various new tricks. From quill rats with homing spikes to invisible templars, the monsters will pose a much tougher challenge.\n\no Elite and heroic monsters.\nIf the normal monsters are tricky, the elites will have you run for your life. Featuring their own unique attacks and improved statistics, elite and heroic monsters are a match for the strongest heroes.\n\no 30 new uberquests for high level characters.\nForget Battle.net and 'Uber Tristram', Median XL has 22 more uberbosses and 8 special uberlevels for high level characters. Defeating them on the highest difficulty yields powerful unique charms.\n\no New base items. Six quality tiers.\nMedian XL features many new class-specific items. Additionally, item stats have been rebalanced and there are now six tiers of item quality, each with better stats than the last. Rumours persist of even stronger Sacred items...\n\no New and improved gems and runes.\nMore gems, more runes and the existing gems and runes have been improved. Plentiful random sockets on items offer a powerful way to customise your items.\n\no Enhanced magic and rare items.\nBetween the improved affix pool and the addition of powerful new affixes including percentage based attribute bonuses, rares are a much improved game option.\n\no An assortment of new uniques and sets.\nMedian XL features 475 new uniques and 28 new sets. Many of the uniques and all of the sets can only drop in special difficult areas.\n\no An assortment of new runewords.\nThere are exactly 310 brand new runewords, each requiring only a single rune. You can fill the other sockets with jewels for your convenience.\n\no New and improved cube recipes.\nMedian XL offers many powerful new cube recipes including a revolutionary crafting system.\n\no Honorific items.\nCreate blank items and enchant them yourself. Ever wanted to make your very own uniques? Now you can.\n\no Special challenges for expert players.\nBeating the game is only half the fun! Reach certain milestones in the game to obtain a special reward.\n\no Rebalanced drop rates to make good items more common.\nYou may actually see a Zod now.\n\no And much more...\n\nHave fun with this Mod as I have. Remember to seed as long as possible.","torrent":{"xt":"urn:btih:be570894b45da9287e586572e265340bfad70bd9","amp;dn":"Diablo+II+Median+XL+Mod.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be570894b45da9287e586572e265340bfad70bd9","infoHashBuffer":{"type":"Buffer","data":[190,87,8,148,180,93,169,40,126,88,101,114,226,101,52,11,250,215,11,217]},"announce":[],"urlList":[]}}