{"title":"Bodybuilding - Arnold - Early Years.avi","uid":3916376,"size":734026534,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf07245574d416049e6c3883ab3fc623ea45fbaf&amp;dn=Bodybuilding+-+Arnold+-+Early+Years.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SamStone","files":1,"time":1196510065,"description":"Apart from the 73 minutes of early contest and outdoor posing footage of Arnold and Franco, the bonus material from this collector&amp;#039;s DVD includes more recent out-takes, on-stage and behind the scenes video from the Arnold Classic.\n\nFirstly we see Arnold on stage in England aged 19 on the 28th of January 1967, doing curls and then guest posing. Next aged 20 while outdoors in a garden he pumps up with DB curls before posing. This includes closeups of his amazing arms and is the earliest Arnold colour footage we know of.\n \nIn 1970 you see Arnold as he wins his final NABBA Universe in the Pro class. Also seen briefly are Draper, Zane, Columbu, Coe, Beckles and more. This is followed by brief highlights from the 1970 Mr Olympia. The Olympia footage is poorly lit but included in the DVD as it is so rare. See Joe present the trophy to Arnold at this event.\n \nA real highlight is Arnold guest posing aged 23 in USA along with Franco posing at the same event.\n \n1972 poolside on the Gold Coast in sunny Australia, Arnold and Franco pump and pose both individually and duo in a superb in-depth segment including more great closeups of Arnold&amp;#039;s huge arms. No other similar outdoor posing footage of Arnold was ever recorded in his career. \n\n1972 was a very big year for Arnold as we see him defeat Sergio at the 72 Mr Olympia in Essen, Germany. This segment runs around 10 minutes and is the only known footage of the 1972 Mr Olympia event. Posing also by Serge Nubret, Franco Columbu and Arnold plus posedown and award for his 3rd Olympia crown.\n \nIn 1974 it was back to Australia again for more guest posing, this time at the IFBB Mr Southern Hemisphere contest, with posing also by the winner, Roger Walker, later 6th 1980 Mr Olympia.\n \nNext we see Arnold posing at the 1975 Mr Olympia in South Africa, plus posing by Lou Ferrigno and Serge Nubret - the posedown and final award again to Arnold.\n \nIn 1980 Arnold made his comeback in Australia at the Mr Olympia contest held at the Sydney Opera House. It was to be Olympia victory # 7. See his solo posing, many comparisons, compulsory poses and more as Arnold once again stands victorious. Includes scenes of many of his closest rivals from Mentzer to Zane etc. A tour de force with Arnold, since voted the most popular bodybuilder of all time. ","torrent":{"xt":"urn:btih:bf07245574d416049e6c3883ab3fc623ea45fbaf","amp;dn":"Bodybuilding+-+Arnold+-+Early+Years.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf07245574d416049e6c3883ab3fc623ea45fbaf","infoHashBuffer":{"type":"Buffer","data":[191,7,36,85,116,212,22,4,158,108,56,131,171,63,198,35,234,69,251,175]},"announce":[],"urlList":[]}}