{"title":"Part of the Pride (2009).epub Gooner","uid":14617173,"size":241432,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf1d3d79be25b6d8ab346b553d7a0b15269d6cfd&amp;dn=Part+of+the+Pride+%282009%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1463221228,"description":"Part of the Pride - My Life Among the Big Cats of Africa (2009).epub Gooner\r\n\r\nPublisher: St. Martin's Press (1 Sept. 2009)\r\nLanguage: English\r\nISBN-10: 0312556748\r\nISBN-13: 978-0312556747\r\n\r\nAbout a year ago, film started to circulate on YouTube(r) of a remarkable man named Kevin Richardson, an animal custodian in a South African animal park. The film showed Richardson in his day-to-day work, looking some of the world's most dangerous animals directly in the eye, crouching down at their level, playing with them and, sometimes, even kissing them on the nose--all without ever being attacked or injured. The films' popularity skyrocketed and Richardson became an international sensation. \r\n\r\nIn &quot;Part of the Pride,&quot; Kevin Richardson tells the story of his life and work, how he grew from a young boy who cared for so many animals that he was called &quot;The Bird Man of Orange Grove&quot; to an adolescent who ran wild and, finally, to a man who is able to cross the divide between humans and predators. As a self-taught animal behaviorist, Richardson has broken every safety rule known to humans when working with these wild animals. Flouting common misconceptions that breaking an animal's spirit with sticks and chains is the best way to subdue them, he uses love, understanding and trust to develop personal bonds with them. His unique method of getting to know their individual personalities, what makes each of them angry, happy, upset, or irritated just like a mother understands a child has caused them to accept him like one of their own into their fold. \r\n\r\nLike anyone else who truly loves animals, Richardson allows their own stories to share center stage as he tells readers about Napoleon and Tau, the two male lions he calls his &quot;brothers&quot;; the amazing Meg, a lioness Richardson taught to swim; the fierce Tsavo who savagely attacked him; and the heartbreaking little hyena called Homer who didn't live to see his first birthday. \r\n\r\nRichardson also chronicles his work on the feature film &quot;The White Lion&quot; and has a lot to say about the state of lion farming and hunting in South Africa today. In &quot;Part of the Pride,&quot; Richardson, with novelist Tony Park, delves into the mind of the big cats and their world to show readers a different way of understanding the dangerous big cats of Africa.&quot;","torrent":{"xt":"urn:btih:bf1d3d79be25b6d8ab346b553d7a0b15269d6cfd","amp;dn":"Part+of+the+Pride+%282009%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf1d3d79be25b6d8ab346b553d7a0b15269d6cfd","infoHashBuffer":{"type":"Buffer","data":[191,29,61,121,190,37,182,216,171,52,107,85,61,122,11,21,38,157,108,253]},"announce":[],"urlList":[]}}