{"title":"Cyberphunks- JUlian Assange","uid":8411737,"size":7278726,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0875ae9ae3b0a52b0365c1db6360a38c45fcbef&amp;dn=Cyberphunks-+JUlian+Assange&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Galmanu","files":5,"time":1366934073,"description":"&quot;Cypherpunks is gripping, vital reading, explaining clearly the way in which corporate and government control of the internet poses a fundamental threat to our freedom and democracy&quot;. - Oliver Stone\n\n&quot;Cypherpunks: Freedom and the Future of the Internet is an important wake-up call about a possible dystopian future, which is a technological reality now... While messengers of dangerous outcomes are always met at first with hostility and even mockery, history shows that we disregard such warnings as these at our peril.&quot; - Naomi Wolf\n\n&quot;Obligatory reading for everyone interested in the reality of our freedoms.&quot; - Slavoj ?i?ek\n\n&quot;The power of this book is that it breaks a silence. It marks an insurrection of subjugated knowledge that is, above all, a warning to all.&quot; - John Pilger\n\nCypherpunks are activists who advocate the widespread use of strong cryptography (writing in code) as a route to progressive change. Julian Assange, the editor-in-chief of and visionary behind WikiLeaks, has been a leading voice in the cypherpunk movement since its inception in the 1980s.\n\nNow, in a wave-making new book, Assange brings together a small group of cutting-edge thinkers and activists from the front line of the battle for cyber-space to discuss whether electronic communications will emancipate or enslave us. Doand Google constitute &quot;the greatest surveillance machine that ever existed&quot;? Far from being victims of that surveillance, are most of us willing collaborators? Are there legitimate forms of surveillance, for instance in relation to the &quot;Four Horsemen of the Infopocalypse&quot; (money laundering, drugs, terrorism and pornography)? And do we have the ability, through conscious action and technological savvy, to resist this tide and secure a world where freedom is something which the Internet helps bring about?\n\n\n--------------------------------------------------\n We are Anonymous.\n We are Legion.\n We do not forgive.\n We do not forget.\n Expect us.","torrent":{"xt":"urn:btih:c0875ae9ae3b0a52b0365c1db6360a38c45fcbef","amp;dn":"Cyberphunks-+JUlian+Assange","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0875ae9ae3b0a52b0365c1db6360a38c45fcbef","infoHashBuffer":{"type":"Buffer","data":[192,135,90,233,174,59,10,82,176,54,92,29,182,54,10,56,196,95,203,239]},"announce":[],"urlList":[]}}