{"title":"(PSX-PSP) SaGa Frontier 1 &amp; 2 converted properly (Kingdom-games ","uid":4876111,"size":625837149,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:c18fb79d5574ab93b078b05adb10a94c334b0c45&amp;dn=%28PSX-PSP%29+SaGa+Frontier+1+%26+2+converted+properly+%28Kingdom-games+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"toxicjuggalo","files":3,"time":1241133257,"description":"IMPORTANT NOTE:\n\nOn the first one you have to use the circle button to start the game from it's menu screen I have no idea why it's like that but the rest of the game is normal..\n\nSAGA FRONTIER:\n\nSaga Frontier breaks the mold of traditional role-playing games. Thanks to the Free Scenario System, the player has the opportunity to complete seven different quests, each with a unique lead character and story. However, all of the stories take place in the same world, and most of the stories intersect at various points. This particular arrangement allows the player unprecedented freedom. In addition, the battle system also takes a different approach: rather than conserving hit points (they regenerate between fights), players must conserve weapon points, which are used to unleash powerful attacks. Multiple attacks can be combined to create even more devastating combinations. Try to discover the links between all of the characters and the greater evil guiding all of the events in Saga Frontier.\n\n\nSAGA FRONTIER 2:\n\nSaga Frontier 2 is a unique role playing adventure game that consists of three innovative battle modes: Duel, Team and Strategic. The player can control an individual character, a team, or several units to fight in battles bringing depth and precision to the combat sequences. One unique aspect of this game is the fluid nature of time, as the plot frequently makes jumps both forward and backward in order to flesh out the narrative.\n\nTested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS...KloWn","torrent":{"xt":"urn:btih:c18fb79d5574ab93b078b05adb10a94c334b0c45","amp;dn":"%28PSX-PSP%29+SaGa+Frontier+1+%26+2+converted+properly+%28Kingdom-games+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c18fb79d5574ab93b078b05adb10a94c334b0c45","infoHashBuffer":{"type":"Buffer","data":[193,143,183,157,85,116,171,147,176,120,176,90,219,16,169,76,51,75,12,69]},"announce":[],"urlList":[]}}