{"title":"MySQL Pocket Reference.epub","uid":9857109,"size":102465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1ee814896b4e231f4836e5710752c14d49bdb36&amp;dn=MySQL+Pocket+Reference.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xerokull","files":1,"time":1396229125,"description":"To help you be more efficient in your work, this handy pocket reference gives you instant reminders on how to use important MySQL functions, especially in conjunction with key parts of the LAMP open source infrastructure. This powerful database system is so rich in features that no administrator or programmer can stay familiar with all of them. MySQL Pocket Reference is an ideal on-the-job companion, well organized to help you find and adapt the statements you need -- quickly.\n\nUpdated for the latest versions of this popular database, this edition covers many complex features that have been added to MySQL 5.0 and 5.1, including a section dedicated to stored procedures and triggers. After a brief introduction on installation and initial setup, the book explains:\n\nHow to configure MySQL, such as setting the root password MySQL data types, including numerics, strings, dates, and complex types SQL syntax, commands, data types, operators, and functions Arithmetic, comparison and logical operators Aggregate and general functions Stored procedures and triggers, including procedure definition, procedure calls, procedure management, cursors, and triggers You don't have time to stop and thumb through an exhaustive reference when you're hard at work. This portable and affordable guide is small enough to fit into your pocket, and gives you a convenient reference that you can consult anywhere. When you reach a sticking point and need to get to a solution quickly, the MySQL Pocket Reference is the book you want to have.\n\nAbout the AuthorGeorge Reese has taken an unusual path into business software development. After earning a B.A. in philosophy from Bates College in Lewiston, Maine, George went off to Hollywood where he worked on television shows such as &quot;The People's Court&quot; and ESPN's &quot;Up Close&quot;. The L.A. riots convinced him to return to Maine where he finally became involved with software development and the Internet. George has since specialized in the development of Internet-oriented Java enterprise systems and the strategic role of technology in business processes. He is the author of Database Programming with JDBC and Java, 2nd Edition and the world's first JDBC driver, the mSQL-JDBC driver for mSQL. He currently lives in Minneapolis, Minnesota with his wife Monique and three cats, Misty, Gypsy, and Tia. He makes a living as the National Practice Director of Technology Strategy for digital@jwt in Minneapolis.","torrent":{"xt":"urn:btih:c1ee814896b4e231f4836e5710752c14d49bdb36","amp;dn":"MySQL+Pocket+Reference.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1ee814896b4e231f4836e5710752c14d49bdb36","infoHashBuffer":{"type":"Buffer","data":[193,238,129,72,150,180,226,49,244,131,110,87,16,117,44,20,212,155,219,54]},"announce":[],"urlList":[]}}