{"title":"THE COMPLETE MONKEY ISLAND SAGA (Ultimate Edition)","uid":3680593,"size":4504387584,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c1fc0e1699d0cf37b8f9ec30aaeb59db249184ec&amp;dn=THE+COMPLETE+MONKEY+ISLAND+SAGA+%28Ultimate+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"MCSmarties","files":1,"time":1178290159,"description":"THE SECRET OF MONKEY ISLAND GAME SERIES - THE COMPLETE SAGA\n\nThis DVD-ROM is an unofficial, homemade &quot;Ultimate Edition&quot; of the phenomenally successful and popular series of &quot;Monkey Island&quot; adventure games.\n\nHighlights include:\n\n* automated installers for all 4 official Monkey Island games,\n  optimized to run the games (without requiring the DVD)\n  under the Microsoft Windows XP operating system!\n\n\n* THREE complete versions of The Secret of Monkey Island!\n  - the original floppy EGA version in 16 colors and PC speaker sound\n  - the later floppy VGA version with 256 colors and MIDI sound\n  - the revamped CD version with optimized VGA graphics, a new graphical\n    inventory (like in Monkey Island 2) and a re-recorded soundtrack\n\n* PDF copies of the original manuals from all 4 games!\n\n* Hints, maps, charts and even complete walkthroughs for each game!\n\n* The official soundtracks from all 4 games in MP3 format!\n\n* Tons of memorabilia for each game including box cover art,\n  magazine clippings, concept art, trivia, in-jokes, game references...\n\n* Sheet music and MIDI files for many of the popular Monkey Island songs!\n\n* The Monkey Island Play, a live stage version of The Secret of Monkey\n   Island performed by the Hammond High School in Columbia, Maryland,\n   including video footage of the entire performance and background info!\n\n* 5 of the best (completed) Monkey Island fan games ever written,\n  complete with automated installers and walkthroughs!\n\n* Fan art, fan music, fan videos, fan animations, an amazing fan comic\n  (sadly incomplete) and a direct link to even more fan creations!\n\n* Live links and offline mirror images of the best Monkey Island webpages!\n\n* MORE MONKEYS THAN YOU'LL EVER WANT TO SEE!\n\n\n\nIMPORTANT NOTES:\n- For best results, BURN the torrent to a DVD before running the installers\n  (the automated installers for MI3 and MI4 won't work from a mounted image)\n\n- The installers DO NOT work for Microsoft Vista, but you can still play the\n  games with this operating system (or even using Linux or Mac) by using\n  the ScummVM software - http://www.scummvm.org/","torrent":{"xt":"urn:btih:c1fc0e1699d0cf37b8f9ec30aaeb59db249184ec","amp;dn":"THE+COMPLETE+MONKEY+ISLAND+SAGA+%28Ultimate+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1fc0e1699d0cf37b8f9ec30aaeb59db249184ec","infoHashBuffer":{"type":"Buffer","data":[193,252,14,22,153,208,207,55,184,249,236,48,170,235,89,219,36,145,132,236]},"announce":[],"urlList":[]}}