{"title":"YTD Video Downloader PRO v4.5.1 [arMa]","uid":8992088,"size":12695266,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c2283344f1c7865c583b39d8bc3e4b20c1003187&amp;dn=YTD+Video+Downloader+PRO+v4.5.1+%5BarMa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"arMa","files":-1,"time":1380806296,"description":"Formerly known as plain old YouTube Downloader, the recently renamed YTD Video Downloader updates to version 4.0 with a promise of 2x faster downloads and 2x faster video conversions, and perhaps more usefully, the ability to resume downloads after the temporary loss of an Internet connection. As usual, the installer includes a Spigot-based YTD Video Toolbar and offers to change your default search engine to Yahoo and add 5-6 shopping extensions to Google Chrome. Clicking the &quot;Decline&quot; button during the lone advertising screen in the installer lets users easily opt-out of all offers.\n\nDownloading worked very well for popular video sites like YouTube, Vimeo, and Blip.TV. As in previous reviews, YTD Video Downloader quickly saved the default MP4 file to the directory of my choice, which is easily selected or created from the main screen. I tried various CNET and &quot;creative commons&quot;-tagged videos on YouTube and had excellent download speeds. I was sure to try out the most recently added site that YTD supports--the Chinese video site Youku--and was able to download a wonderful beetle animation easily, though it did break longer videos into multiple files (see below).\n\nThe free version of YTD Video Download only allows downloading to the MP4 video format, so the additional conversion functionality for changing the file to WMV, AVI, or MP3 is welcome, but why not just convert the download on the fly? Converting video files worked acceptably well, although I did crash the app once converting a Download Video Preview from MP4 to MP3. The conversion completed, but the program become unresponsive and I had to force quit. I experienced other occasional brief program hangs when downloading large videos from foreign sites.\n\nThe video player in YTD is supposedly new for v4, but I can't tell the difference from v3. Users select a directory from which to select specific video files, and YTD Downloader plays back the video in a small windows that is about 300x165 pixels. A full-screen button is the only resizing option, and there is no skipping around within videos--the only controls are for moving to the previous or next video on the directory. It's a passable player to confirm that the video you selected was downloaded and is not corrupt, but no one would use YTD for their regular video player.\n\nI tested out YTD's new &quot;resume download&quot; functionality the old-fashioned way--by ripping the ethernet cord out of the back of my PC. The software delivered as promised--after the PC was unplugged, the downloading files updated to a &quot;Status&quot; of &quot;Paused, waiting for Internet connection&quot; and then resumed appropriately after replugging into the network.\n\nOne thing I did notice is that YTD will (sometimes) break longer videos into multiple MP4 files, and if one of those files is complete when your Internet or computer crashes, YTD will restart all of those multiple files, even the completed ones. Not a huge problem, just a niggling annoyance, and I wasn't able to replicate the issue on YouTube (YTD always saved my YouTube videos as one file). A bit more frustrating than the mutiple files is the inability to resize the main application window to actually read the contents of the &quot;Status&quot; messages.\n\nYTD Video Downloader version 4.0 doesn't add many new features, but performance of the latest update was impressive, and the app continues to work flawlessly on all the major video-streaming sites. I recommend it whole-heartedly without any reservations, aside from the standard mom-and-pop warning to only use the application for legal purposes per the laws and and regulations that apply to your geographic locale.\n\n","torrent":{"xt":"urn:btih:c2283344f1c7865c583b39d8bc3e4b20c1003187","amp;dn":"YTD+Video+Downloader+PRO+v4.5.1+%5BarMa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2283344f1c7865c583b39d8bc3e4b20c1003187","infoHashBuffer":{"type":"Buffer","data":[194,40,51,68,241,199,134,92,88,59,57,216,188,62,75,32,193,0,49,135]},"announce":[],"urlList":[]}}