{"title":"Pasa Malar (1961) Tamil_MHCe DVD5_No  Subs [DDR]","uid":8312402,"size":4679727507,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c2919d22624d73fe3a1ee9c2846be18ddefce3ea&amp;dn=Pasa+Malar+%281961%29+Tamil_MHCe+DVD5_No++Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1364505549,"description":"Pasa Malar (1961) Tamil_MHCe DVD5_Eng Subs [DDR]\n\nTRIVIA NOTES:- \n- Paasa Malar aka Pasa Malar  (Also known in English as: The Flower of Love) is a 1961 Tamil film starring Sivaji Ganesan and Savitri. \n- The film was directed by A. Bhimsingh. \n- One of the songs, &quot;Vaarayen Thozhi Vaarayo&quot;, is still played in many Tamil weddings. \n- This film was remade in Hindi in 1986 as Asia Pyar Kaha with Jeetendra, Padmini Kolhapure, Jaya Prada and Mithun Chakraborty.\n- The movie was produced by Sivaji's own company Rajamani pictures. \n- The producers were M. R. Santhanam and K. Mohan of Mohan Arts. \n- The dialogues were written by Aroor Das. The movie was predominantly shot in Neptune Studios.\n\n- The film won National Film Award for Best Feature Film in Tamil - Certificate of Merit for the Second Best Feature Film in 1962\n- One of the biggest box office hit in the year 1962, Paasamalar went on to complete 182 days\n- Kannadasan wrote the lyrics while duo Viswanathan Ramamoorthy composed the music.\n\n    CAST:-\n    Sivaji Ganesan\n    Gemini Ganesan\n    Savitri\n    KA Thangavelu\n    AM Rajam\n    M. N. Nambiar\n    MR Santhanam\n    KD Santhanam\n    SA Kannan\n    M Saroja\n    MR Santhanam\n    Baby Kanchana\n    Baby Malathi\n\nDirected by A. Bhimsingh\nMusic by Vishwanathan amamoorthy\nLyrics by Kannadasan\nPlayback Singers:- T. M. Soundararajan, P. Susheela, Jamuna Rani, L.R. Eswari\n\nSongs are included in MP3s\nPaasa Malar (1961) 00. Title Music and Screen Credits_Vishwanathan Ramamoorthy\nPaasa Malar (1961) 01. Malargalai Pool Thangai - T. M. Soundararajan, Kannadasan, Vishwanathan Ramamoorthy\nPaasa Malar (1961) 02. Engalukkum Kaalam Varum - T.M. Soundararajan, P. Susheela, Kannadasan, Vishwanathan Ramamoorthy\nPaasa Malar (1961) 03.Yaar Yaar Avar Yaar O - P. B. Sreenivas, P. Susheela, Kannadasan, Vishwanathan Ramamoorthy\nPaasa Malar (1961) 04. Paatondru Ketten Paravasam Aaanen - Jamuna Rani, Kannadasan, Vishwanathan Ramamoorthy\nPaasa Malar (1961) 05.Vaarayen Thozhi Vaarayo - L. R. Eswari, Kannadasan, Vishwanathan Ramamoorthy\nPaasa Malar (1961) 06. Mayangugiral, Susheela, Kannadasan, Vishwanathan Ramamoorthy\nPaasa Malar (1961) 07. Short Song .. Unknown\nPaasa Malar (1961) 08. Malarnthum malaradha paathimalar pola - T.M. Soundararajan, P. Susheela, Kannadasan, Vishwanathan Ramamoorthy\nPaasa Malar (1961) 09. Vaarayenthozhi, END SONG \n\nMOVIE REVIEW:- Paasa Malar (1961)\nThe film follows the life and travails of Raju (Sivaji Ganesan), Radha (Savitri) and Anandan (Gemini Ganesan). Raju and Radha are orphans who lose their mother at a very young age. Raju loves his sister very much and raises her very dearly. Raju and Anandan work in the local mill and become fast friends when Anandan bails Raju out of trouble with the Mill foreman. Anandan and Radha fall in love and their love affair continues unknown to Raju.\nAnandan who is a union leader makes Raju join the union much against his wishes. The workers call a strike at the mill and this leads to Raju losing his job. Raju is very worried as to how he is going to support the family when Radha comes up with 1000 rupees that she has saved. Raju is amazed and overcomes his initial anger at Radha for having worked without his knowledge. Radha convinces Raju that they can earn more if they start their own business making dolls and toys for children. Raju and Radha make it big in the toy business, the local mill owner who is unable to run the mill offers the mill to raju and asks him to buy him out. Raju reluctantly agrees to take over the mill and becomes its owner. Raju is shown receiving education from a teacher and becomes much more sophisticated.\nMeanwhile Anandan and Radha are married, and her in-laws are very greedy towards Raju's wealth. They treat Radha badly, which culminates with Raju giving his entire wealth to them. Finally, Raju gets bedridden and he dies in poverty. Radha comes to see his dead-body on funeral, and cries hugging him, and dies in the same position.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4514 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 448kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: Tamil\nRunTime: 2:48:01\nSubtitles: None\nRipped by: Trinidad [DDR]   \nDuration: 2:48:01","torrent":{"xt":"urn:btih:c2919d22624d73fe3a1ee9c2846be18ddefce3ea","amp;dn":"Pasa+Malar+%281961%29+Tamil_MHCe+DVD5_No++Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2919d22624d73fe3a1ee9c2846be18ddefce3ea","infoHashBuffer":{"type":"Buffer","data":[194,145,157,34,98,77,115,254,58,30,233,194,132,107,225,141,222,252,227,234]},"announce":[],"urlList":[]}}