{"title":"Adrift In Macao - The New Musical [V2]","uid":7727953,"size":56790177,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c299a1f05c4f906f284a3d30f3aaf8f4ecb98cce&amp;dn=Adrift+In+Macao+-+The+New+Musical+%5BV2%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1350266064,"description":"All Music Guide\nComic playwright Christopher Durang turns to musicals with Adrift in Macao, a spoof of '40s film noir in exotic locations (think trench coats, slinky dresses, nightclubs called Rick's, and men and women with shady pasts). He is abetted by composer Peter Melnick, who has come up with a score that borrows equally from The Threeprenny Opera, swing, film scores of the period, and cocktail jazz. And they are supported by a game and talented cast of seven who switch roles, accents, and keys as required. Particularly effective is Orville Mendoza as the mysterious Tempura, who spends much of the show seeming to be Asian, but then late in the evening proclaims, &quot;I'm Actually Irish&quot; in a song that might have been written for Woody Allen's Zelig. This is a show with its tongue firmly in its cheek, even to the point of breaking the fourth wall and letting the audience in on the joke. Thus, Will Swenson, in the role of Rick Shaw, who otherwise would not have a song of his own, tells us that he went out and bought one in his showcase number, &quot;Rick's Song.&quot; He also says he's planning to sue the authors of the show. Of course, all works out well, as the cast members shoot at each other and miss during &quot;The Chase,&quot; ending up in New York where they lead the audience in a sing-along. Adrift in Macao is deliberately slight, but consistently amusing, and it sounds like audiences must have had a lot of fun when it ran at the Off-Broadway Primary Stages theater company in 2007.\n\nMusical Numbers\n\nPrologue - Orchestra\nIn A Foreign City - Lureena\nGrumpy Mood - Mitch\nTempura's Song - Tempura\nMister McGuffin - Tempura, Corinna, Joe, Daisy\nPretty Moon Over Macao - Lureena\nMambo Malaysian - Corinna, Lureena\nSparks - Mitch, Lureena\nAdrift In Macao - Mitch, Lureena, Corinna, Tempura\nSo Long - Lureena\nRick's Song - Rick\nThe Chase - Ensemble\nI'm Actually Irish - Tempura\nTicky Ticky Tock - Ensemble","torrent":{"xt":"urn:btih:c299a1f05c4f906f284a3d30f3aaf8f4ecb98cce","amp;dn":"Adrift+In+Macao+-+The+New+Musical+%5BV2%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c299a1f05c4f906f284a3d30f3aaf8f4ecb98cce","infoHashBuffer":{"type":"Buffer","data":[194,153,161,240,92,79,144,111,40,74,61,48,243,170,248,244,236,185,140,206]},"announce":[],"urlList":[]}}