{"title":"The Macinnes Sisters Trilogy ebooks by Donna Fletcher Highlander","uid":12640080,"size":5449820,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c2a6935eadb4c607d6f167dc91b3aafc1455a897&amp;dn=The+Macinnes+Sisters+Trilogy+ebooks+by+Donna+Fletcher+Highlander&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KiwiSue49","files":188,"time":1445978978,"description":"BOOK 1 - The Highlander's Stolen Heart\r\n\r\nThe three Macinnes sisters are well-known throughout the Highlands. Heather, the eldest, is known for her beauty and kindness. Patience, the middle sister, while attractive is known for her warrior skills. Emma, the youngest is plain-featured, her passion is knowledge. There is nothing the sisters will not do for each other and their love and loyalty is tested when Heather is abducted.\r\n\r\nEmma must ride alone through a rainstorm to reach the MacClennan keep and fetch the mighty warrior Rogan MacClennan, Heather’s intended. Nothing must delay her. Her sister’s life depends on it. Emma is not only shocked by the warrior’s handsome features, but by his refusal to leave immediately once he learns that Heather has been abducted. His excuse is the raging storm, but Emma will not bow to the mighty warrior’s dictates. She sneaks off to return to the injured Macinnes warriors and to search for Heather.\r\n\r\nRogan MacClennan cannot believe the audacity of the youngest Macinnes sister to call him a coward, and then sneak off in nothing more than her nightdress. When he gets his hands on her, he intends to see her sent home to her father. Then he will rescue his intended without any interference from Emma.\r\n\r\nThrown together, the unlikely pair must face more trials and tribulations than they ever imagined possible. They also must face something both are trying desperately to ignore and deny... that they are falling in love.\r\n\r\nEmma cannot betray her sister and Rogan must do his duty to his clan. They have no future together... or do they?\r\n\r\n\r\n\r\nBOOK 2 - Highlander's Rebellious Love\r\n\r\nPatience Macinnes is angry that her father has ordered her north to the Clan McLaud to settle a dispute when she should be searching for her sister. She intends to see the task done and resume her search. But the McLauds prove more of a problem than she anticipated, especially one McLaud in particular.\r\n\r\nHunter McLaud is known for his love of women. He spends his days entertaining himself with them and his nights as well. Patience has no time for the ne'er-do-well warrior until he offers her a solution to settle the problem between their clans. He asks her to marry him and unite the clans.\r\n\r\nWith the possibility of war looming over the clans, Patience has no choice but to agree to Hunter’s outrageous plan, but she has some stipulations of her own. He agrees to her demands, though neither one of them is prepared for the turmoil that follows. And neither one of them is prepared for the demands of their hearts.\r\n\r\nPatience Macinnes is angry that her father has ordered her north to the Clan McLaud to settle a dispute when she should be searching for her sister. She intends to see the task done and resume her search. But the McLauds prove more of a problem than she anticipated, especially one McLaud in particular.\r\n\r\nHunter McLaud is known for his love of women. He spends his days entertaining himself with them and his nights as well. Patience has no time for the ne'er-do-well warrior until he offers her a solution to settle the problem between their clans. He asks her to marry him and unite the clans.\r\n\r\nWith the possibility of war looming over the clans, Patience has no choice but to agree to Hunter's outrageous plan, but she has some stipulations of her own. He agrees to her demands, though neither one of them is prepared for the turmoil that follows. And neither one of them is prepared for the demands of their hearts.\r\n\r\n\r\n\r\nBOOK 3 - Highlander The Dark Dragon\r\n\r\nHeather Macinnes is finally safe at home, her two sisters there to offer comfort. She escaped the notorious ghost warriors and thankfully never laid eyes on their leader the Dark Dragon. Her ordeal is done. However, she learns only too soon that her ordeal is far from done...it is just beginning. The Dark Dragon is as mysterious as the past he keeps hidden, but secrets slowly come to light, and when an old foe arrives to seek revenge, the Dragon's past comes back to haunt not only him but the woman who loves him against all odds. With secrets to uncover, revenge to seek, and war looming on the horizon, Heather and the Dark Dragon must lay the past to rest, so they can build a future together","torrent":{"xt":"urn:btih:c2a6935eadb4c607d6f167dc91b3aafc1455a897","amp;dn":"The+Macinnes+Sisters+Trilogy+ebooks+by+Donna+Fletcher+Highlander","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2a6935eadb4c607d6f167dc91b3aafc1455a897","infoHashBuffer":{"type":"Buffer","data":[194,166,147,94,173,180,198,7,214,241,103,220,145,179,170,252,20,85,168,151]},"announce":[],"urlList":[]}}