{"title":"Na Rubu Znanosti - 2014-11-03 - Paganizam, magija i vjesticarenj","uid":11373392,"size":415315654,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c3a2f8f572ec29c7dd2554d2f226e723343f4b78&amp;dn=Na+Rubu+Znanosti+-+2014-11-03+-+Paganizam%2C+magija+i+vjesticarenj&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"donatius","files":1,"time":1415118467,"description":"Na rubu znanosti: Paganizam, magija i vjesticarenje\n\nPojam &quot;magija&quot; po navici povezujemo s necim natprirodnim. Takav stav odmah namece pitanje - sto je prirodno? Samo ono sto vidimo, cujemo ili na bilo koji nacin perpiciramo ili su u prirodno ukljuceni i nevidljivi tokovi o kojima ne znamo mlogo? Covjeku je sve izvan sicusnog dijela elektrogamnetskog spetkra nedovatljivo osjetilima, a tehnologogija proizasla iz prirodnih znanosti je omogucila nadvladavanje nekih od tih ogranicenja. No, sposobnost zamisljanja i stravanja novih otkrica svojstvena je i magiji, koja objedinjuje razum s nasom iracionalnom prirodom, kako pise autor Iolar alias Dorino Manzin u drugoj knjigi iz serijala &quot;Paganizam u teoriji i praksi&quot; - pod naslovom &quot;Magija i vjesticarenje&quot;. Za razliku od privodnih znanosti, magija se ne bavi samo materijom, nego obuhvaca i duhovnu razinu prirode, koju ne mozemo perciripati svojim osjetilima, ali je mozemo idejno spoznati i opaziti njezine ucinke. Polazisna tocka paganskog koncepta prirodne magije jest prozetost duha i materije. Duh materiji daje potrebnu vibraciju i energiju, a materija se oblikuje i poprima svojstva po volji i namjeri duha. Zato je snagom volje i namjere moguce utjecati na duhovnu dinemziju svijeta, nakon cega dolazi do ucinka na materijalnoj razini.\n\nGost:Dorino Manzin","torrent":{"xt":"urn:btih:c3a2f8f572ec29c7dd2554d2f226e723343f4b78","amp;dn":"Na+Rubu+Znanosti+-+2014-11-03+-+Paganizam%2C+magija+i+vjesticarenj","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3a2f8f572ec29c7dd2554d2f226e723343f4b78","infoHashBuffer":{"type":"Buffer","data":[195,162,248,245,114,236,41,199,221,37,84,210,242,38,231,35,52,63,75,120]},"announce":[],"urlList":[]}}