{"title":"Soft Errors: From Particles to Circuits [2015] [PDF]","uid":12651860,"size":24438570,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3d775c3d77e351793a669b7fa415c56182f1b71&amp;dn=Soft+Errors%3A+From+Particles+to+Circuits+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1446152695,"description":"Title: Soft Errors: From Particles to Circuits \r\nSeries: Devices, Circuits, and Systems (Book 39) \r\nAuthor: Jean-Luc Autran, Daniela Munteanu \r\nFormat: PDF \r\nHardcover: 439 pages \r\nPublisher: CRC Press; 1 edition (February 25, 2015) \r\nLanguage: English \r\nISBN: 9781466590830 \r\n\r\n\r\nSoft errors are a multifaceted issue at the crossroads of applied physics and engineering sciences. Soft errors are by nature multiscale and multiphysics problems that combine not only nuclear and semiconductor physics, material sciences, circuit design, and chip architecture and operation, but also cosmic-ray physics, natural radioactivity issues, particle detection, and related instrumentation.\r\n\r\nSoft Errors: From Particles to Circuits addresses the problem of soft errors in digital integrated circuits subjected to the terrestrial natural radiation environment―one of the most important primary limits for modern digital electronic reliability. Covering the fundamentals of soft errors as well as engineering considerations and technological aspects, this robust text:\r\n\r\n- Discusses the basics of the natural radiation environment, particle interactions with matter, and soft-error mechanisms\r\n- Details instrumentation developments in the fields of environment characterization, particle detection, and real-time and accelerated tests\r\n- Describes the latest computational developments, modeling, and simulation strategies for the soft error-rate estimation in digital circuits\r\n- Explores trends for future technological nodes and emerging devices\r\n\r\nSoft Errors: From Particles to Circuits presents the state of the art of this complex subject, providing comprehensive knowledge of the complete chain of the physics of soft errors. The book makes an ideal text for introductory graduate-level courses, offers academic researchers a specialized overview, and serves as a practical guide for semiconductor industry engineers or application engineers","torrent":{"xt":"urn:btih:c3d775c3d77e351793a669b7fa415c56182f1b71","amp;dn":"Soft+Errors%3A+From+Particles+to+Circuits+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3d775c3d77e351793a669b7fa415c56182f1b71","infoHashBuffer":{"type":"Buffer","data":[195,215,117,195,215,126,53,23,147,166,105,183,250,65,92,86,24,47,27,113]},"announce":[],"urlList":[]}}