{"title":"Womancode (2013) (Epub) Gooner","uid":12219475,"size":1693605,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3e88998a8982684bdb62c575dfa77bf09d72ba8&amp;dn=Womancode+%282013%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1439330265,"description":"Publisher: Hay House (May 6, 2013)\nPublication Date: May 6, 2013\nLanguage: English\nASIN: B00BY5MEIG\n\nHolistic health coach Alisa Vitti shows women how to maintain health and vitality with a food-based programme to rebalance their hormones.\nAlisa Vitti found herself suffering through the symptoms of polycystic ovarian syndrome (PCOS), and was able to heal herself through food and lifestyle changes. Relieved and reborn, she made it her mission to empower other women to be able to do the same.\n\nAs she says, 'Hormones affect everything. Have you ever struggled with acne, oily hair, dandruff, dry skin, cramps, headaches, irritability, exhaustion, constipation, irregular cycles, heavy bleeding, clotting, shedding hair, weight gain, anxiety, insomnia, infertility, lowered sex drive, or bizarre food cravings and felt like your body was just irrational?'\n\nWith this breadth of symptoms, improving hormonal health is a goal for women at every stage of their lives Alisa Vitti says that medication and anti-depressants aren't the only solutions. The thousands of women she has treated in her Manhattan clinic know the power of her process that focuses on uncovering your unique biological make up. Groundbreaking and informative, WomanCode educates women about hormone health in a way that's relevant and easy to understand.\n\nBestselling author and women's health expert Christiane Northrup, who has called WomanCode 'the Our Bodies, Ourselves of this generation', provides an insightful foreword","torrent":{"xt":"urn:btih:c3e88998a8982684bdb62c575dfa77bf09d72ba8","amp;dn":"Womancode+%282013%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3e88998a8982684bdb62c575dfa77bf09d72ba8","infoHashBuffer":{"type":"Buffer","data":[195,232,137,152,168,152,38,132,189,182,44,87,93,250,119,191,9,215,43,168]},"announce":[],"urlList":[]}}