{"title":"The Phantom Of The Opera [2004] by Fulanapster","uid":4412756,"size":770226808,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c40693d53ca0cfb0bdd2b43c01eeb5a3533cab83&amp;dn=The+Phantom+Of+The+Opera+%5B2004%5D+by+Fulanapster&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fulanapster","files":2,"time":1222348454,"description":"The Phantom Of The Opera [2004] by Fulanapster\n\nIn the opening scene there is an auction being held at the Opera Popularie in Paris in 1919. The vicomte de Changy, Raoul,an elderly man, buys a music box in the shape of a monkey wearing persian robes and playing the cymbals which was found in the vaults of the theater where the Phantom had lived and used it. Then the shattered chandelier from the incident of the phantom of the opera is revealed and has been restored and fitted for electric lights. Then the main overture begins to play as we go from black and white to the full color of its 1870 days. We see the cast including Christine (Emmy Rosum), Carlotta (Minnie Driver) and Piangi practicing Hannibal by Chalemau, when the owner of the theater comes in and announces that he will indeed retire and move to Austrailia and he introduces the new owners, Gilles Andre and Richard Firmin. Carlotta throws a fit because a part of the set fell on her and she leaves and refuses to sing at the gala on that night when they were to announce that Raoul, (Patrick Wilson) will be their patron. Christine is put up to singing her part by Madame Giry. She sings (&quot;Think Of Me&quot;) and Raoul her, childhood sweetheart, sees her and meets her after the play. Before he takes her out the Phantom, played by Gerard Butler, locks her in her room and take her down to his lair. She takes off his mask and sees the facial disfigurment he was hiding. He takes her back. Andre and Richard are trying to convince Carlotta that they do need her(&quot;Prima Donna&quot;) and that they will not listen to the notes signed &quot;O.G.&quot;telling them that Christine should replace Carlotta permantley. They perform &quot;Il Muto&quot; with Carlotta as the star against the wishes of the phantom, so he makes her lose her voice by putting soimething in her throat spray and then hanging the stage crew man, Joseph Bouqet. Christine is supposed to take her place but she is afraid and escapes with Raoul to the rooftop(&quot;All I Ask Of You&quot;). At the Masquerade ball(&quot;Masquerade&quot;), after three months of no apperances, then phantom returns and gives then his new opera, &quot;Don Juan&quot; and gives them specific instructions on performing it. Chrstine goes to the graveyard to consult her dead father, Gustave Daae(&quot;Wishing You Were Somehow Here Again&quot;). Not knowing that the phantom was pretending to be the carriage driver. Raoul sees the carriage leave and rides there to stop Christine from getting taken. The Phantom and the vicomte have a sword fight and in the end the phantom drops his sword and Raoul kicks it away and almost kills him but Christine says &quot;No! Not this way.&quot; Raoul decides that the best way to capture the phantom once and for all is to perform his work and use Christine as bait knowing that if she sings he will defintely be there. As the play is performed the Phantom kills Piangi to take his part and be the love of Christine&amp;#039;s character(&amp;#039;Point of No Return&quot;). While on stage, Christine unmasks the Phantom in front of the audience so he kidnapps her and releases the immense chandelier onto the audience. Raoul has Madame Giry lead him to the Phantom&amp;#039;s lair where he enters and is put into a noose by the phantom. Christine&amp;#039;s choice is to have Raoul hung and go away free, or free Raoul and live with the Phantom forever. She kisses the Phantom and he lets her go with Raoul. Then escapes through his tunnels away from the people tracking him down for murder. The end scene shows the old vicomte putting the monkey music box on Christine&amp;#039;s, his wife&amp;#039;s, grave. Next to it he notices a single red rose with a black ribbon and the engagement ring the Phantom offered Christine on it. ","torrent":{"xt":"urn:btih:c40693d53ca0cfb0bdd2b43c01eeb5a3533cab83","amp;dn":"The+Phantom+Of+The+Opera+%5B2004%5D+by+Fulanapster","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c40693d53ca0cfb0bdd2b43c01eeb5a3533cab83","infoHashBuffer":{"type":"Buffer","data":[196,6,147,213,60,160,207,176,189,210,180,60,1,238,181,163,83,60,171,131]},"announce":[],"urlList":[]}}