{"title":"[CHI-ITA] Mala Leche","uid":6931544,"size":1626714112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4238943517c51be0cc29de81cb0cd1d22f53734&amp;dn=%5BCHI-ITA%5D+Mala+Leche&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"csv01","files":1,"time":1325678323,"description":"Xvid Ac3 Ita-Esp Mala Leche (Cattivo Sangue) V.M. 18\nScheda film\nTitolo Originale: Mala Leche\nPaese: Cile\nAnno: 2004\nDurata: 100 min\nGenere: Drammatico\nRegia: LeÃƒÂ³n ErrÃƒÂ¡zuriz \nDistributore: 01, Rai Cinema\nProduzione: Paco pictures\nClassificazione IMDB: Drammatico, Azione\nSceneggiatura: LeÃƒÂ³n ErrÃƒÂ¡zuriz, Matias Ovalle\n\nCast:\nMauricio Diocares Pedro \nLuis DubÃƒÂ³ Marmota \nTamara Garea Anita \nJosÃƒÂ© Herrera Padre di Carlos \nSebastiÃƒÂ¡n Layseca \nCamila Leiva Madre di Carlos \nRamÃƒÂ³n Llao Yao \nCarlos Morales \nLoreto Moya Madre di Paula \nJuan Pablo Ogalde Carlos \nMatÃƒÂ­as Oviedo \nChristian Quevedo \nLucÃƒÂ­a Sanchez \nAdela Secall Paula \n\nTrama:\nSiamo in Cile, probabilmente Santiago, ma potrebbe essere un sobborgo di una qualsiasi cittÃƒÂ  dell\\'America Latina. Protagonisti sono Carlos e Pedro, due giovani delinquenti che per sbarcare il lunario e comprarsi un po\\' di relax si dedicano a piccole commissioni per Yao, balbuziente sulla trentina capo del quartiere. Un giorno uno scambio con degli spacciatori va male e si vedono costretti a dover restituire una cifra importante entro pochi giorni. Per farlo cominciano con dei furtarelli, per procurarsi una pistola, indispensabile per il grande colpo.\nTecnicamente ben realizzato, Mala Leche si basa in gran parte sulle interpretazioni degli attori, originali e interessanti in senso addirittura sociologico. Il mondo che ci viene raccontato ÃƒÂ¨ lontano anni luce dalle nostre cittÃƒÂ  imborghesite, dai nostri modi di agire e di pensare: proiettata sullo schermo troviamo una societÃƒÂ  dove i ricchi sono pochi, e gli altri si arrangiano come possono, e quando non possono spesso muoiono. Questa premessa ÃƒÂ¨ necessaria per renderci conto di quanto debba essere stato difficile interpretare personaggi con le idee e la parlantina pesantemente annebbiate da alcol, fumo e ogni tipo di droga a buon mercato. L\\'ingrato compito perÃƒÂ² ÃƒÂ¨ portato a termine magistralmente dal giovane cast a disposizione di ErrÃƒÂ¡zuriz. Poteva essere il tallone d\\'achille del film, quel compiacimento che spesso circonda i titoli dedicati a realtÃƒÂ  deviate, invece l\\'insieme appare molto realistico, soprattutto se si prova a guardare Mala Leche con la traccia audio spagnola, ricca di dialetto flayte delle periferie emarginate di Santiago. Non deve essere stato semplice nemmeno per lo stesso ErrÃƒÂ¡zuriz firmare questa regia, in un film pieno di episodi ripetitivi e senza alcuna morale epica su cui ricamare. Eppure ÃƒÂ¨ proprio dall\\'interesse documentaristico per il drammatico mondo di questi poveri diseredati che nasce il successo dell\\'opera: ne scaturisce un quadro credibile e una pellicola che non annoia, ma anzi suscita numerosi spunti di riflessione.","torrent":{"xt":"urn:btih:c4238943517c51be0cc29de81cb0cd1d22f53734","amp;dn":"%5BCHI-ITA%5D+Mala+Leche","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4238943517c51be0cc29de81cb0cd1d22f53734","infoHashBuffer":{"type":"Buffer","data":[196,35,137,67,81,124,81,190,12,194,157,232,28,176,205,29,34,245,55,52]},"announce":[],"urlList":[]}}