{"title":"The Prestige All Stars - Tenor Conclave (1956) [2014 SACD]","uid":11829585,"size":1905721860,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c42f90f744eb96b8eb9048c9441d4c3864b1cb05&amp;dn=The+Prestige+All+Stars+-+Tenor+Conclave+%281956%29+%5B2014+SACD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"sidmal","files":9,"time":1429588963,"description":"Hank Mobley, Al Cohn, John Coltrane, Zoot Sims - Tenor Conclave (1956) [APO Remaster 2014]\n PS3 Rip | SACD ISO | DSD64 2.0 &gt; 1-bit/2.8224 MHz | 43:57 minutes | Scans included | 1,35 GB\n\n\n These four sides should not be hard to locate, as the primary participants in this November 30, 1956, session have all issued them within their individual catalogs. However Tenor Conclave was first released as credited to the &quot;leaderless&quot; Prestige All-Stars -- consisting of tenor saxophonists John Coltrane, Hank Mobley, Al Cohn, and Zoot Sims. Providing support are pianist Red Garland, bassist Paul Chambers, and drummer Art Taylor. The Mobley-penned title track commences the effort with the quartet of tenors showing off their stuff in high-flying style. It takes a couple of passes and somewhat of a trained ear to be able to link the players with their contributions, but as is often the case, the whole tends to be greater than the sum of the parts. After a brief introduction with all four rapidly reeling off short riffs, Mobley charges ahead into truly inspired territory. The midtempo take of &quot;Just You, Just Me&quot; keeps things lively with a light swinging pace that is custom-made for bringing the combo's jocular side to the surface, particularly toward the end as they &quot;trade fours,&quot; with each tenor blowing four bars before passing the melody on. The other Mobley composition is &quot;Bob's Boys,&quot; and by all accounts it is the most compelling piece on the outing. The blues-based tune rollicks as Coltrane, Mobley, Cohn, and Sims find themselves configured in a seeming myriad of sonic face-offs. Wrapping up Tenor Conclave is an ultra-cool and sophisticated &quot;How Deep Is the Ocean?&quot; Cohn commences the long and luscious reading with a subtle strength, suggesting the powerful undercurrent flowing throughout the number. Also, listeners are treated to what is possibly Garland's finest interaction, leading right into Sims, Chambers, and finally a sublime Coltrane caboose.  \n\n\nTracklist:\n\n 01. Tenor Conclave\n 02. Just You, Just Me\n 03. Bob's Boys\n 04. How Deep Is The Ocean?\n\n Mastered by Kevin Gray at Cohearent Audio.\n\nPersonnel:\n Hank Mobley - tenor saxophone\n Al Cohn - tenor saxophone\n John Coltrane - tenor saxophone\n Zoot Sims - tenor saxophone\n Red Garland - piano\n Paul Chambers - bass\n Art Taylor - drum\n\nPerfectly played on Foobar2000 with &quot;foo_input_sacd&quot; plugin.\n For those Mac users wishing to play ISO, SACD format: see Audirvana Plus\n - Make sure you've configured it properly (check up the player settings).\n\nEnjoy!!!","torrent":{"xt":"urn:btih:c42f90f744eb96b8eb9048c9441d4c3864b1cb05","amp;dn":"The+Prestige+All+Stars+-+Tenor+Conclave+%281956%29+%5B2014+SACD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c42f90f744eb96b8eb9048c9441d4c3864b1cb05","infoHashBuffer":{"type":"Buffer","data":[196,47,144,247,68,235,150,184,235,144,72,201,68,29,76,56,100,177,203,5]},"announce":[],"urlList":[]}}