{"title":"The Ancient X Files - The Holy Grail and The Minotaur","uid":6059091,"size":734177280,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c4c229683239391351bf668b5e3e56b9c318cf52&amp;dn=The+Ancient+X+Files+-+The+Holy+Grail+and+The+Minotaur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Lucy1948","files":1,"time":1293037322,"description":"Ancient X Files travels around the world to solve some intriguing riddles. Each story is a piece of detective work by an expert trying to make sense of some puzzling ancient artefact, to find the truth behind some extraordinary legend, to discover the origins of a bizarre myth or to establish the authenticity of a venerated religious relic. This series explores the bits of archaeology and history which seem to defy explanation.\n\nOur experts are following chains of clues and putting theories to the test, in an effort to explain the unexplained. Ancient X Files investigates claims about the whereabouts of the lost Ark of the Covenant; attempts to establish the authenticity of a cup some believe to be the Holy Grail; tries to de-code the mysterious Phaistos disk; investigates a cloth which is believed to carry traces of the DNA of Jesus Christ; and deciphers an encrypted book of alchemy written by the great Sir Isaac Newton.\n\n\n1) The Holy Grail The Minotaur\nFollow investigators to a mountaintop monastery in the quest for answers about the legendary Holy Grail. And, meet the knights who've vowed to risk their lives to defend the Valencia Chalice, a sacred cup they believe to be the Grail. Then, enter the Minotaur -- a terrifying monster of ancient myth. NGC investigates: was this blood curdling story based on real places? Watch as we descend into a dark, complex cave system in an attempt to uncover the mystery.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c4c229683239391351bf668b5e3e56b9c318cf52","amp;dn":"The+Ancient+X+Files+-+The+Holy+Grail+and+The+Minotaur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4c229683239391351bf668b5e3e56b9c318cf52","infoHashBuffer":{"type":"Buffer","data":[196,194,41,104,50,57,57,19,81,191,102,139,94,62,86,185,195,24,207,82]},"announce":[],"urlList":[]}}