{"title":"Girls.Guns.And.G-Strings.Movie.PACK.XVID-TPB","uid":6319445,"size":10484848991,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c56dd71ecf95849f605eaf3d4d52df5512f97696&amp;dn=Girls.Guns.And.G-Strings.Movie.PACK.XVID-TPB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MAFIAA.","files":-1,"time":1302814584,"description":"For My Lovely Pirate Bay Leechers! And Respected Torrent Distributors.\n\nTorrent includes follow releases :\n\nThe.Dallas.Connection.DVDRip.Divx-RUBrTOE\nAfter his three colleagues are eliminated by assassins, the final remaining scientist wishes to present the computer chip the group had been developing to the authorities. Will our government agents be able to protect the scientist from the trio of beautiful, but deadly, assassins out to steal the chip?\n\nDay.of.the.Warrior.DVDRip.Divx-RUBrTOE\nThe agents of L.E.T.H.A.L. finds themselves in serious danger when the criminal Warrior targets their elimination and cracks their computer database to discover all of their secrets. The agents must come up with a new strategy to stop Warrior's forces and take down the mastermind in the process.\n\nDo.Or.Die.1991.DVDRip.XviD-FiCO\nA pair of female agents is targeted for elimination by an Asian criminal kingpin out for revenge. The evil mastermind sends out an army of assassins with the same mission, to kill agents Donna and Nicole!\n\nEnemy.Gold.1993.DVDRip.XviD-FiCO\nWhile on suspension from their jobs as government operatives, a trio of female agents decides to investigate the legend of Quantrill's hidden gold that he and his Raiders hid at the end of the Civil War.\n\nFit.To.Kill.1993.DVDRip.XviD-FiCO\nA long-lost Russian diamond is stolen during a gala dinner where it was to be presented to the Russian delegation by a Chinese businessman. Deadly, yet beautiful, the Agency agents must recover the diamond before this escalates into a major international incident.\n\nGuns.1990.DVDrip.WS.Xvid-Slayer\nSouth American criminal Juan Degas has been using the Hawaiian Islands as his base for smuggling weapons from China to Latin America. Tracking their target from Hawaii to Las Vegas, our agents must watch their backs while attempting to take down their prey.\n\nHard.Hunted.DVDRip.Divx-RUBrTOE\nAn international criminal mastermind has gotten his hands upon a nuclear trigger which could put the entire world at risk. Hoping to retrieve the nuclear trigger before it can be used, the government sends out a team of female agents to do the job.\n\nHard.Ticket.To.Hawaii.1987.DVDRip.XviD-FiCO\nA Hawaiian drug kingpin plans to flood the islands with narcotics all financed by illegal diamond shipments to his private retreat. When his henchmen kill two DEA agents who were trying to stop the drug lord, the Agency sends in two of its best agents to break up the drug ring and take out the leader.\n\nMalibu.Express.DVDRip.Divx-RUBrTOE\nWhat appeared to be a simple murder case for private investigator Cody Abilene becomes a complicated matter when you have to factor in all the beautiful women, including the widow, who are potential suspects.\n\nPicasso.Trigger.DVDRip.Divx-RUBrTOE\nWhen agent Picasso Trigger is killed by arch-criminal Miguel Ortiz, the Agency decides to send a trio of female agents out with the task of bringing Ortiz down. Our agents must use all of their skills, specialized weaponry and their physical attributes in order to track down Trigger's killer.\n\nA hidden treasure trove on a remote Pacific Island is being sought by a group of evil men who plan to use the fortune to support their criminal endeavors. Standing in the way of the bad guys are the lovely female agents of L.E.T.H.A.L.; who have the computer disc which contains the location of the treasure.\n\nSavage.Beach.1989.DVDRip.XviD-FiCO\nTwo female government agents transporting a vaccine are forced to land their plane on a remote island that houses more than palm trees and sandy beaches. A sunken WWII Japanese ship containing a fortune in gold is located nearby and the island is now the base for a nefarious group searching for it.\n\n-------------------------------------------------------------------------------\nGREETZ &amp; RESPECT 2: EG, _Frank_, [WTC-SWE], illunatic, [hero], rndpirate, Mbb15, [Ube1], Q91, hellboy, Askeen, phoxetis, tse7en, [bsod], PlayBoyMan &amp; entire #thepiratebay.se channel @ irc.Prison.NET. \nAlso big thanks to The Pirate Bay DEV's ;)\n-------------------------------------------------------------------------------\n\n-------------------------------------------------------------------------------\nJoin us at irc.Prison.NET channel #thepiratebay.se or chit-chat or supporting reasons.\nOr Join our TPB Community Forum @ &lt;a href=&quot;\nhttp://forum.suprbay.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org&lt;/a&gt;\n-------------------------------------------------------------------------------\n\nKeep Seeding Please! Don't Hit and Go!\t\t\t\t\t","torrent":{"xt":"urn:btih:c56dd71ecf95849f605eaf3d4d52df5512f97696","amp;dn":"Girls.Guns.And.G-Strings.Movie.PACK.XVID-TPB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c56dd71ecf95849f605eaf3d4d52df5512f97696","infoHashBuffer":{"type":"Buffer","data":[197,109,215,30,207,149,132,159,96,94,175,61,77,82,223,85,18,249,118,150]},"announce":[],"urlList":[]}}