{"title":"Rudolph the Red-Nosed Reindeer (OST)","uid":6851157,"size":223729811,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c580ecc9f78cb106b8fb0a38ce148c990770f54d&amp;dn=Rudolph+the+Red-Nosed+Reindeer+%28OST%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"cdda-flac","files":-1,"time":1322529077,"description":"\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/35/f1/36aa9330dca045454a5e3010&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/35/f1/36aa9330dca045454a5e3010&lt;/a&gt;\n\n\nTitle: Rudolph the Red-Nosed Reindeer\nArtist Various Artists\nAudio CD (June 1, 1995)\nOriginal Release Date: 1969\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Overture and a Holly Jolly Christmas - Burl Ives\n02. Jingle Jingle Jingle - Videocraft Chorus\n03. We Are Santa's Elves - Videocraft Chorus\n04. There's Alway's Tomorrow - Janet Orenstein\n05. We're a Couple of Misfits - Paul Soles\n06. Silver and Gold/Most Wonderful Day of the Year - Burl Ives\n07. The Most Wonderful Day of the Year - Videocraft Chorus\n08. A Holly Jolly Christmas - Burl Ives\n09. Rulolph the Red-Nosed Reindeer (Finale) - Burl Ives\n10. Christmas Medly: Christmas Medley: The Night Before Christmas Song/A Merry Merry Christmas/When Santa Clause Gets Your Letter - Decca Concert Orchestra\n11. Rudolph the Red-Nosed Reindeer - Decca Concert Orchestra\n12. There's Always Tomorrow - Decca Concert Orchestra\n13. Jingle Jingle Jingle - Decca Concert Orchestra\n14. We're a Couple of Misfits - Decca Concert Orchestra\n15. Silver and Gold - Decca Concert Orchestra\n16. We Are Santa's Elves - Decca Concert Orchestra\n17. The Most Wonderful Day of the Year - Decca Concert Orchestra\n18. A Holly Jolly Christmas - Decca Concert Orchestra\n19. I Heard the Bells on Christmas Day - Decca Concert Orchestra\n\n\nAmazon Review:\nIt's not unreasonable for any child to believe that Burl Ives may really be Santa Claus. After all, Big Daddy Burl narrates the animated Christmas classic about Rudolph and he did have that belly that shook like a bowlful of jelly. After listening to this 19-song treasure trove of Christmas music from the animated show, adults might even believe Burl is St. Nick. All the hits are on this generous collection, including &quot;Silver and Gold,&quot; &quot;We're a Couple of Misfits,&quot; &quot;A Holly Jolly Christmas,&quot; &quot;I Heard the Bells on Christmas Day,&quot; and &quot;The Most Wonderful Day of the Year.&quot; Why look any further for Ives's Christmas treasures when they're collected here on one disc?\n\nAllmusic Review:\nThe Rankin/Bass animagic film Rudolph the Red-Nosed Reindeer first appeared on December 6, 1964. Since then, it has become the longest-running of all holiday TV specials (with, we hope, no end in sight). It's fitting that the grandfather of all Christmas specials features Burl Ives, still remembered warmly by millions as the voice behind the film's narrator, Sam the Snowman. Although this soundtrack bears his name, Ives appears only on a handful of songs: &quot;Rudolph the Red-Nosed Reindeer,&quot; &quot;A Holly Jolly Christmas,&quot; and &quot;Silver and Gold.&quot; The remaining vocals are handled by various cast members: &quot;Jingle Jingle Jingle&quot; features Stan Francis as Santa, &quot;We're a Couple of Misfits&quot; is sung by Billie Mae Richards (the voice of Rudolph) and Paul Soles (the voice of Hermie), &quot;There's Always Tomorrow&quot; is immortalized by Janet Orenstein (as Clarice), and a chorus shares &quot;The Most Wonderful Day of the Year.&quot; The real musical genius behind the movie is Johnny Marks, a songwriter who had earlier written the song &quot;Rudolph the Red-Nosed Reindeer&quot; as well as holiday favorites like &quot;Rockin' Around the Christmas Tree&quot; (which is featured in a medley here). His songs, in the hands of musical director Maury Laws, simply sparkle with Christmas magic. The second half of the soundtrack features instrumental versions of the songs, featuring the Decca Concert Orchestra conducted by Herbert Rehbein. The instrumentals keep the holiday spirit flowing, but it's the equivalent of a long musical intermission (in other words, you'll probably find yourself straightening out candy canes on the tree before long). Few soundtracks hold as many happy memories or contain as much Christmas spirit as Rudolph the Red-Nosed Reindeer. Hardcore fans (who number more than a few) can also purchase the film in DVD format or check out a book from Rick Goldschmit that chronicles the making of the film (with lots of fascinating facts about the film's history).","torrent":{"xt":"urn:btih:c580ecc9f78cb106b8fb0a38ce148c990770f54d","amp;dn":"Rudolph+the+Red-Nosed+Reindeer+%28OST%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c580ecc9f78cb106b8fb0a38ce148c990770f54d","infoHashBuffer":{"type":"Buffer","data":[197,128,236,201,247,140,177,6,184,251,10,56,206,20,140,153,7,112,245,77]},"announce":[],"urlList":[]}}