{"title":"The University of Oxford: A New History {BBS}","uid":6913361,"size":5743179,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c60bd3caddab4a834f60fe64cf182f4bdef458df&amp;dn=The+University+of+Oxford%3A+A+New+History+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1324932780,"description":"The University of Oxford was a medieval wonder. After its foundation in the late 12th century it designed one of Europe's most admired syllabuses for the study of the liberal arts (the trivium and the quadrivium) and theology, and attracted teachers of international caliber and fame. The ideas of brilliant thinkers like Robert Grosseteste (who in the early 13th century mastered and taught Greek when almost no-one else was doing so), pioneering Franciscan philosopher Roger Bacon (zealous proponent of experimental science) and reforming Christian humanist John Colet redirected traditional scholasticism and helped usher in the Renaissance. In this latest instalment of her major two-volume history of the great rival institutions of Oxford and Cambridge, G. R. Evans turns to the elder university and reveals a powerhouse of learning and culture. Over a span of more than 800 years Oxford has nurtured some of the greatest minds, while right across the globe its name is synonymous with educational excellence. From dangerous political upheavals caused by the radical and inflammatory ideas of John Wyclif to the bloody 1555 martyrdoms of Hugh Latimer and Nicholas Ridley; and from John Ruskin's innovative lectures on art and explosive public debate between Charles Darwin and his opponents to gentler meetings of the Inklings in the 'Bird and Baby', Evans brings Oxford's revolutionary events, as well as its remarkable intellectual journey, to vivid and sparkling life.\n\n\n# Hardcover: 384 pages\n# Publisher: I. B. Tauris (May 15, 2010)\n# Language: English\n# ISBN-10: 1848851146\n# ISBN-13: 978-1848851146","torrent":{"xt":"urn:btih:c60bd3caddab4a834f60fe64cf182f4bdef458df","amp;dn":"The+University+of+Oxford%3A+A+New+History+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c60bd3caddab4a834f60fe64cf182f4bdef458df","infoHashBuffer":{"type":"Buffer","data":[198,11,211,202,221,171,74,131,79,96,254,100,207,24,47,75,222,244,88,223]},"announce":[],"urlList":[]}}