{"title":"Draw Your Own Manga Vol. 3 - Honing Your Style","uid":7562836,"size":19724272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6a39ca13f5dc8a6d67ae24d2de475190dd4287d&amp;dn=Draw+Your+Own+Manga+Vol.+3+-+Honing+Your+Style&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iZero","files":-1,"time":1345785425,"description":"Has a good interview with Monkey Punch (Lupin III). Beyond that, your mileage may vary.\n\nI prefer to utilize these books as image files, so I left them that way. If you want to make them into a pdf file and reupload, GO FOR IT! :D\n\n\nBook Description:\n\nWith the manga phenomenon booming, fans everywhere want to get into the act themselves. This third volume in the Draw Your Own Manga series is aimed at experienced manga artists who wish to improve their skills and technique. The book offers not only tips, practical instruction and inspiration but explains all the essential features of the main genres and the standard techniques used in common situations and action scenes. \n\nWith many examples from works by famous artists, the book identifies and describes all the main types of manga, including Schools and Sh jo, Bish jo and Lolita, Boys Love, Girls Love, Ladies and OL (Office Ladies), Family, Pets and Animals, Sports, Martial Arts, Samurai and Ninja, Historical, Fantasy, Sci-fi, and Horror. It also explains the techniques that professionals use to convey common situations and actions, such as running, walking, chasing, jumping, falling, embracing and fighting, etc. \nAs an added bonus, Draw Your Own Manga: Honing Your Style features an exclusive interview with artist Monkey Punch, renowned for the popular manga and anime works based on the character Lupin III.\t","torrent":{"xt":"urn:btih:c6a39ca13f5dc8a6d67ae24d2de475190dd4287d","amp;dn":"Draw+Your+Own+Manga+Vol.+3+-+Honing+Your+Style","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6a39ca13f5dc8a6d67ae24d2de475190dd4287d","infoHashBuffer":{"type":"Buffer","data":[198,163,156,161,63,93,200,166,214,122,226,77,45,228,117,25,13,212,40,125]},"announce":[],"urlList":[]}}