{"title":"Mage (v1 + v2) (complete) (1984 - 86 &amp; 1997 - 99) (- Nem -)","uid":9674070,"size":406630560,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c6f54b541436cf1722c4ab09964553f2d1c43c79&amp;dn=Mage+%28v1+%2B+v2%29+%28complete%29+%281984+-+86+%26amp%3B+1997+-+99%29+%28-+Nem+-%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nemesis43","files":31,"time":1393527025,"description":"Mage v1 - The Hero Discovered 01 - 15 (1984 - 1986)\n\nMage: The Hero Discovered is the first series in a projected trilogy. The second series, Mage: The Hero Defined, came out years later. The third series, Mage: The Hero Denied, has still not been written after more than a decade.\n\nThe Hero Discovered tells the story of Kevin Matchstick, who finds that he is an avatar of ancient heroic power. Mirth, a mage, tries to get him to become involved in the Struggle against the evil Umbra Sprite and his minions, but Kevin is full of doubt. He is aided by Edsel, a feisty African-American teenager, and Sean Knight, a ghost who has been working in the Public Defender's Office.\n\nMage was the first successful series for creator Matt Wagner, and was critically acclaimed. Issues 7-14 also contained back-up stories about his other major creator-owned character, Grendel, called Devil by the Deed. It is often said that Mage reflects Wagner's hopes for humanity, while Grendel tells of his darker feelings. Grendel went on to &quot;star&quot; in its own series.\n\nMatchstick is in many ways an allegorical stand-in for Wagner's life at the time he made the series. The later Hero Defined takes this autobiographical aspect to even greater levels. Both series contain numerous allegorical allusions to folktales and mythology from many cultures.\n\nMage v2 - The Hero Defined 00 - 15 (1997 - 1999)\n \nThe Hero Defined is the second series in the planned Mage trilogy.  It comes after The Hero Discovered and before The Hero Denied.  It was published many years after the first series.  The third series has not yet been published, many years after the second series.  The second series had more of a mixed critical reception than the first series, but still had an enthusiastic following.\n \nIn it, Kevin Matchstick has become a more experienced and successful warrior, but to the detriment of his character.  He must find his second mage in order to learn how to move on to a better path--although he doesn't see it like that.\n","torrent":{"xt":"urn:btih:c6f54b541436cf1722c4ab09964553f2d1c43c79","amp;dn":"Mage+%28v1+%2B+v2%29+%28complete%29+%281984+-+86+%26amp%3B+1997+-+99%29+%28-+Nem+-%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6f54b541436cf1722c4ab09964553f2d1c43c79","infoHashBuffer":{"type":"Buffer","data":[198,245,75,84,20,54,207,23,34,196,171,9,150,69,83,242,209,196,60,121]},"announce":[],"urlList":[]}}