{"title":"Couscous Express and The Couriers (AiT/Planet Lar)","uid":5420627,"size":151076744,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c8bd363cbefaf04f7f665eb020b899fd212f271a&amp;dn=Couscous+Express+and+The+Couriers+%28AiT%2FPlanet+Lar%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brodahisou","files":-1,"time":1268076793,"description":"Couscous Express\nScooter enthusiast and spoiled brat, Olive Yassin, delivers food for her parents' award-winning Middle Eastern restaurant, Couscous Express. She hates it. It's boring. She would much rather be hanging out with her courier-mercenary boyfriend, Moustafa.\nBut when the local branch of the stylish and dangerous Turkish Scooter Mafia make a move against the restaurant, she knows she has to do something, anything, to protect her family.\nCouscous Express combines delicious food, automatic weapons fire, and scooter culture into a hectic, adrenaline-fueled story of love, family, war, and the best hummus recipe in New York City. \n\nWritten by Brian Wood, with art by Brett Weldele.\n\n\nThe Couriers\nStarring characters from Brian Wood's Couscous Express, The Couriers is a fast-paced action-adventure comic set in New York City, featuring Moustafa and Special: mercenary couriers.\nThey do the work the normal couriers are only barely aware of: intelligence, large cash transfers, protection, assassinations, blockade-running... you name it. But there is one job they always knew they would refuse, known as a &quot;biologic.&quot; But when the package turns out to be a young deaf/mute girl from Nepal, with a gone-rogue Chinese Red Army Brigade hot on her heels, how can they NOT get involved?\n\nWritten by Brian Wood, with art by Rob G.\n\n\nBoth Couscous Express and The Couriers are part of Wood's Channel Zero universe as Jennie 2.5 makes an appearance.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:c8bd363cbefaf04f7f665eb020b899fd212f271a","amp;dn":"Couscous+Express+and+The+Couriers+%28AiT%2FPlanet+Lar%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8bd363cbefaf04f7f665eb020b899fd212f271a","infoHashBuffer":{"type":"Buffer","data":[200,189,54,60,190,250,240,79,127,102,94,176,32,184,153,253,33,47,39,26]},"announce":[],"urlList":[]}}