{"title":"The Lady in the Van - Alan Bennett  (1989)","uid":13015893,"size":648268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9ae1d2b2b21a5c89c20494e2dc7552d34daee89&amp;dn=The+Lady+in+the+Van+-+Alan+Bennett++%281989%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"davieboy1966","files":4,"time":1450287575,"description":"Life imitates art in The Lady in the Van, the story of the itinerant Miss Shepherd, who lived in a van in Alan Bennett's driveway from the early 1970s until her death in 1989. It is doubtful that Bennett could have made up the eccentric Miss Shepherd if he tried, but his poignant, funny but unsentimental account of their strange relationship is akin to his best fictional screen writing.\r\n\r\nBennett concedes that &quot;One seldom was able to do her a good turn without some thoughts of strangulation&quot;, but as the plastic bags build up, the years pass by and Miss Shepherd moves into Bennett's driveway, a relationship is established which defines a certain moment in late 20th-century London life which has probably gone forever. The dissenting, liberal, middle-class world of Bennett and his peers comes into hilarious but also telling collision with the world of Miss Shepherd: &quot;there was a gap between our social position and our social obligations. It was in this gap that Miss Shepherd (in her van) was able to live&quot;.\r\n\r\nBennett recounts Miss Shepherd's bizarre escapades in his inimitable style, from her letter to the Argentinean Embassy at the height of the Falklands War, to her attempts to stand for Parliament and wangle an electric wheelchair out of the Social Services. Beautifully observed, The Lady in the Van is as notable for Bennett's attempts to uncover the enigmatic history of Miss Shepherd, as it is for its amusing account of her eccentric escapades.\r\n\r\n\r\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c9ae1d2b2b21a5c89c20494e2dc7552d34daee89","amp;dn":"The+Lady+in+the+Van+-+Alan+Bennett++%281989%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9ae1d2b2b21a5c89c20494e2dc7552d34daee89","infoHashBuffer":{"type":"Buffer","data":[201,174,29,43,43,33,165,200,156,32,73,78,45,199,85,45,52,218,238,137]},"announce":[],"urlList":[]}}