{"title":"Oath of the Vayuputras(Audio Book)","uid":8890711,"size":1443642963,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c9e5c2904c28ba38fe446ba0089e1e9e8dbb7cb5&amp;dn=Oath+of+the+Vayuputras%28Audio+Book%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rrohitd","files":61,"time":1378577481,"description":"The Oath of the Vayuputras is a 2013 novel by Indian author Amish Tripathi and the final book in his Shiva trilogy. The book was released on February 27, 2013, through Westland Press and completes the mythical story about an imaginary land Meluha and how its inhabitants were saved by a nomad named Shiva. Starting from where the previous installment left off, Shiva discovers that Somras is the true evil in The Oath of the Vayuputras. Shiva then declares a holy war on those who seek to continue to use it, mainly the Emperors Daksha and Dilipa, who are being controlled by the sage Bhrigu. The battles rages on and Shiva travels to the land of Pariha to consult with Vayuputras, a legendary tribe. By the time he returns, the war has ended with Sati, his wife, being murdered. An enraged Shiva destroys the capital of Meluha and Somras is wiped out of history. The story concludes with Shiva and his associates being popularized as Gods for their deeds and accomplishments.\n\nTripathi had confirmed in September 2011 that he was writing The Oath of the Vayuputras, with Westland announcing the release date as February 27, 2013. The book was longer than the previous installments of the series and Tripathi clarified that all the loose ends left out in the previous book would be addressed, with the death of certain characters. Following the release of the cover art, it was announced that the publication rights of the books have been brought by both US and UK publisher houses. Like The Immortals of Meluha and The Secret of the Nagas, the book contained innovative marketing techniques, including launching interactive apps, merchandise and a music album titled Vayuputras, containing music inspired by different events in the series.\n\nAfter its release, The Oath of the Vayuputras received positive reviews for the story and characterisation with Business Standard calling Tripathi 'India's Tolkien'. However, his continued insistence on using modern, easy English gave way to a negative review by Mint. The book was a commercial success with 350,000 copies for pre-order, and an initial print-run of 500,000 copies. On the first day of the release itself, the book sold the initial print-run breaking the record for the fastest selling book in India. This prompted Westland to pay Tripathi an advance amount of INR5 crore (US$800,000) for Tripathi's next book series. The Shiva Trilogy has sold more than 1.7 million copies in print within the short period of two-and-a-half years with gross retail sales of over INR40 crore (US$6.4 million), making it the fastest selling book series in the history of Indian publishing.\n\n\nSIZE: 1.34 GB\n","torrent":{"xt":"urn:btih:c9e5c2904c28ba38fe446ba0089e1e9e8dbb7cb5","amp;dn":"Oath+of+the+Vayuputras%28Audio+Book%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9e5c2904c28ba38fe446ba0089e1e9e8dbb7cb5","infoHashBuffer":{"type":"Buffer","data":[201,229,194,144,76,40,186,56,254,68,107,160,8,158,30,158,141,187,124,181]},"announce":[],"urlList":[]}}