{"title":"SMS Backup &amp; Restore Pro 7.50","uid":13487953,"size":923468,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:c9f5c076f0d9410bea848cd558ed4cc40e194350&amp;dn=SMS+Backup+%26amp%3B+Restore+Pro+7.50&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ahmerafzal","files":1,"time":1455097956,"description":"SMS Backup &amp; Restore Pro 7.50\r\n\r\nSMS Backup &amp; Restore Pro – A simple App to Backup and Restore SMS Messages. This is a Paid No-Ads version of the Ad-Supported Free App.\r\n\r\nNOTE:\r\nThe backup is created locally on the phone by default unless you configure it to upload to Email, Google Drive or Dropbox. You are responsible for backup files and the files are not sent to the developer in any case.\r\n\r\nOn Android 4.4+ devices, if you have performed the Restore and the messages don’t appear in your messaging app then:\r\n– Open your messaging app and Disable SMS from Settings.\r\n– Exit the app\r\n– Open the app again and Enable SMS from Settings.\r\n\r\nAPP FEATURES:\r\n– Backup SMS Messages in XML format.\r\n– Backup created locally on the device with options to automatically upload to Email, Google Drive or DropBox using the Add-On app.\r\n– Choose a scheduled time to automatically backup.\r\n– Backup format is independent of the Android version so the messages can be easily moved from one phone to another, irrespective of the Android version.\r\n– Option to select which conversations to backup.\r\n– View/Restore all Messages or only selected conversations.\r\n– Delete all SMS Messages on the Phone.\r\n– Email a backup file.\r\n– The XML can then be converted to other formats, and can also be viewed on a computer.\r\n– Tested on Android v1.5 to v4.4.2\r\n\r\nOn newer phones with inbuilt storage the default backup location will probably be the internal storage card and not the external.\r\n\r\nThis App needs access to the following:\r\n* Your messages: Backup and Restore messages. Receive SMS permission needed to properly handle messages received while the app is the default messaging app on Android 4.4+ devices.\r\n* Storage: To create the Backup file on the SD card.\r\n* Phone calls – Without this the Restore fails on some phones.\r\n* Your social information: To display and store the contact names in the Backup file.\r\n* Run at start-up: Start scheduled Backups.\r\n* Control Vibration: To vibrate the phone when an operation is completed.\r\n* Prevent Phone from Sleeping: To prevent the phone from going to sleep/suspended state while a Backup or Restore operation is in progress.\r\n* Test access to Protected Storage: To create the Backup file on the SD card.\r\n\r\nWhat’s New\r\n– Fix for some app crash problems\r\n\r\nRequirements: 2.3 and up","torrent":{"xt":"urn:btih:c9f5c076f0d9410bea848cd558ed4cc40e194350","amp;dn":"SMS+Backup+%26amp%3B+Restore+Pro+7.50","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9f5c076f0d9410bea848cd558ed4cc40e194350","infoHashBuffer":{"type":"Buffer","data":[201,245,192,118,240,217,65,11,234,132,140,213,88,237,76,196,14,25,67,80]},"announce":[],"urlList":[]}}