{"title":"The Ghost Inside - Dear Youth (2014) [FLAC]","uid":11533396,"size":325953820,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ca2f0f94190d0c9b52582d6ba1be71a4d95dd4bc&amp;dn=The+Ghost+Inside+-+Dear+Youth+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1416599653,"description":"\n  The Ghost Inside - Dear Youth (2014) [FLAC]\n\n  Genre: Rock\n  Style: Post-Hardcore\n  Source: CD (log)\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps \n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Avalanche \n  02 Move Me \n  03 Out Of Control \n  04 With The Wolves \n  05 Mercy \n  06 Phoenix Flame \n  07 Dear Youth (Day 52) \n  08 Wide Eyed \n  09 My Endnote \n  10 The Other Half \n  11 Blank Pages\n\n  The fourth studio long-player from the West Coast metalcore unit, Dear Youth goes all in, doubling down on the band's penchant for crafting tightly wound, muscular, old-school screamo blasts of aggression with a punk-metal center. The album kicks things off with &quot;Avalanche,&quot; a fist-pumping stadium rocker complete with on-the-nose snare hits and pick slides. Adhering to a vague conceptual framework that addresses the myriad challenges of growing older, especially within the confines of the often unforgiving and machismo-filled world of post-hardcore, Dear Youth feels completely dialed in, even as it wrestles with the lyrical tropes and sonic traps of its chosen genre. There are no subtleties to be found here, and frontman Jonathan Vigil's authoritative wail is still as didactic as it is motivating, but the band deliver breakdowns, beatdowns, and pit-inducing choruses with such efficiency that it's hard not to marvel at the workmanship, even as the listener's attention can sometimes drift off and become lost in the near-relentless sonic maelstrom. Standout cuts like the meaty title track, the aforementioned first single &quot;Avalanche,&quot; and the seriously blistering &quot;Mercy,&quot; the latter of which proudly tips its hat to Metallica's &quot;For Whom the Bell Tolls&quot; (both literally and figuratively), manage to come off as both defiant and mature, which is a bona fide rarity in metalcore. Though it may not cover any new ground for the group, Dear Youth does an awfully nice job of explaining why the Ghost Inside elicit such devotion. There's no posturing here, just peers trying to work things out the only way they know how: through unmitigated volume","torrent":{"xt":"urn:btih:ca2f0f94190d0c9b52582d6ba1be71a4d95dd4bc","amp;dn":"The+Ghost+Inside+-+Dear+Youth+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca2f0f94190d0c9b52582d6ba1be71a4d95dd4bc","infoHashBuffer":{"type":"Buffer","data":[202,47,15,148,25,13,12,155,82,88,45,107,161,190,113,164,217,93,212,188]},"announce":[],"urlList":[]}}