{"title":"Jim Heinz House Music Producer","uid":8321875,"size":3692717442,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ca6b3b4365620ad796963b592e70d52f2dde8d95&amp;dn=Jim+Heinz+House+Music+Producer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MHR1","files":-1,"time":1364692334,"description":"Hey!  On the Internet I go by the name of MHH (Melodic House Hub) but my friends know me as Patrick Silletta.\n\nI have been a massive fan of this music since 1998.  Hearing the insane amount of high-quality mixes during that time just blew my mind!  For a good 8 years on-wards it was nothing but hit after hit, it seemed like they never stopped!  But then they did around 2006 or so.  I have been dismayed and saddened ever since that time.  Around the summer of 2010 I started to get active on the Internet and put the truth out there about this music and the people who make it to bring it back once again.\n\nWe are in a really desperate situation as far as the music is concerned.  Most of the industry is GONE!  What existed around the year 2000 to support and cultivate this music has virtually been driven to oblivion.  All that can be done now is self-promotion by the Programmers themselves (those who make this wonderful House Music) with a little help from dedicated fans such as myself!  Since the start of 2013 Jim and I have teamed up and have been working tirelessly together since to get his music out there, get everyone else's out there and to help revive this industry and put things right once and for all!  My efforts at promoting this music were enough to convince Jim to open his vaults and bring all his mixes out into the open for those who enjoyed them past, present and future.  Not only that, Jim was so inspired by my dedication and service to this genre that he finally got that special spark back in him to create new mixes once again that he thought he had lost!  \n\nI was honored to also be chosen to be Jim's manager and take care of his music affairs online.\n\ntheMHRproject was created to bring fans of this kind of music together to rally around the people who created this music in the first place.  With the industry left as it is the only options left to bring this music back is a fan-funded model.  When enough fans of this music gather together in one place we can have a funding blitz through Kickstarter or perhaps just paypal itself.  The results no doubt will be amazing!  If these Programmers are left to their own creativity and have a mandate from the fans to do the best they can do there is absolutely nothing that can stop them!  I will continue to feature the most talented of the House music Programmers on SoundCloud and Youtube.  Be sure to check out these links to get on board with the project:\n\ntheMHRproject Main Site: &lt;a href=&quot; http://sites.google.com/site/themhrproject/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://sites.google.com/site/themhrproject/&lt;/a&gt;\ntheMHRproject on\ntheMHRproject on Youtube: \ntheMHRproject on SoundCloud: \ntheMHRproject Forum: &lt;a href=&quot; http://themhrproject1.proboards.com/index.cgi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://themhrproject1.proboards.com/index.cgi&lt;/a&gt;\nThe Melodic House Hub (listing site for the Programmers): http://sites.google.com/site/themelodichousehub/\n\nHere's a bit more about Jim Heinz.  He was one of the premiere studio Programmers hired by Jonathan Peters during his heyday.  Jim's style and flare in his remixes contributed to the magic of what the parties at Sound Factory came to represent to so many club goers.  All the drama and intrigue he had with Jonathan Peters back then really wore on him.  But now he's back, better than ever and ready to deliver new jams to those of us who have been waiting with eager ears!  His own pages along with theMHRproject will be the official and exclusive places online to hear his mixes and anything new coming from him.  \n\nIf you'd like to contribute some money to give Jim the resources he needs to make new mixes or if you want to say a &quot;thank you&quot; for having the mixes available for download please send some money here:\n\nJim Heinz'sPage: \n\nCheck out Jim Heinz's page on the Melodic House Hub: &lt;a href=&quot; http://sites.google.com/site/themelodichousehub/Producers-1st/jim-heinz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://sites.google.com/site/themelodichousehub/Producers-1st/jim-heinz&lt;/a&gt;\n\nShare all the links, share the music, join the project, tell your friends and help us all build a community to support this music the way it should have been supported in 2000!  None of this will be possible without your support and dedication!  Also, learn who all the players were in this industry by checking out my links.  Become familiar with their mixes because together we will bring them back into the fold.  These Programmers are such special and talented people.  Without them we wouldn't have all this wonderful music to listen and dance to!  \n\nUltimately, our goals are to create a whole new record label that will support only the most talented House music Programmers and vocalists.  This kind of promotion is only the beginning.  We have a lot planned so stay tuned! \n\n~Jim &amp; Patrick\n","torrent":{"xt":"urn:btih:ca6b3b4365620ad796963b592e70d52f2dde8d95","amp;dn":"Jim+Heinz+House+Music+Producer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca6b3b4365620ad796963b592e70d52f2dde8d95","infoHashBuffer":{"type":"Buffer","data":[202,107,59,67,101,98,10,215,150,150,59,89,46,112,213,47,45,222,141,149]},"announce":[],"urlList":[]}}