{"title":"CassaStar - Alex J Cavanaugh.epub","uid":9145685,"size":241346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca9462013b4e94c3e5791b72996b6cff0a990e37&amp;dn=CassaStar+-+Alex+J+Cavanaugh.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1383589537,"description":"To pilot the fleet s finest ship Few options remain for Byron. A talented but stubborn young man with a troubled past and rebellious attitude, his cockpit skills are his only hope. Slated to train as a Cosbolt fighter pilot, Byron is determined to prove his worth and begin a new life as he sets off for the moon base of Guaard. Much to Byron s chagrin the toughest instructor in the fleet takes notice of the young pilot. Haunted by a past tragedy, Bassa eventually sees through Byron's tough exterior and insolence. When a secret talent is revealed during training, Bassa feels compelled to help Byron achieve his full potential. As war brews on the edge of space, time is running short. Byron requires a navigator of exceptional quality to survive, and Bassa must make a decision that could well decide the fate of both men. Will their skills be enough as they embark on a mission that may stretch their abilities to the limit? calls to mind the youthful focus of Robert Heinlein s early military sf, as well as the excitement of space opera epitomized by the many Star Wars novels. Fast-paced military action and a youthful protagonist make this a good choice for both young adult and adult fans of space wars.\nGenre: Science Fiction\n","torrent":{"xt":"urn:btih:ca9462013b4e94c3e5791b72996b6cff0a990e37","amp;dn":"CassaStar+-+Alex+J+Cavanaugh.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca9462013b4e94c3e5791b72996b6cff0a990e37","infoHashBuffer":{"type":"Buffer","data":[202,148,98,1,59,78,148,195,229,121,27,114,153,107,108,255,10,153,14,55]},"announce":[],"urlList":[]}}