{"title":"Picturefilled","uid":8161872,"size":303567752,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:caae36443fd44938361cb3672a5c092e76ccadd2&amp;dn=Picturefilled&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmwreck","files":10,"time":1361265912,"description":"Picture Filled was literally a one-night-only group, having formed to play for exactly that: one night. the result of that combination was to prove most exciting for the group a they shared their individual opinions on self-expression and fulfillment. it pushed them to morph into one explosive quintet; one that would share their deepest tragedies and yet ironically express their thanks for it through their songs. music became their outlet. and emo was their vehicle.\n\nThe group is composed of Michael ( Vocals) who screams and sings, Rj and Jp (Guitars) whose guitar riffs raise from heavy to the ambient, Kirvy (Drums) and Ronald a.k.a Jawo (Bass) who maintain the groove and the rhythm to guide the rest into play. the cebuano independents came to be on January 2004, and they do admit that they have yet to find their musical identity, experimenting every chance they get.\n\nThat image doens't seem to be far off as the band plans to release an album early 2006. but it makes them sure that they won't stop from experimenting with other sounds and styles. the band relish every opportunity they have to please the crowd and it is with this attitude that they hope to find themselves satisfied.. \n\n-taken from http://www.purevolume.com/picturefilledcebuphil","torrent":{"xt":"urn:btih:caae36443fd44938361cb3672a5c092e76ccadd2","amp;dn":"Picturefilled","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caae36443fd44938361cb3672a5c092e76ccadd2","infoHashBuffer":{"type":"Buffer","data":[202,174,54,68,63,212,73,56,54,28,179,103,42,92,9,46,118,204,173,210]},"announce":[],"urlList":[]}}