{"title":"Aamar Mayer Shapath (2003) Bengali Movie WebRip MP4","uid":10269779,"size":434900910,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cbb694d0cf89660aced1dfbfa240ed404a4cb0f9&amp;dn=Aamar+Mayer+Shapath+%282003%29+Bengali+Movie+WebRip+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pint3359","files":1,"time":1401567800,"description":"à¦†à¦®à¦¾à¦° à¦®à¦¾à§Ÿà§‡à¦° à¦¶à¦ªà¦¥ (2003)\n\n &lt;a href=&quot;\nhttp://s9.postimg.org/61b7ngbbj/amar_mayer_sapath.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s9.postimg.org/61b7ngbbj/amar_mayer_sapath.jpg&lt;/a&gt;\n\n\n\nAamar Mayer Shapath (2003)\n\nDirector: Dulal Bhowmik\nProducer: Shyama\nMusic: Anu Malik\nMain Cast: Jeet, Dipankar Dey, June Maliya, Ramaprasad Banik, Shubhendu Chattopadhyay, Papiya Adhikari, Sanjib Dasgupta, Dola Chowdhury, Mohima Mukherjee, Reshmi Ghosh\nGenre: Family\nRelease: 2003\n\nThe film opens with Deva and Basanti with their snake Chandra. Basanti is expecting a baby and is asked to take rest. Nata Bose and her friend Brojendra Narayan plan to carry out a theft in the temple. They kill the priest and escape and Deva who had come to take the shelter with Basanti is convicted. Deva is whipped to death and Basanti decides to take revenge. Basanti has a baby boy named Surya. Surya is forced to let go of the snake Chandra. One day Surya meets Rama, the daughter of Brojendra. Brojendra and Nata Bose plan to sell the jewelery they had got from the temple but fail to get a buyer. Rama visits Surya and is followed by Chandra. Chandra immediately recognises Surya. Meanwhile Nata Bose puts a marriage proposal for his son Sanjeev with Rama but Rama refuses Sanjeev. Brojendra's people severely beat up Surya for meeting Rama. The snake come to rescue Rama and reveals her parentage to Basanti. Basanti explains the whole story to Surya who cannot quite comprehend the muddle. A revengeful clash takes place between Brojendra and Nata Bose due to the disappearance of the entire jewellery. Brojendra's wife gets killed in the process and soon after that Brojendra is killed by a snake bite. Rama is kidnapped by Sanjeev who also tries to molest her. Surya comes to the rescue. Sanjeev is killed by Chandra. Raids are carried out in Basanti's house but in vain. Nata's men set Basanti's house on fire to kill Chandra. The snake however manages to kill the Britisher who buys the jewellery along with the third partner of Nata Bose. Surya asks Chandra to hide for a few days. The inspector forcefully carries Basanti to Nata's place where she is whipped brutally. She denies to play the flute to call Chandra because she knew that the snake would be eliminated from the scene. Surya tries to come to the rescue, he is beaten. In protest a group of snakes arrive and start biting Nata's men. Nata tries to escape but is caught. Basanti now takes her revenge and fatally whips him. At the end as per the title of the film, revenge is taken and harmony is restored.\n\n\nScreenshot: &lt;a href=&quot;\nhttp://s29.postimg.org/wd9kt16h3/Thumbs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s29.postimg.org/wd9kt16h3/Thumbs.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cbb694d0cf89660aced1dfbfa240ed404a4cb0f9","amp;dn":"Aamar+Mayer+Shapath+%282003%29+Bengali+Movie+WebRip+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbb694d0cf89660aced1dfbfa240ed404a4cb0f9","infoHashBuffer":{"type":"Buffer","data":[203,182,148,208,207,137,102,10,206,209,223,191,162,64,237,64,74,76,176,249]},"announce":[],"urlList":[]}}