{"title":"Destiny Online Open Beta Client","uid":4644177,"size":625085924,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cbbf75425f8931cd59a1c5ef12e62513a3a4568c&amp;dn=Destiny+Online+Open+Beta+Client&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kmnow2004","files":2,"time":1231821733,"description":"Destiny Online, (formally named Legend of Golden Plume Online), is an MMORPG featuring Beautiful 2D Graphics, Exotic Weapons, Powerful Skills, Loyal Pets, Versatile Mounts, Fierce PK, Tribal War, Online Romance and Wild Wedding Party. \n\nFeatures: \n\nGroup Mode: Team up with friends to train, and get up to 5x EXP \n\nNavigation System: Finding someone or some monsters is never so easy in an MMO. The in-game navigation system will take you to your destination at one mouse click. \n\nPet System: Capture monsters and turn them into your pets, and train them to become your best helpers in battle. \n\nMarriage System: Get married and enjoy the ultimate romance with your loved one. \n\nTribe System: Join a guild and fight in the breath-taking guild war! \n\nMaster/Apprentice System: Find yourself a powerful Master and leveling will no longer be boring. \n\nWeapon Composing and Refinement: Craft a matchless weapon with your name engraved on it and embed refining gems to boost its attributes. \n\nFun quests: The Game presents a series of guided Main Quests as well as fun Side Quests and events such as IQ Test, race with cute NPCs, Hide &amp; Seek with GMs etc. You don't want to miss any of them. \n\nOther exciting features include: Buddy System, Trade System, fun quests, super cool skills (both for heroes and pets), and many more. For more details, please visit official website: http://destiny.enjoymmo.com/index.php","torrent":{"xt":"urn:btih:cbbf75425f8931cd59a1c5ef12e62513a3a4568c","amp;dn":"Destiny+Online+Open+Beta+Client","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbbf75425f8931cd59a1c5ef12e62513a3a4568c","infoHashBuffer":{"type":"Buffer","data":[203,191,117,66,95,137,49,205,89,161,197,239,18,230,37,19,163,164,86,140]},"announce":[],"urlList":[]}}