{"title":"Viscoelasticity of Polymers - Theory and Numerical Algorithms","uid":15365207,"size":11767501,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc858e524ec2cdb3bb16cde58c80fbac6aa54520&amp;dn=Viscoelasticity+of+Polymers+-+Theory+and+Numerical+Algorithms&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469061623,"description":"Viscoelasticity of Polymers - Theory and Numerical Algorithms - Kwang Soo Cho (Springer, 2016).pdf\r\n\r\nThis book offers a comprehensive introduction to polymer rheology with a focus on the viscoelastic characterization of polymeric materials. It contains various numerical algorithms for the processing of viscoelastic data, from basic principles to advanced examples which are hard to find in the existing literature.  The book takes a multidisciplinary approach to the study of the viscoelasticity of polymers, and is self-contained, including the essential mathematics, continuum mechanics, polymer science and statistical mechanics needed to understand the theories of polymer viscoelasticity.  It covers recent achievements in polymer rheology, such as theoretical and experimental aspects of large amplitude oscillatory shear (LAOS), and numerical methods for linear viscoelasticity, as well as new insights into the interpretation of experimental data. \r\n\r\nAlthough the book is balanced between the theoretical and experimental aspects of polymer rheology, the author’s particular interest in the theoretical side will not remain hidden.  Aimed at readers familiar with the mathematics and physics of engineering at an undergraduate level, the multidisciplinary approach employed enables researchers with various scientific backgrounds to expand their knowledge of polymer rheology in a systematic way","torrent":{"xt":"urn:btih:cc858e524ec2cdb3bb16cde58c80fbac6aa54520","amp;dn":"Viscoelasticity+of+Polymers+-+Theory+and+Numerical+Algorithms","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc858e524ec2cdb3bb16cde58c80fbac6aa54520","infoHashBuffer":{"type":"Buffer","data":[204,133,142,82,78,194,205,179,187,22,205,229,140,128,251,172,106,165,69,32]},"announce":[],"urlList":[]}}