{"title":"Hitler's Eagles: The Luftwaffe 1933-45","uid":8628561,"size":90526443,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ccee0a4169ced956c2b145775a6ea5e817e10c90&amp;dn=Hitler%27s+Eagles%3A+The+Luftwaffe+1933-45&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1372575029,"description":"Hitler's Eagles: The Luftwaffe 1933-45\nby Chris McNab\n\nDESCRIPTION:\nAt the beginning of World War II, the Luftwaffe was the world's most advanced air force. With superior tactics, aircraft and training, it cut through the air forces of Poland and Western Europe in 1939 and 1940, and those of the Soviet Union in 1941.\n\n Despite this auspicious beginning, by 1945 the Luftwaffe was a dying force. The Allies were destroying German aircraft at unequal rates, and Luftwaffe aviators were dying in their thousands in an unbalanced battle to save Germany from destruction. The Luftwaffe's lack of a convincing long-range bomber force also meant that it could not return strategic devastation upon its enemies. In the words of one historian, the Luftwaffe had a 'strategy for defeat'.\n\n Hitler's Eagles - The Luftwaffe 1933-45 charts the turbulent history of the Luftwaffe from its earliest days to its downfall. It explores the secretive development of German air power during the 1920s and early 1930s, and the training of a new generation of aviators, including combat experience in the Spanish Civil War. Once Hitler was in power, the Luftwaffe came out of the shadows and expanded under a massive rearmament programme, then embarked upon the war that would define its existence. Hitler's Eagles explains the Luftwaffe's operations in every theatre of the war - Europe, North Africa, the Mediterranean and the Eastern Front. As well as providing a detailed history of the Luftwaffe's history and combat experience, the book also expands on its human and material aspects. Aces and commanders are profiled, uniforms and equipment are explained, and aircraft ranging from the Fiesler Storch to the Fw 200 Condor are described both technologically and tactically. The book conveys all the drama of the Luftwaffe's existence, from bombing raids over London to jet-fighter dogfights over Berlin, with Osprey's famous aviation artwork and more than 150 photos bringing the story incomparably to life.\n\nAmazon.com title link:\n","torrent":{"xt":"urn:btih:ccee0a4169ced956c2b145775a6ea5e817e10c90","amp;dn":"Hitler%27s+Eagles%3A+The+Luftwaffe+1933-45","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccee0a4169ced956c2b145775a6ea5e817e10c90","infoHashBuffer":{"type":"Buffer","data":[204,238,10,65,105,206,217,86,194,177,69,119,90,110,165,232,23,225,12,144]},"announce":[],"urlList":[]}}