{"title":"Abra Moore - Everything Changed [2004] [EAC,log,cue. FLAC]","uid":8753491,"size":324902887,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cd3f506fa4ec7297ce48ed41c2f8886718e829cf&amp;dn=Abra+Moore+-+Everything+Changed+%5B2004%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1375093374,"description":"Artist: Abra Moore\nRelease: Everything Changed\nReleased: 2004\nLabel: Koch Records\nCatalog#: KOC AD 9501\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: alternative, pop, rock\n\n1. I Do\n2. No Fear\n3. Big Sky\n4. If You Want Me To\n5. Taking Chances\n6. Melancholy Love\n7. Family Affair\n8. Pull Away\n9. End, The\n10. Everything Changed\n11. Paint on Your Wings\n12. I Win\n13. Shining Star\n\nEverything Changed is Abra Moore's first album in six years. The struggle to bring it to life -- from the shambles of another record deal and the tumultuous life occurrences addressed in its songs -- places it automatically outside the realm of the simple ambition required to advance one's career by issuing a new pop album. As such, it is necessary to forgo the standard critical language in addressing it, and to meet it on its own terms and speak its language: that of the human heart, exposed, raw, and desiring wholeness. What is contained within these 13 songs is something mercurial, enigmatic; in essence, it is a work of desire but not covetousness. These songs communicate directly to anyone who has ever experienced wholesale, soul-threatening brokenness and wears the exquisite scar that informs everyday life in its aftermath. Inside the album's booklet, on its first facing page, is a photograph of Moore either entering or emerging from kissing her image in a mirror. It contains no vanity or narcissism. Instead, it expresses honest, ego-less self-regard and beatific love. It is nearly holy in its expression, because it understands that in order to extend oneself to others, one has to accept and embrace the truth and beauty of her own countenance in frailty and vulnerability, as well as in strength and purpose. The music on this record fleshes out this archetype with spiritual and emotional depth and dimension. Moore worked with producer and multi-instrumentalist Jay Joyce on Everything Changed. The end result not only extended her aesthetic reach, but raised his creative watermark as well. Using everything at her disposal, including standard rock instrumentation, ornate strings, keyboard and percussion treatments, electronic beats and textures, and wonderfully subtle atmospherics, Moore strips the considerable quirky charm displayed on her earlier records to the bone; in its place is naked, tender, and sometime frightening emotion, presented with painstaking attention to detail and lush arrangements not to soften the impact, but to celebrate it fearlessly.","torrent":{"xt":"urn:btih:cd3f506fa4ec7297ce48ed41c2f8886718e829cf","amp;dn":"Abra+Moore+-+Everything+Changed+%5B2004%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd3f506fa4ec7297ce48ed41c2f8886718e829cf","infoHashBuffer":{"type":"Buffer","data":[205,63,80,111,164,236,114,151,206,72,237,65,194,248,136,103,24,232,41,207]},"announce":[],"urlList":[]}}