{"title":"IKE - Countdown to D-Day (2004 A&amp;E Docudrama)","uid":4968531,"size":773372283,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cd576bad3348940975179abad1f0ac5ec75ecb09&amp;dn=IKE+-+Countdown+to+D-Day+%282004+A%26E+Docudrama%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1245662819,"description":"Ike: Countdown to D-Day\n\nVideo Data:\n\nVideo Codec..........: XviD 1.1.2 Final\nVideo Bitrate........: 826kbps\nDuration.............: 1:28:45\nResolution...........: 480*270\nFramerate............: 29.970\n\nAudio Data:\n\nAudio Codec..........: 0x0055 MPEG-1 Layer 3\nAudio Bitrate........: 128 kbps CBR\nAudio Channels.......: 2\n\nFile Data:\n\nFilename.............: IKE - Countdown to D-Day.avi\nFilesize.............: 644,394,756\n\n\nProduct Details (DVD)\n\n* Actors: Tom Selleck, James Remar, Timothy Bottoms, Gerald McRaney, Ian Mune\n* Directors: Robert Harmon\n* Format: AC-3, Closed-captioned, Color, Dolby, DVD-Video, Subtitled, Widescreen, NTSC\n* Language: English (Dolby Digital 5.1)\n* Subtitles: English, Spanish, French, Portuguese, Chinese, Thai\n* Region: Region 1 encoding (US and Canada only)\n* Aspect Ratio: 1.78:1\n* Number of discs: 1\n* Rating: PG (Parental Guidance Suggested)\n* Studio: Sony Pictures\n* DVD Release Date: August 31, 2004\n* Run Time: 89 minutes\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0401504/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0401504/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Ike:_Countdown_to_D-Day&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Ike:_Countdown_to_D-Day&lt;/a&gt;\n\n\nIke: Countdown to D-Day is a 2004 American television film originally aired on the American television channel A&amp;E and was directed by Robert Harmon and written by Lionel Chetwynd. The film is notable for the total absence of battle scenes; it deals solely with the decison-making process at the top level rather than lower level preparation or the actual invasion. For those wanting movies dealing with the landings or the training, please see BAND OF BROTHERS, THE LONGEST DAY, and SAVING PRIVATE RYAN.\n\nTom Selleck portrays General Dwight D. Eisenhower - US Army. The film emphasizes the difficult decisions he had to make while dealing with the varied personalities of his direct subordinates, including General Omar N. Bradley - US Army (James Remar), Lieutenant General George S. Patton, Jr. - US Army (Gerald McRaney), General Bernard Law Montgomery - British Army (Bruce Phillips) and General Charles De Gaulle - Free French (George Shevtsov).\n\nThe film does not have action sequences focusing instead on the inner dealings of Supreme Headquarters Allied Expeditionary Force that led to the successful D-Day invasion of World War II. The film concentrates on decisions actually made by Eisenhower and the pressure brought to bear on him personally, including his personal relationship with British Prime Minister Winston S. Churchill (Ian Mune). His Chief of Staff, Lieutenant General Walter Bedell Smith - US Army, is also portrayed in the film, by Timothy Bottoms.\n\nThe film is also notable for being the only major video or film production in which General Montgomery's portrayal concentrates on his role as a competent military professional instead of focusing on his alleged personality disorders. General Patton's complex personality is also shown in a very brief set of scenes played by Gerald McRaney.\n\nCountdown to D-Day was filmed entirely in New Zealand.\n\nNoteworthy\n\nThe movie accurately depicts the incident which nearly torpedoed Overlord. In a drunken scene at a restaurant, Major General Henry Miller -- a West Point classmate of Eisenhower -- of the USAAF blurted out the general time and place of Overlord. A Lieutenant of the 101st Airborne overheard this and reported it up the chain of command. Miller was sent home with a reduced rank of Lieutenant Colonel.\n\nMaj. Gen. Bedell-Smith spoke to the officer and reported that officer felt bad about doing what he did but that he was worried about the lives of his men on the day they went to war without letting the Germans know when and where. Eisenhower on hearing this said the officer was better than Miller and told Miller that it was their longstanding friendship that prevented him from seriously court-martialing him.\n\n\nCast (in credits order)\n\nTom Selleck ... Gen. Dwight D. Eisenhower\nJames Remar ... Gen. Omar Bradley\nTimothy Bottoms ... Walter Bedell &quot;Beetle&quot; Smith\nGerald McRaney ... Lt. Gen. George S. Patton\nIan Mune ... Prime Minister Winston Churchill\nBruce Phillips ... Gen. Bernard Law Montgomery\nJohn Bach ... Air Marshal Sir Trafford Leigh-Mallory\nNick Blake ... Air Marshal Arthur W. Tedder\nKevin J. Wilson ... RAdm. Bert Ramsay\nChristopher Baker... Group Capt. Maj. James Stagg\nGeorge Shevtsov ... Gen. Charles DeGaulle\nGregor McLennan ... Capt. Chapman\nPaul Gittins ... Maj. Gen. Henry Miller\nCraig Hall ... Cpl. William Hayes\nStephen Brunton ... Cpl. William Younger\nPaul Barrett ... Maj. Wiatt\nRobert Pollock ... 101st Airborne sergeant","torrent":{"xt":"urn:btih:cd576bad3348940975179abad1f0ac5ec75ecb09","amp;dn":"IKE+-+Countdown+to+D-Day+%282004+A%26E+Docudrama%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd576bad3348940975179abad1f0ac5ec75ecb09","infoHashBuffer":{"type":"Buffer","data":[205,87,107,173,51,72,148,9,117,23,154,186,209,240,172,94,199,94,203,9]},"announce":[],"urlList":[]}}