{"title":"Coast to Coast AM January 30 2013","uid":8088409,"size":55930745,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ce8d5ef6156bdfe2a649d5e6771f497a5fdb1ab2&amp;dn=Coast+to+Coast+AM+January+30+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1359661033,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-30-13\nHost: \tGeorge Noory\nGuests: \tAndrew Gough, David Blume, Joshua P. Warren\n\nIn the latter half of the show, paranormal investigator Joshua P. Warren shared updates. He reported on his research into the rare phenomenon of &quot;naked ghosts.&quot; In one case in 1940, a man on his honeymoon in Mexico City, saw a nude woman at the foot of his bed, crying. At first he assumed it was his wife, and then realized it wasn't her, before the ghost vanished. When he checked at the front desk, he was informed that many guests had seen this woman at around the same time, 2AM. This suggests to Warren that the person is &quot;not seeing a naked ghost, but seeing something that happened in the past that is repeating itself almost like an imprint.&quot; It's almost a form of mental time travel, he continued, adding that maybe the entire world around us is encoded with information that certain people can pick up on when they're able to broadcast their consciousness or intent.\n\nIn discussing the concept of different dimensions, he referenced the 19th century book Flatland by Edwin Abbott, in which he imagined what it would be like if we, as three dimensional creatures, tried to contact a two-dimensional culture. Warren also conjectured about Shadow People, suggesting that because they tend to disappear or run away when discovered, they could either be here trying to feed on our energy, or are time travelers of some type. Extrapolating further on the subject of time travel, he proposed the &quot;para-temporal loop hypothesis,&quot; in which different groups of time travelers might be battling with each other at points in our timeline in order to create better future outcomes for themselves.\nEthanol Update\n\nFirst hour guest, ecological biologist and advocate for alcohol-based fuel, David Blume, responded to a report that E15 gas can cause problems for cars. 15 percent ethanol gas (E15) had recently been approved for sale by the EPA as a way to increase the use of renewable fuels. But Blume declared that the new E15 study, conducted by the American Petroleum Institute, was a kind of propaganda on their part, as they fear the increased popularity of alcohol fuel. Ethanol doesn't gum up the fuel system as the report claimed, rather it washes out the residue from regular gasoline that can plug up the fuel filter, he explained. The ultimate strategy of Big Oil, he continued, is to commercialize tar sands, oil shale, and coal to gasoline-- alternatives that are all more expensive than making alcohol gas.\nAncient Bees &amp; Rennes Hoax\n\nSecond hour guest, editor-in-chief of The Heretic Magazine, Andrew Gough, discussed his work researching the lost traditions and symbolism celebrating the sacred honey bee in ancient cultures, as well as a hoax he uncovered at Rennes-le Chateau. The hoax involved a supposed discovery of a tomb in a cave in the South of France that included relics such as a parchment written by a priest from Rennes-le-Chateau. More on the hoax here. According to Gough, the ancient Egyptians venerated the honey bee, and had perfected the art of beekeeping as far as 2400 BC. He hypothesized that Atlantis was actually a civilization on Crete 3,000 years ago that served as &quot;drug lords of the ancient world.&quot; They successfully shipped and trading a drink they made from poppies and hallucinogenic honey to various regions throughout the world, he claimed.\n\nNews segment guests: Stan Deyo, Dr. John McDougall\nWebsite(s):\n\n    andrewgough.com\n    thehereticmagazine.com\n    alcoholcanbeagas.com\n    joshuapwarren.com\n\nBook(s):\n\n    Alcohol Can Be a Gas!\n    Haunted Asheville\n\n","torrent":{"xt":"urn:btih:ce8d5ef6156bdfe2a649d5e6771f497a5fdb1ab2","amp;dn":"Coast+to+Coast+AM+January+30+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce8d5ef6156bdfe2a649d5e6771f497a5fdb1ab2","infoHashBuffer":{"type":"Buffer","data":[206,141,94,246,21,107,223,226,166,73,213,230,119,31,73,122,95,219,26,178]},"announce":[],"urlList":[]}}