{"title":"Michael Maschler - Game Theory [2013][A]","uid":10231640,"size":5978606,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ceec8f367af3fb6c90daf9cd6a97fdf7ce907493&amp;dn=Michael+Maschler+-+Game+Theory+%5B2013%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1401140855,"description":"Description\nProduct Details\nBook Title: Game Theory\t\nBook Author: Michael Maschler (Author), Eilon Solan (Author), Shmuel Zamir (Author)\nHardcover: 1009 pages\nPublisher: Cambridge University Press (May 6, 2013)\nLanguage: English\nISBN-10: 1107005485\nISBN-13: 978-1107005488\n\n===================================================================================\nBook Description\nPublication Date: May 6, 2013\nCovering both noncooperative and cooperative games, this comprehensive introduction to game theory also includes some advanced chapters on auctions, games with incomplete information, games with vector payoffs, stable matchings and the bargaining set. Mathematically oriented, the book presents every theorem alongside a proof. The material is presented clearly and every concept is illustrated with concrete examples from a broad range of disciplines. With numerous exercises the book is a thorough and extensive guide to game theory from undergraduate through graduate courses in economics, mathematics, computer science, engineering and life sciences to being an authoritative reference for researchers.\n\n===================================================================================\nReviews\n'This is the book for which the world has been waiting for decades: a definitive, comprehensive account of the mathematical theory of games, by three of the world's biggest experts on the subject. Rigorous yet eminently readable, deep yet comprehensible, replete with a large variety of important real-world applications, it will remain the standard reference in game theory for a very long time.' Robert Aumann, Nobel Laureate in Economics, The Hebrew University of Jerusalem\n\n'Without any sacrifice on the depth or the clarity of the exposition, this book is amazing in its breadth of coverage of the important ideas of game theory. It covers classical game theory, including utility theory, equilibrium refinements and belief hierarchies; classical cooperative game theory, including the core, Shapley value, bargaining set and nucleolus; major applications, including social choice, auctions, matching and mechanism design; and the relevant mathematics of linear programming and fixed point theory. The comprehensive coverage combined with the depth and clarity of exposition makes it an ideal book not only to learn game theory from, but also to have on the shelves of working game theorists.' Ehud Kalai, Kellogg School of Management, Northwestern University\n\n'The best and the most comprehensive textbook for advanced courses in Game Theory.' David Schmeidler, Ohio State University and Tel Aviv University\n\n'There are quite a few good textbooks on game theory now, but for rigor and breadth this one stands out.' Eric S. Maskin, Nobel Laureate in Economics, Harvard University\n\n'This textbook provides an exceptionally clear and comprehensive introduction to both cooperative and noncooperative game theory. It deftly combines a rigorous exposition of the key mathematical results with a wealth of illuminating examples drawn from a wide range of subjects. It is a tour de force.' Peyton Young, University of Oxford\n\n'This is a wonderful introduction to game theory, written in a way that allows it to serve both as a text for a course and as a reference. While the treatment is mathematical, the mathematics is presented in quite an accessible way ... Each chapter concludes with a large set of exercises, which should appeal to a wide range of students. The book is written by leading figures in the field (unfortunately, one of the authors, Michael Maschler, passed away before the completion of the book); their broad view of the field suffuses the material.' Joe Halpern, Cornell University\n\n===================================================================================\nBook Description II\nA comprehensive treatment of game theory. Mathematically oriented, it examines both noncooperative and cooperative games, and includes advanced topics as well as numerous exercises, and examples from economics, mathematics, computer science and management science. Written both for students studying the subject and as a reference book for researchers.\n\n===================================================================================\nAbout the Authors\nMichael Maschler was a Professor at the Einstein Institute of Mathematics and the Center for the Study of Rationality at the Hebrew University of Jerusalem, Israel. He greatly contributed to cooperative game theory and to repeated games with incomplete information.\nEilon Solan is a Professor in the School of Mathematical Sciences at Tel Aviv University, Israel. The main topic of his research is repeated games. He serves on the editorial board of several academic journals.\nShmuel Zamir is a Professor Emeritus in the Department of Statistics and the Center for the Study of Rationality at the Hebrew University of Jerusalem, Israel. The main topics of his research are games with incomplete information and auction theory. He is the editor-in-chief of the International Journal of Game Theory.\n===================================================================================","torrent":{"xt":"urn:btih:ceec8f367af3fb6c90daf9cd6a97fdf7ce907493","amp;dn":"Michael+Maschler+-+Game+Theory+%5B2013%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceec8f367af3fb6c90daf9cd6a97fdf7ce907493","infoHashBuffer":{"type":"Buffer","data":[206,236,143,54,122,243,251,108,144,218,249,205,106,151,253,247,206,144,116,147]},"announce":[],"urlList":[]}}