{"title":"Brad Paisley featuring Alison Krauss - Whiskey Lullaby","uid":4824914,"size":245049348,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cf5106aa50d8fa9266e2b677e46fe13be2670e6f&amp;dn=Brad+Paisley+featuring+Alison+Krauss+-+Whiskey+Lullaby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1238908095,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video is the full length music video.\n\n\n&quot;Whiskey Lullaby&quot; is the title of a country song composed by Bill Anderson and Jon Randall. It was first recorded by Brad Paisley as a duet with Alison Krauss on Paisley's 2003 album Mud on the Tires, and released in mid-2004 as that album's third single, and the eleventh chart single of Paisley's career. The song reached a peak of #3 on the Billboard Hot Country Singles &amp; Tracks (now Hot Country Songs) charts, and #41 on the Billboard Hot 100. One year after its release, Randall also recorded a version for his Walking Among the Living album.\n\nThe full length music video is set in the World War II era. It starts out with a man (played by Rick Schroder) returning home from the United States Army, as he walks into his house and looks at the pictures of him and his wife (Marisa Petroro) and has a flashback to a moment with them underneath a willow tree. He hears laughter upstairs and walks up expecting to find his wife alone, but she is in bed with another man. He then leaves her and the song begins again.\n\nThe first verse of the song in the video shows the man getting drunk, and not being able to get his wife off his mind. His drinking became chronic alcoholism that swiftly kills him due to his consumption, and the first chorus depicts his funeral and his wife crying.\n\nThe second verse of the song in the video depicts the wife starting a drinking habit close to her late husband. During her drunken state, she dances with several men, but finds herself seeing her husband's face in the other men. There is a scene in which the wife pushes a man (with whom she was going to sleep) out of the room and shuts the door on him. She obviously holds herself at fault for husband's death, and can only feel at ease while drinking whiskey from her bottle.\n\nJust before the second chorus there is a shot of her at her husband's grave crying and drinking. When the chorus starts, it cuts to her funeral, which also took place in 1947. When the song finishes a little girl looks back at the graves and sees their ghosts, hugging and kissing and falling in love again.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cf5106aa50d8fa9266e2b677e46fe13be2670e6f","amp;dn":"Brad+Paisley+featuring+Alison+Krauss+-+Whiskey+Lullaby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf5106aa50d8fa9266e2b677e46fe13be2670e6f","infoHashBuffer":{"type":"Buffer","data":[207,81,6,170,80,216,250,146,102,226,182,119,228,111,225,59,226,103,14,111]},"announce":[],"urlList":[]}}