{"title":"[PS3] The Chronicles of Narnia: Prince Caspian","uid":9792079,"size":6362515132,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:cfbd85fe3dd7452bed854f8d87fb79ba2ccf53fd&amp;dn=%5BPS3%5D+The+Chronicles+of+Narnia%3A+Prince+Caspian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fuckface69","files":-1,"time":1395262970,"description":" One year for us, 1300 years for Narnia!\n\nThis game inspired by the next movie in the Narnia series has the Pevensie children travelling back to Narnia, which is now ruled by another evil tyrant.\n\nThe Chronicles of Narnia: Prince Caspian game takes players beyond the events of the upcoming Summer 2008 blockbuster film. A year after the events of the first film, &quot;The Chronicles of Narnia: The Lion, The Witch and The Wardrobe,&quot; but 1,300 years in Narnian time, Prince Caspian finds the Pevensie children returning to a darker land where the Narnian creatures have been driven into hiding and Narnia is under the rule of the evil tyrant Miraz.\n\nKey Features\n\n* Players take the role of 20 playable characters, including Narnians (non-humans)\n* Cooperative drop-in/drop-out multiplayer allows two players to work together both locally and online\n* Non-linear level structure enables players to explore multiple paths in any order\n* A combination of puzzle solving and action combat gameplay\n* Team-up with characters to combine abilities\n\nSynopsis\n\nA magical land beckons through a mysterious wardrobe. Step through the portal to find an world unlike any you've ever known, where fantastic creatures roam and thrilling adventures await around every corner. One year ago, the Pevensie children first encountered the land of Narnia and put their courage and faith to the test in a battle for Narnia's future. Join them as they once again slip through the wardrobe and discover a Narnia far removed from the one they knew before. That's because 1,300 years have passed in Narnia since the events of The Lion, the Witch and the Wardrobe. The evil tyrant Miraz holds sway over the land, and the friendly Narnian creatures have been driven into hiding. The future of all Narnia lies in peril. Can you help save the magical land from a terrible fate?\n\nThe Chronicles of Narnia: Prince Caspian will sweep you back to a land of magic, mystery and adventure. Explore locations beyond those featured in the blockbuster film. Play as any of more than 20 characters, including Narnian creatures. Test your wits by solving puzzles and joining in the action to save Narnia from the rule of Miraz. Team up with other characters and combine your abilities to conquer the threats facing Narnia. Work together with a friend to take on the challenges that wait in store. In Prince Caspian, you are the Narnians' last hope. Do you have what it takes?\n\nProduct Description\nEnter the fantastic world of Narnia once again in Â¿The Chronicles of Narnia: Prince CaspianÂ¿. The sequel to the smash hit Â¿The Lion, the Witch and the WardrobeÂ¿, gives players the freedom to explore this deep universe further than ever controlling up to 20 characters including all of the Pevensie Children, Giants, Centaurs and Caspian himself. \n________________________\n\nUSE WINRAR 5 TO EXTRACT!","torrent":{"xt":"urn:btih:cfbd85fe3dd7452bed854f8d87fb79ba2ccf53fd","amp;dn":"%5BPS3%5D+The+Chronicles+of+Narnia%3A+Prince+Caspian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfbd85fe3dd7452bed854f8d87fb79ba2ccf53fd","infoHashBuffer":{"type":"Buffer","data":[207,189,133,254,61,215,69,43,237,133,79,141,135,251,121,186,44,207,83,253]},"announce":[],"urlList":[]}}