{"title":"Separation and Its Discontents (2003) by Kevin B. MacDonald","uid":10149459,"size":1441480,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d07285b0c727f8dae98e779c8773f64afa2e335d&amp;dn=Separation+and+Its+Discontents+%282003%29+by+Kevin+B.+MacDonald&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"joshua13","files":-1,"time":1400085493,"description":"Separation and Its Discontents - Toward an Evolutionary Theory of Anti-Semitism [First Paperback Edition] (2003) by Kevin B. MacDonald.pdf\n\nFrom the Preface to the Praeger Edition:\n\nThis book builds upon my previous work, A People That Shall Dwell Alone: Judaism asa Group Evolutionary Strategy (hereafter PTSDA). While PTSDA focused on developing a theory of Judaism within anevolutionary framework, the present volume focuses on the phenomenon of anti-Semitism. Judaism and anti-Semitism fairly cry out for an evolutionary interpretation. Anti-Semitism has been a very robust tendency over a very long period of human history and in a wide range of societies with different forms of government, different economic systems, and different dominant religious ideologies. Many anti-Semitic episodes, such as the Iberian inquisitions and the Nazi holocaust, have been characterized by extraordinary intra-societal violence. Moreover, anti-Semitism has sometimes been characterized by a very overt,self-conscious racialism...a phenomenon that immediately suggests the relevance of evolutionary theory. The basic thesis of this book can be summarized by the proposition that Judaism must be conceptualized as a group strategy characterized by cultural and genetic segregation from gentile societies combined with resource competition and conflicts of interest with segments of gentile societies. This cultural and genetic separatism combined with resource competition and other conflicts of interest tend to result in division and hatred within the society.\n\n448 pages\nPublisher: AuthorHouse (November 13, 2003)\nLanguage: English\nISBN-10: 1410792617\nISBN-13: 978-1410792617","torrent":{"xt":"urn:btih:d07285b0c727f8dae98e779c8773f64afa2e335d","amp;dn":"Separation+and+Its+Discontents+%282003%29+by+Kevin+B.+MacDonald","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d07285b0c727f8dae98e779c8773f64afa2e335d","infoHashBuffer":{"type":"Buffer","data":[208,114,133,176,199,39,248,218,233,142,119,156,135,115,246,74,250,46,51,93]},"announce":[],"urlList":[]}}