{"title":"Peter Joback - Flera sidor av samme man - 2CD 2006","uid":6904914,"size":979486537,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d0a1b50b6ee37a3d03035968eac2a3014368b3f7&amp;dn=Peter+Joback+-+Flera+sidor+av+samme+man+-+2CD+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1324551178,"description":"Peter Arne JÃƒÂ¶back (born June 4, 1971 in Stockholm, Sweden) is a Swedish singer and musical artist, and is regarded as being one of Sweden's best male vocalists\n\n- - -\n\nCameron Mackintosh discovered Peter JÃƒÂ¶backs talent and offered him the lead as Chris in Miss Saigon at the Theatre Royal, Drury Lane in Londons West End in 1997. Three years later at the same theatre, JÃƒÂ¶back created the role of Michael in Macintoshs original production of The Witches of Eastwick.\n\nPeter JÃƒÂ¶back got his big break through his collaboration with ABBA's BjÃƒÂ¶rn Ulvaeus and Benny Andersson. In their musical Kristina frÃƒÂ¥n DuvemÃƒÂ¥la (The Emigrants) at MalmÃƒÂ¶ Opera and Music Theatre, JÃƒÂ¶back created the role of Robert and his theme song, Guldet blev till sand, broke every record in the Swedish charts. The musical was seen by over one million Swedes and the original cast CD-box became a triple-platinum album and received several Swedish Grammy awards. JÃƒÂ¶back received his first Golden Mask for his role as Robert.\n\n- - -\n\nHis many stage performances and albums have been met with critical acclaim. JÃƒÂ¶backs very personal Christmas album, which was released in 2002 is regarded as The Ultimate Christmas album of all time. On this album JÃƒÂ¶back teamed up with Norwegian singer Ms Sissel KyrkjebÃƒÂ¶ in a duet of the Irish folk song Be thou my vision in a Swedish translation. The duo have since been frequent guests at each others concerts.\n\nIn 2004 JÃƒÂ¶back collaborated with the internationally renowned Gothenburg Symphony Orchestra conducted by Nick Davies in a project called Storybook where he performed classic songs in brand new arrangements. GSO and JÃƒÂ¶back released a CD which became a Gold Disc and also performed two concerts in the Globe Arena and Scandinavium Arena in Sweden. The album also brought JÃƒÂ¶back to a superstar status in Norway. His first solo tour there in 2005 was a success both with audience and media.\n\n- - -\n\nDuring 2006-2007 Peter JÃƒÂ¶back starred as the MC in a production of Cabaret in Stockholm and Gothenburg. He received critical praise as well as his second Golden Mask Tony Award. He already in 2003 performed as the MC at Gladsaxe Theatre in Copenhagen.\n\nJÃƒÂ¶back ended 2008 with a sold-out Christmas tour in arenas in Scandinavia following the release of a new 4x platinum-selling Christmas album. In 2007 he also toured Scandinavia with his platinum-selling studio album with original songs co-written by himself. In January 2009 JÃƒÂ¶back moved to New York to get new inspiration and make new acquaintances. This has resulted in an album entitled East Side Stories, recorded in Woodstock, featuring prominent guests such as Kate Pierson from the The B52's, Sia Furler, Gail Ann Dorsey and the group Betty.\n\n- - -\n\nPeter JÃƒÂ¶back entered Melodifestivalen 2010, the Swedish Pre-selection for the Eurovision Song Contest 2010. he received a wildcard from SVT. His song, Hollow, reached the final of the competition, ultimately finishing in 9th position. In 2012 JÃƒÂ¶back will star as the Phantom in the London production of The Phantom of the Opera. (wikipedia)\n\n- - -\n\nPeter JÃƒÂ¶back - Flera sidor av samma man 1990-2006\n(2CD Bromma Columbia 2006)\n\n 1. Jag stÃƒÂ¥r fÃƒÂ¶r allt jag gjort. \n 2. En sÃƒÂ¥ng om oss. \n 3. Tonight. \n 4. Du har fÃƒÂ¶rlorat mer ÃƒÂ¤n jag. \n 5. Sinnen. \n 6. Under my skin. \n 7. GÃƒÂ¥ inte fÃƒÂ¶rbi. \n 8. GÃƒÂ¶r det nu. \n 9. Heal. \n10. Ar det hÃƒÂ¤r platsen. \n11. She. \n12. I. \n13. Vem ser ett barn?. \n14. VarfÃƒÂ¶r Gud?. \n15. I'm gonna do it. \n16. Det mÃƒÂ¥ste finnas bÃƒÂ¤ttre liv ÃƒÂ¤n det hÃƒÂ¤r, PÃƒÂ¥ vÃƒÂ¤g. \n17. Guldet blev till sand. \n18. Jag blundar i solens sken. \n19. Sommarens sista sÃƒÂ¥ng. \n20. Jag bÃƒÂ¤r dig. \n21. Higher. \n22. I din blick. \n23. She's like a butterfly. \n24. Varje gÃƒÂ¥ng vi ses. \n25. I who have nothing. \n26. I don't care much. \n27. Mellan en far och en son. \n28. Always on my mind. \n29. Undress me. \n30. Only when I breathe. \n31. Hon ser inte mig. \n32. Searching for love. \n33. Decembernatt (Halleluja). \n34. En sensation\n","torrent":{"xt":"urn:btih:d0a1b50b6ee37a3d03035968eac2a3014368b3f7","amp;dn":"Peter+Joback+-+Flera+sidor+av+samme+man+-+2CD+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0a1b50b6ee37a3d03035968eac2a3014368b3f7","infoHashBuffer":{"type":"Buffer","data":[208,161,181,11,110,227,122,61,3,3,89,104,234,194,163,1,67,104,179,247]},"announce":[],"urlList":[]}}