{"title":"Price Geoffrey Four Books and One Play 09 2012","uid":7619408,"size":8855502,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0c9de7ed309bbb23597e82135d4def06dd8cf97&amp;dn=Price+Geoffrey+Four+Books+and+One+Play+09+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pricegeoffrey","files":8,"time":1347290626,"description":"Price Geoffrey has written four fiction and non-fiction ebooks and one stage play for the torrent community. He seeds the files unlocked so downloaders can convert them to their preferred format. It also means that readers can alter the files and revise the texts in any way they desire. It leverages the writer-reader relationship into a truly collaborative post-copyright space. He has written an anti-war novel premised in John Ford's Stagecoach called FFtGG (Fucked From the Get-Go). Fan-fictionalizing the same characters for Marco Polo: A Play About LHR &amp; COS, his intention, as explained in the stage notes, is to cause a reaction by the police to ban the book, like other Hubbard texts in Germany. He has written two horror genre books: one that brutalizes the Tea Party absurdity, in Zombies on the DL, and delights in the Manson Family's social impression, in Fascist Vampires. His exploration of the French philosophers Michel Foucault and Gilles Deleuze is contained within a historiography of SoCal called Understanding Charlie Manson and the Family of Infinite Soul. He is finishing a book about art and social unrest called Errors in Space in Time. In order to confront copyright boundaries, EST will have an ancillary album of copyright-violating remixes ostensibly produced by the protagonist. His work encourages collaboration beyond file-sharing as the Administration and its mandarin client states brutally and inequitably enforce the corporate domination and ownership of culture. ","torrent":{"xt":"urn:btih:d0c9de7ed309bbb23597e82135d4def06dd8cf97","amp;dn":"Price+Geoffrey+Four+Books+and+One+Play+09+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0c9de7ed309bbb23597e82135d4def06dd8cf97","infoHashBuffer":{"type":"Buffer","data":[208,201,222,126,211,9,187,178,53,151,232,33,53,212,222,240,109,216,207,151]},"announce":[],"urlList":[]}}