{"title":"Architecture of Minoan Crete (2010) - (Malestrom)","uid":5676116,"size":52715429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0d023b7773c97416499f8c49cc69e5353f88c25&amp;dn=Architecture+of+Minoan+Crete+%282010%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"malestrom_HH","files":2,"time":1278533197,"description":"Architecture of Minoan Crete: Constructing Identity in the Aegean Bronze Age\nUniversity of Texas Press | 2010 | ISBN : 0292721935 | 220 pages | PDF \n\nEver since Sir Arthur Evans first excavated at the site of the Palace at Knossos in the early twentieth century, scholars and visitors have been drawn to the architecture of Bronze Age Crete. Much of the attraction comes from the geographical and historical uniqueness of the island. Equidistant from Europe, the Middle East, and Africa, Minoan Crete is on the shifting conceptual border between East and West, and chronologically suspended between history and prehistory. In this culturally dynamic context, architecture provided more than physical shelter; it embodied meaning. Architecture was a medium through which Minoans constructed their notions of social, ethnic, and historical identity: the buildings tell us about how the Minoans saw themselves, and how they wanted to be seen by others.\nArchitecture of Minoan Crete is the first comprehensive study of the entire range of Minoan architecture--including houses, palaces, tombs, and cities--from 7000 BC to 1100 BC. John C. McEnroe synthesizes the vast literature on Minoan Crete, with particular emphasis on the important discoveries of the past twenty years, to provide an up-to-date account of Minoan architecture. His accessible writing style, skillful architectural drawings of houses and palaces, site maps, and color photographs make this book inviting for general readers and visitors to Crete, as well as scholars.","torrent":{"xt":"urn:btih:d0d023b7773c97416499f8c49cc69e5353f88c25","amp;dn":"Architecture+of+Minoan+Crete+%282010%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0d023b7773c97416499f8c49cc69e5353f88c25","infoHashBuffer":{"type":"Buffer","data":[208,208,35,183,119,60,151,65,100,153,248,196,156,198,158,83,83,248,140,37]},"announce":[],"urlList":[]}}