{"title":"God's Secret Agents - Queen Elizabeth I's Forbidden Priests","uid":8774998,"size":1293702,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d14674cd5986cae311171182e64a1917ea3fcad9&amp;dn=God%27s+Secret+Agents+-+Queen+Elizabeth+I%27s+Forbidden+Priests&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Robin1966","files":4,"time":1375489768,"description":"Retail epub and mobi\n\n\nAn excellent, very well-written book, transporting the reader into 16th and early 17th century England and the real-life adventures of priests on the run, Catholics who hid them and sometimes died for them, and a Government which saw all priests (and especially the Jesuits) as agents of a foreign power. A balanced presentation, with impressive research but always readable - in fact, a page turner for anyone interested in the religious situation at the time of Elizabeth and James 1st. It's impossible not to admire the bravery of these hunted men and the ingenuity of the hiding places constructed in so many stately homes across the country, and to puzzle over the dilemna faced on both sides of the religious divide. How were Catholics, under persecution, to live in loyalty to both their King and their religion ? How was the government to deal with genuine dangers from abroad, without severe injustice to those many English Catholics who were no danger at all ? The book ends with some brief and interesting thoughts on the Muslim community and the Western response to 9/11. We are reminded that the governments of Elizabeth and James &quot;both preached regular sermons on their own essential decency and reasonableness (in contrast to what they perceived as the king-killing doctrines of Rome), both endorsed State-sanctioned acts of inhumanity, forced internments, show trials, revenge punishments, and the erosion of the common law.&quot; Aren't we fortunate that this couldn't possibly happen today ?!! This really is a good book, making me want to read more about the Jesuits and this period of history, and to visit the many country houses and historic buildings of London which play their part in the story. Highly recommended. \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:d14674cd5986cae311171182e64a1917ea3fcad9","amp;dn":"God%27s+Secret+Agents+-+Queen+Elizabeth+I%27s+Forbidden+Priests","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d14674cd5986cae311171182e64a1917ea3fcad9","infoHashBuffer":{"type":"Buffer","data":[209,70,116,205,89,134,202,227,17,23,17,130,230,74,25,23,234,63,202,217]},"announce":[],"urlList":[]}}