{"title":"Comparing the Geological and Fossil Records {BBS}","uid":7498322,"size":4473529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3c73dae75b871e80d77a4a2a1fb7d2894c8e2e0&amp;dn=Comparing+the+Geological+and+Fossil+Records+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1343944084,"description":"The past decade has witnessed a major revival in attempts to separate biodiversity signals from biases imposed by sampling and the architecture of the rock record. How large a problem this poses to our understanding of biodiversity patterns remains debatable, and new approaches are being developed to investigate this question. Here palaeobiologists with widely differing approaches and interests explore the problems of extracting reliable information on biodiversity change from an imperfect geological record. Topics covered range from the application of information-theoretic approaches that identify directional causal relationships to an in-depth study of how geological biases could influence our understanding of dinosaur evolution. A wide range of new insights into the links between the land, shallow-marine and deep-sea rock, and fossil records are presented, making this volume invaluable to anyone in the Earth or life sciences who wishes to remain abreast of this dynamic and rapidly evolving research area.\n\nThe Geological Society of London\n\nFounded in 1807, the Geological Society of London is the oldest geological society in the world, and one of the largest publishers in the Earth sciences.\n\nThe Society publishes a wide range of high-quality peer-reviewed titles for academics and professionals working in the geosciences, and enjoys an enviable international reputation for the quality of its work.\n\nThe many areas in which we publish in include:\n\n-Petroleum geology\n-Tectonics, structural geology and geodynamics\n-Stratigraphy, sedimentology and paleontology\n-Volcanology, magmatic studies and geochemistry\n-Remote sensing\n-History of geology\n-Regional geology guides","torrent":{"xt":"urn:btih:d3c73dae75b871e80d77a4a2a1fb7d2894c8e2e0","amp;dn":"Comparing+the+Geological+and+Fossil+Records+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3c73dae75b871e80d77a4a2a1fb7d2894c8e2e0","infoHashBuffer":{"type":"Buffer","data":[211,199,61,174,117,184,113,232,13,119,164,162,161,251,125,40,148,200,226,224]},"announce":[],"urlList":[]}}