{"title":"Little Failure - A Memoir - EPUB - WD","uid":9505365,"size":4013128,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3ddc1687d008d21b9d05254ba953ba594a0ec33&amp;dn=Little+Failure+-+A+Memoir+-+EPUB+-+WD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AtomTPB","files":1,"time":1390263182,"description":"Released: 2014 \nFormat: EPUB \nPages: 368 pages\nLanguage: English\nISBN-10: 0679643753\nISBN-13: 978-0679643753\n\nAfter three acclaimed novels, Gary Shteyngart turns to memoir in a candid, witty, deeply poignant account of his life so far. Shteyngart shares his American immigrant experience, moving back and forth through time and memory with self-deprecating humor, moving insights, and literary bravado. The result is a resonant story of family and belonging that feels epic and intimate and distinctly his own.\nBorn Igor Shteyngart in Leningrad during the twilight of the Soviet Union, the curious, diminutive, asthmatic boy grew up with a persistent sense of yearning for food, for acceptance, for words desires that would follow him into adulthood. At five, Igor wrote his first novel, Lenin and His Magical Goose, and his grandmother paid him a slice of cheese for every page.\nIn the late 1970s, world events changed Igores life. Jimmy Carter and Leonid Brezhnev made a deal: exchange grain for the safe passage of Soviet Jews to America a country Igor viewed as the enemy. Along the way, Igor became Gary so that he would suffer one or two fewer beatings from other kids. Coming to the United States from the Soviet Union was equivalent to stumbling off a monochromatic cliff and landing in a pool of pure Technicolor.\nShteyngarts loving but mismatched parents dreamed that he would become a lawyer or at least a conscientious toiler on Wall Street, something their distracted son was simply not cut out to do. Fusing English and Russian, his mother created the term Failurchka Little Failure which she applied to her son. With love. Mostly.\nAs a result, Shteyngart operated on a theory that he would fail at everything he tried. At being a writer, at being a boyfriend, and, most important, at being a worthwhile human being.\nSwinging between a Soviet home life and American aspirations, Shteyngart found himself living in two contradictory worlds, all the while wishing that he could find a real home in one. And somebody to love him. And somebody to lend him sixty-nine cents for a McDonald's hamburger.\nProvocative, hilarious, and inventive, Little Failure reveals a deeper vein of emotion in Gary Shteyngart's prose. It is a memoir of an immigrant family coming to America, as told by a lifelong misfit who forged from his imagination an essential literary voice and, against all odds, a place in the world.","torrent":{"xt":"urn:btih:d3ddc1687d008d21b9d05254ba953ba594a0ec33","amp;dn":"Little+Failure+-+A+Memoir+-+EPUB+-+WD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3ddc1687d008d21b9d05254ba953ba594a0ec33","infoHashBuffer":{"type":"Buffer","data":[211,221,193,104,125,0,141,33,185,208,82,84,186,149,59,165,148,160,236,51]},"announce":[],"urlList":[]}}