{"title":"Earthworm Jim 1 &amp; 2 - The Whole Can O Worms","uid":4004439,"size":628270008,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d46fcf1daf7ea12021641c15baebb617f4aa4fa9&amp;dn=Earthworm+Jim+1+%26+2+-+The+Whole+Can+O+Worms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ADHDerby","files":2,"time":1201739832,"description":"Earthworm Jim 1 &amp; 2 - The Whole Can O Worms\n\nDOUBLES THE PLEASURE, DOUBLES THE FUN\n\nEarthworm Jims story begins when, fleeing from a predator crow, Jim suddenly finds himself the wearer of an all-powerful, indestructible, cyber-netic suit that fell onto his body from outerspace. Armed with a plasma blaster, he sets our to rescue the charming Princess Whats-Her-Name, the object of his desire, but he must first battle Psy-Crow and the most bizarre collection of bad guys ever imagined, including Professor Monkey-for-a-Head, Major Mucus, and Bob with #4, a Napoleon-esque goldfish and his henchcat. Part one features bungee jumping, undersea hijinx, a place called Heck, and a hidden level that literally keeps you in the dark.\n\nIn part two, Jim traverses the universe to prevent Psy-Crow from reaching Lost Vegas for a quickie wedding with the princess. Following the pair from planet to planet, Jim must overcome obstacles in such strange worlds as Lorenzens Soil, The Villi People, Inflated Head, and Udderly Abducted. Among the many foes he must evade include pea-shooting cats, flying Sumo/Roman centurions, mutant superpowered penguins, and repressed Grannies.\n\nOperating System: Windows 95/98/NT/2K/XP &amp; Vista via DOSBox.\n\nDOSBox is an x86 emulator which mimics a DOS command-line environment intended for running MS-DOS-based IBM PC compatible programs, especially computer games. You can re-live the good old days with the help of DOSBox, it can run plenty of the old classics that dont run on your new computer! This release contains an enhanced and preconfigured version of DOSBox, you can access the configuration menu by pressing Alt+Pause or Alt+Enter.\n\n\nQ: Why the heck is this release so big?!! (unpacked size is 1,35 GB)\nA: It contains 2 full ISOs with the CD Audio tracks so you can play the games with the original music. When you launch one of the games, DOSBox automatically mounts the ISOs in an emulated MS-DOS environment.\n\n\nInstall: Unpack (compressed with 7-Zip - www.7-zip.org - free) to any location &amp; run Sound Setup.exe to configure your Playback Device (= Soundcard).\nRun Earthworm Jim 1.exe or Earthworm Jim 2.exe to start the game.\n\nExtras: Toy Show (action figure characters from the Universal Cartoon Studios Earthworm Jim animated series) + the Intro Movie.\n\n\nGet ready to have some nostalgic fun!! =D\n\n\nADHDerby","torrent":{"xt":"urn:btih:d46fcf1daf7ea12021641c15baebb617f4aa4fa9","amp;dn":"Earthworm+Jim+1+%26+2+-+The+Whole+Can+O+Worms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d46fcf1daf7ea12021641c15baebb617f4aa4fa9","infoHashBuffer":{"type":"Buffer","data":[212,111,207,29,175,126,161,32,33,100,28,21,186,235,182,23,244,170,79,169]},"announce":[],"urlList":[]}}