{"title":"Sweet - Give Us A Wink [1976] EAC Lame VBR","uid":4382290,"size":77914589,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d4a046fb69d04f9698e892f0ad74aaf8d16e3dc4&amp;dn=Sweet+-+Give+Us+A+Wink+%5B1976%5D+EAC+Lame+VBR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sweetthing","files":13,"time":1220721261,"description":"Sweet - Give Us A Wink [1976]\n\n1. Lies In Your Eyes \n2. Cockroach \n3. Keep It In \n4. 4th Of July \n5. Action \n6. Yesterday&amp;#039;s Rain \n7. White Mice \n8. Healer \n9. Someone Else Will [Bonus Track]\n10. Miss Demeanor [Bonus Track]\n\n+ art work\n\n\n\nThis album is 100 per cent Sweet, the record where the strings were cut and the band went it alone. The production is handled admirably by Scott, Connolly, Tucker and Priest and every song is a band composition. GIVE US A WINK was recorded for the most part at Musicland Studios in Munich with engineer Mack (who was later to work extensively with Queen.) Part of the recording process was watched by Zeppelin bassist John Paul Jones who was particularly interested in the sound Mick Tucker had achieved in recording his drumming. (Coincidently the next Zeppelin album, PRESENCE was recorded in the same studio.) The recording was completed back in London at Ian Gillan`s Kingsway Recorders. There were two singles lifted from GIVE US A WINK, the first being ACTION, a fast and furious rocker which unfortunately only made number 16 in the charts but remains a classic to this day. It was covered by Def Leppard in the Nineties and provided the Sheffield lads with a hit! The other single LIES IN YOUR EYES fared even worse and proved to be the last hit Sweet would have for a couple of years. It was like the Stones and The Who rolled into one but heavier! The songs on this album were probably the hardest rockers Sweet ever recorded, punctuated by longer instrumental passages, which gave the band the opportunity to prove themselves the fine musicians they had always claimed to be and undoubtedly were. YESTERDAY`S RAIN is a superb track with phased guitar and very clever lyrics. COCKROACH is a fine example of the thunderous new drum sound mentioned previously whilst KEEP IT IN sees the band tying themselves in musical knots on the instrumental mid segment. WHITE MICE is a must for anyone who loves harmony guitarwork. The album closes with an experimental, lengthy, semi-funky plodder called HEALER. Great stuff! Sweet were reviled at the time this album was originally released for ripping off all the great bands of the Seventies but in doing so they came up with something unique! GIVE US A WINK is an essential album for any classic rock collection. ","torrent":{"xt":"urn:btih:d4a046fb69d04f9698e892f0ad74aaf8d16e3dc4","amp;dn":"Sweet+-+Give+Us+A+Wink+%5B1976%5D+EAC+Lame+VBR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4a046fb69d04f9698e892f0ad74aaf8d16e3dc4","infoHashBuffer":{"type":"Buffer","data":[212,160,70,251,105,208,79,150,152,232,146,240,173,116,170,248,209,110,61,196]},"announce":[],"urlList":[]}}