{"title":"Linux in a Nutshell Sixth Edition","uid":9156176,"size":4632423,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d502d9ec4e73544e4ef2addf368b120584ca28d3&amp;dn=Linux+in+a+Nutshell+Sixth+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cabrao","files":-1,"time":1383781982,"description":"Everything you need to know about Linux is in this book. Written by Stephen Figgins, Ellen Siever, Robert Love, and Arnold Robbins -- people with years of active participation in the Linux community -- Linux in a Nutshell, Sixth Edition, thoroughly covers programming tools, system and network administration tools, the shell, editors, and LILO and GRUB boot loaders. \n\nThis updated edition offers a tighter focus on Linux system essentials, as well as more coverage of new capabilities such as virtualization, wireless network management, and revision control with git. It also highlights the most important options for using the vast number of Linux commands. You'll find many helpful new tips and techniques in this reference, whether you're new to this operating system or have been using it for years. \n\nGet the Linux commands for system administration and network management\nUse hundreds of the most important shell commands available on Linux\nUnderstand the Bash shell command-line interpreter\nSearch and process text with regular expressions\nManage your servers via virtualization with Xen and VMware\nUse the Emacs text editor and development environment, as well as the vi, ex, and vim text-manipulation tools\nProcess text files with the sed editor and the gawk programming language\nManage source code with Subversion and git","torrent":{"xt":"urn:btih:d502d9ec4e73544e4ef2addf368b120584ca28d3","amp;dn":"Linux+in+a+Nutshell+Sixth+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d502d9ec4e73544e4ef2addf368b120584ca28d3","infoHashBuffer":{"type":"Buffer","data":[213,2,217,236,78,115,84,78,78,242,173,223,54,139,18,5,132,202,40,211]},"announce":[],"urlList":[]}}