{"title":"Hidden Secrets - Part 37 - Frontmen of The Illuminati - Doc Marq","uid":12219984,"size":3600506141,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d56734413c057b1df79574ef38b217e1b4a29238&amp;dn=Hidden+Secrets+-+Part+37+-+Frontmen+of+The+Illuminati+-+Doc+Marq&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":12,"time":1439342751,"description":"Do you know how Doc Marquis came out of his Satanic coven and the Illuminati? He read the Book of Revelation and realized that he had just read the Plan of the Illuminati! Doc checked to see when the Book of Revelation was written and found it to be late First Century. He already knew that the Illuminati Plan was written in 1773. Therefore, the only reason the Plan so perfectly paralled Revelation is that the power of the Holy Spirit forced Satan to write his Plan so that it was a mirror image of Revelation.\n\nDoc had always been taught that the Satan whom he served was the most powerful in the universe, but he fell on his knees right then and there, asking Jesus to become his Savior!\n\nMarquis will demonstrate how completely the Illuminati Plan will fulfill Bible prophecy once it is completely worked out. This DVD is intended to prove to the unsaved that Jesus Christ is real and will sit in judgment one day for all mankind; this DVD is also intended to move the backslidden Christian to come back to Jesus in repentance because world events are rapidly moving toward the appearance of Antichrist and the completion of all events. Time is short!\n\nA Plan of Salvation is presented at the very end of this video\n\nDoc Marquis uses the King James Bible - 3 1/3 hours long","torrent":{"xt":"urn:btih:d56734413c057b1df79574ef38b217e1b4a29238","amp;dn":"Hidden+Secrets+-+Part+37+-+Frontmen+of+The+Illuminati+-+Doc+Marq","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d56734413c057b1df79574ef38b217e1b4a29238","infoHashBuffer":{"type":"Buffer","data":[213,103,52,65,60,5,123,29,247,149,116,239,56,178,23,225,180,162,146,56]},"announce":[],"urlList":[]}}