{"title":"HTTP Pocket Reference.epub","uid":9857111,"size":175472,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d56742ac8cfdd256afa146496fba1e1c2a0fefe0&amp;dn=HTTP+Pocket+Reference.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xerokull","files":1,"time":1396229205,"description":"The HyperText Transfer Protocol, or HTTP, is the backbone of the World Wide Web. HTTP is the language that each web browser (or other web client) uses to communicate with servers around the world. All web programmers, administrators, and application developers need to be familiar with HTTP in order to work effectively.\n\nThe HTTP Pocket Reference not only provides a solid conceptual foundation of HTTP, it also serves as a quick reference to each of the headers and status codes that comprise an HTTP transaction. The book starts with a tutorial of HTTP, but then explains the client request and server responses in more detail, and gives a thorough technical explanation of more advanced features of HTTP (such as persistent connections and caching).\n\nMost people use the Web every day without knowing anything about HTTP, but for those who need to get &quot;beyond the browser,&quot; this book is the place to start.\n\nAbout the AuthorClinton Wong authored Web Client Programming, published by O'Reilly Associates in 1997. Clinton works on network and security related projects in the Silicon Valley bay area.","torrent":{"xt":"urn:btih:d56742ac8cfdd256afa146496fba1e1c2a0fefe0","amp;dn":"HTTP+Pocket+Reference.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d56742ac8cfdd256afa146496fba1e1c2a0fefe0","infoHashBuffer":{"type":"Buffer","data":[213,103,66,172,140,253,210,86,175,161,70,73,111,186,30,28,42,15,239,224]},"announce":[],"urlList":[]}}