{"title":"Physics of Nuclear Radiations: Concepts, Techniques and Applicat","uid":12596311,"size":18762400,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5de42eaaec4cecc75b83b1a66777a856924d491&amp;dn=Physics+of+Nuclear+Radiations%3A+Concepts%2C+Techniques+and+Applicat&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1445266152,"description":"Title: Physics of Nuclear Radiations: Concepts, Techniques and Applications \r\nAuthor: Chary Rangacharyulu \r\nFormat: PDF \r\nHardcover: 383 pages \r\nPublisher: CRC Press; 1 edition (December 20, 2013) \r\nLanguage: English \r\nISBN: 978-1439857779 \r\n\r\n\r\nPhysics of Nuclear Radiations: Concepts, Techniques and Applications makes the physics of nuclear radiations accessible to students with a basic background in physics and mathematics. The main text avoids calculus, with detailed derivations deferred to endnotes and appendices. The text explains meanings and the significance of equations in detail to be understandable to audiences from various disciplines.\r\n\r\nRather than convince students one way or the other about the hazards of nuclear radiations, the text empowers them with tools to calculate and assess nuclear radiations and their impact. It discusses the meaning behind mathematical formulae as well as the areas in which the equations can be applied.\r\n\r\nAfter reviewing the physics preliminaries, the author addresses the growth and decay of nuclear radiations, the stability of nuclei or particles against radioactive transformations, and the behavior of heavy charged particles, electrons, photons, and neutrons. He then presents the nomenclature and physics reasoning of dosimetry, covers typical nuclear facilities (such as medical x-ray machines and particle accelerators), and describes the physics principles of diverse detectors. The book also discusses methods for measuring energy and time spectroscopies before concluding with applications in agriculture, medicine, industry, and art","torrent":{"xt":"urn:btih:d5de42eaaec4cecc75b83b1a66777a856924d491","amp;dn":"Physics+of+Nuclear+Radiations%3A+Concepts%2C+Techniques+and+Applicat","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5de42eaaec4cecc75b83b1a66777a856924d491","infoHashBuffer":{"type":"Buffer","data":[213,222,66,234,174,196,206,204,117,184,59,26,102,119,122,133,105,36,212,145]},"announce":[],"urlList":[]}}