{"title":"Trust Us, We're Experts  - How Industry Manipulates Science (Ma","uid":4842072,"size":3525581,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d636e5b661446f89309a021478484dfd69862cc0&amp;dn=Trust+Us%2C+We%5C%27re+Experts++-+How+Industry+Manipulates+Science+%28Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"malestrom_HH","files":2,"time":1239543611,"description":" &lt;a href=&quot;http://www.image-upload.net/images/bllqpz7hx05dzfcbdjeh.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/bllqpz7hx05dzfcbdjeh.jpeg&lt;/a&gt;\n\nDJVU reader is included\n\nSheldon Rampton, John Stauber, &quot;Trust Us, We're Experts: How Industry Manipulates Science and Gambles with Your Future&quot;\nPublisher: Tarcher | 2002-01-10 | ISBN 1585421391 | DJVU | 368 pages \n\n\nFearless investigative journalists Sheldon Rampton and John Stauber (Toxic Sludge Is Good for You! and Mad Cow U.S.A.) are back with a gripping expose of the public relations industry and the scientists who back their business-funded, anti-consumer-safety agendas. There are two kinds of &quot;experts&quot; in question--the PR spin doctors behind the scenes and the &quot;independent&quot; experts paraded before the public, scientists who have been hand-selected, cultivated, and paid handsomely to promote the views of corporations involved in controversial actions. Lively writing on controversial topics such as dioxin, bovine growth hormone, and genetically modified food makes this a real page-turner, shocking in its portrayal of the real and potential dangers in each of these technological innovations and of the &quot;media pseudo-environment&quot; created to obfuscate the risks. By financing and publicizing views that support the goals of corporate sponsors, PR campaigns have, over the course of the century, managed to suppress the dangers of lead poisoning for decades, silence the scientist who discovered that rats fed on genetically modified corn had significant organ abnormalities, squelch television and newspaper stories about the risks of bovine growth hormone, and place enough confusion and doubt in the public's mind about global warming to suppress any mobilization for action.\n\nRampton and Stauber introduce the movers and shakers of the PR industry, from the &quot;risk communicators&quot; (whose job is to downplay all risks) and &quot;outrage managers&quot; (with their four strategies--deflect, defer, dismiss, or defeat) to those who specialize in &quot;public policy intelligence&quot; (spying on opponents). Evidently, these elaborate PR campaigns are created for our own good. According to public relations philosophers, the public reacts emotionally to topics related to health and safety and is incapable of holding rational discourse. Needless to say, Rampton and Stauber find these views rather antidemocratic and intend to pull back the curtain to reveal the real wizard in Oz. This is one wake-up call that's hard to resist. --Lesley Reed","torrent":{"xt":"urn:btih:d636e5b661446f89309a021478484dfd69862cc0","amp;dn":"Trust+Us%2C+We%5C%27re+Experts++-+How+Industry+Manipulates+Science+%28Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d636e5b661446f89309a021478484dfd69862cc0","infoHashBuffer":{"type":"Buffer","data":[214,54,229,182,97,68,111,137,48,154,2,20,120,72,77,253,105,134,44,192]},"announce":[],"urlList":[]}}