{"title":"50 Cent - Back Down","uid":7321176,"size":2980492,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d6c8d98f12a1254beb4a9f07cc41b8642c30fe43&amp;dn=50+Cent+-+Back+Down&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Music-Upload","files":1,"time":1338626942,"description":"To Download a pack of 50 Cent songs search this:\n\n50 Cent - 14 song Pack\n\n\n\nTo View some more of my music uploads click this:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Music-Upload&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Music-Upload&lt;/a&gt;\n\n\n\n50 Cent - Back Down Lyrics\n\n\n\nIt's easy to see when you look at me\nIf you look closely, 50 don't BACK DOWN\nEverywhere I go both coasts wit toast\nEastside, Westside, I hold that MACK DOWN\nEvery little nigga you see around me\nHold a gun big enough to fucking hold SHAQ DOWN\nNext time you in the hood and see an OG ITS OG DUMB MOTHERFUCKING CRACKER\nYou ask about me, the young boy don't BACK DOWN\n\nAny living thing that cannot co-exist with the kid\nMust decease existing, little nigga, now listen\nYo mami, yo papi, that bitch you chasing\nYa little dirty ass kids, I'll fucking erase them\nYour success is not enough, you wanna be hard\nKnowing that, you get knocked, you get fucked in the yard\nYouza poptart sweetheart, you soft in the middle\nI eatcha for breakfast, the watch was an exchange for your necklace\nand your boss is a bitch, if he could he would\nSell his soul for cheap, trade his life to be Suge\nYou can buy cars but you can't buy respect in the hood\nMaybe I'm so disrespectful cause to me you're a mystery\nI know niggas from ya hood, you have no history\nNever poked nothing, never popped nothing, nigga stop fronting\nJay put you on, X made you hot\nNow you run around like you some big shot\nHa, ha pussy...\n\n[Chorus]\n\n&quot;This rap shit is all fucked up now! What are we gonna do now?\nHow we gonna eat man? 50 back around&quot;\nThat's Ja's little punk ass thinkin out loud\nSouthside, Tah died, that's just how I get down\nI'm back in the game shawty, to +Rule+ and conquer\nYou sing for hoes and sound like the cookie monster\nI'm the hardest from New York, my flow is bonkers\nAll the other hard niggas, they come from Yonkers\nIt's been years and you had the same niggas in the background\nYou never gonna sell Mitsubishi Tah &amp; Crack Child.\nThem niggas they just SUCK, they no good\nI ain't never heard a nigga say &quot;they like them in the hood&quot;\nI'm back better than ever, on top of my game\nEven them country boys saying &quot;50 we feeling you mayn&quot;\nNow you stay the fuck outta my zone, outta my throne\nI'm New York City's own...BAD GUY (BAD GUY)\n\n[Chorus]\n\nI ain't telling anyone you pussy\nI ain't telling anyone you gettin extorted\nIt ain't over.... (G-UNIT)\nI've been patently waiting to BLOW\nLadies and gentlemen, welcome to the &quot;50 Cent Show&quot;\nThis is my life, my pain, my night, my gun\nNow that I'm back, you can't sleep\nI'm a nightmare huuhhhh\nYou hired cops to hold you down cause you fear for your life\nYou heard about them guns I done bought, right?\nI ain't going no where, I done told you nigga\nI'm a G-Unit motherfucking soldier nigga (They not gonna like you)\nI know, I know...ha, ha (G-UNIT)","torrent":{"xt":"urn:btih:d6c8d98f12a1254beb4a9f07cc41b8642c30fe43","amp;dn":"50+Cent+-+Back+Down","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6c8d98f12a1254beb4a9f07cc41b8642c30fe43","infoHashBuffer":{"type":"Buffer","data":[214,200,217,143,18,161,37,75,235,74,159,7,204,65,184,100,44,48,254,67]},"announce":[],"urlList":[]}}