{"title":"Jagged Alliance, Back in Action, mod Ultimate AIM-Professionals","uid":7159890,"size":243488829,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d7645e46bd0ca4275e9552f08144437c232cb7c2&amp;dn=Jagged+Alliance%2C+Back+in+Action%2C+mod+Ultimate+AIM-Professionals+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"finnbat","files":1,"time":1333577169,"description":"Thank you for downloading this Ultimate AIM-Professionals mod vers. 1.1\n\nUnzip it to:  steamsteamappscommonjabia\n\nThe 1.1 release have new weapon and ammunition files. \nAfter many hours of testing and researching I found the perfect formula for snipers in the game.\n\nI used WilsonMG (Blue Dawn) formulas and also BlackAlphas \n(Firearms Rebalanced Experimental)  formulas in my own way. \nI liked the of the ideas those guys have found. But then my own experiences \nas a Recon Team sniper (Finish Paratroopers, long range, RecBatt)\nI felt long time ago that, in this game the sniper are not working as in reality.\nNow I had finally time for this testings with these values.\n\nWe also have a nice video of these tests and go for yourself and watch it. You will find it from AddMe Youtube website:\n\nNow I also want to tell you that the difference with headshots and shots to torso are making the realism. And it is how it works in real world also. I am very happy \nI found right values so you also can enjoy role-play a real sniper. \nWell, allmost...\n\nThere is also a new background video. I encourage you to sometime just sit and listen to the new nice music we have in game and watch the video in background. It is a video from CIA satellite spycamera which was hacked. Place is unknow, but it is from Arulco.\n\nThere is also a new background for the in-game laptop.\n\nSome minor adjustments have been made in several files. All small fixes which I have noticed during playing the mod and had few emails also from you guys.\n\nThanks for all the kind support you have given.\n\nHappy Hunting !\n\n\nFinnBat\n\n\nBig thanks to my friend,  Dan  (Im@rtAl) who have helped me very much.\nYou can follow my Blog from: ","torrent":{"xt":"urn:btih:d7645e46bd0ca4275e9552f08144437c232cb7c2","amp;dn":"Jagged+Alliance%2C+Back+in+Action%2C+mod+Ultimate+AIM-Professionals+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7645e46bd0ca4275e9552f08144437c232cb7c2","infoHashBuffer":{"type":"Buffer","data":[215,100,94,70,189,12,164,39,94,149,82,240,129,68,67,124,35,44,183,194]},"announce":[],"urlList":[]}}