{"title":"Myron Fagan - The Illuminati and CFR (Tape Noise Cleaned Out)","uid":3433808,"size":45423804,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d7edb36f35065343915e9160b6980cdc5f044ba5&amp;dn=Myron+Fagan+-+The+Illuminati+and+CFR+%28Tape+Noise+Cleaned+Out%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ReVIsed","files":1,"time":1137804992,"description":"In his sensational recording, Myron Fagan reveals the beginning of the One World enslavement plot that was launched two centuries ago by one Adam Weishaupt, an apostate Catholic Priest who - financed by the House of Rothschild - created what Weishaupt called the Illuminati. \n\nMr. Fagan describes with documentary evidence, how this Illuminati became the instrument of the House of Rothschild to achieve a One World Government and how every war during the past two centuries was fomented by this Illuminati. \n\nHe describes how one Jacob H. Schiff was sent to the United States by the Rothschilds to further the Illuminati plot and how Schiff plotted to get control of both the Democratic and the Republican Parties. How Schiff seduced our Congress and our Presidents to achieve control of our entire money system and create the Income Tax cancer and how Schiff and his co-conspirators created the Council on Foreign Relations to control our elected officials to gradually drive the U.S. into becoming an enslaved unit of a United Nations, One World Government.","torrent":{"xt":"urn:btih:d7edb36f35065343915e9160b6980cdc5f044ba5","amp;dn":"Myron+Fagan+-+The+Illuminati+and+CFR+%28Tape+Noise+Cleaned+Out%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7edb36f35065343915e9160b6980cdc5f044ba5","infoHashBuffer":{"type":"Buffer","data":[215,237,179,111,53,6,83,67,145,94,145,96,182,152,12,220,95,4,75,165]},"announce":[],"urlList":[]}}