{"title":"Heat Pipes and Solid Sorption Transformations","uid":14650963,"size":60308163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d81d7f891f784e75ef445ed85120ddf0cea32b6b&amp;dn=Heat+Pipes+and+Solid+Sorption+Transformations&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463626396,"description":"Heat Pipes and Solid Sorption Transformations - Fundamentals and Practical Applications - L.L. Vasiliev, Sadik Kakaç (CRC, 2013).pdf\r\n\r\nISBN 978-1-4665-6415-2\r\n\r\nDeveloping clean energy and utilizing waste energy has become increasingly vital. Research targeting the advancement of thermally powered adsorption cooling technologies has progressed in the past few decades, and the awareness of fuel cells and thermally activated (heat pipe heat exchangers) adsorption systems using natural refrigerants and/or alternatives to hydrofluorocarbon-based refrigerants is becoming ever more important. Heat Pipes and Solid Sorption Transformations: Fundamentals and Practical Applications concentrates on state-of-the-art adsorption research and technologies for relevant applications based on the use of efficient heat transfer devices—heat pipe and two-phase thermosyphons—with the objectives of energy efficiency and sustainability. This book also discusses heat pipe thermal control as it relates to spacecraft applications.\r\n\r\n\r\nThe first few chapters of Heat Pipes and Solid Sorption Transformations: Fundamentals and Practical Applications focus on heating and cooling, the principles of adsorption, adsorption dynamics, and the availability of three-phase boundaries. Other chapters cover successful heat pipe applications and heat-pipe-based thermal control of fuel cells, solid sorption transformers, and electronic components and air-condition devices. The final chapters summarize the achievements in the field of heat and mass transfer study in heat pipes with variable properties such as gas loaded heat pipes. Several configurations of thermosyphons are showcased, with suggested applications. A number of examples of equipment using the thermosyphon technology are presented and, in the final chapter, the concept of flow boiling and flow condensation heat transfer in micochannels is analyzed in detail","torrent":{"xt":"urn:btih:d81d7f891f784e75ef445ed85120ddf0cea32b6b","amp;dn":"Heat+Pipes+and+Solid+Sorption+Transformations","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d81d7f891f784e75ef445ed85120ddf0cea32b6b","infoHashBuffer":{"type":"Buffer","data":[216,29,127,137,31,120,78,117,239,68,94,216,81,32,221,240,206,163,43,107]},"announce":[],"urlList":[]}}