{"title":"Robert Rich - Somnium","uid":4657493,"size":1798160688,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d8ab6281a14a5dd60f299f9344050d9a56d0b79d&amp;dn=Robert+Rich+-+Somnium&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iceolate","files":4,"time":1232255998,"description":"Rich, Robert\nSomnium\n2001 | Hypnos / Soundscape Productions | HYP02131\nDVD\n\n\nTotal Time: 7 hours\n\nPart 1: 2 hours, 35 minutes\nPart 2: 2 hours\nPart 3: 2 hours, 25 minutes\n\n\nAssembled and edited from August 1999 to July 2000, using sound elements recorded between 1994 and 2000 by Robert Rich. Instrumental sounds include analog and digital electronics, processed flutes and acoustic piano, lap steel guitar with Sustainiac Model B, chimes and bowed metal. Environmental sounds recorded by Robert Rich in California, Iowa, Minnesota, Washington and Mexico. Additional sounds include electric fish (Apteronotus leptorhyncus) recorded at Scripps Institute with the assistance of Calvin Wong, and processed environments from the library of Andy Wiskes. Authored at EP Visual in Philadelphia by Pete Meyers and Adam Peterson.\n\nHypnos Recordings, in conjunction with Robert Rich's Soundscape Productions and Release Entertainment, is pleased to announce the release of a very special recording. Robert Rich's Somnium is a 7-hour continuous &quot;sleep concert&quot; recording in DVD format.\n\nThe notorious &quot;sleep concerts&quot; began during Robert's time at Stanford University in the early 1980s. These sleep concerts have been much discussed by fans of ambient/space music, but few current fans have actually attended a sleep concert. Consequently, a lot of speculation and mystery has grown about the experience of the &quot;legendary sleep concerts.&quot; Now you'll have an opportunity to stretch out in the dark and listen to some of Robert Rich's finest deep, subliminal ambience.\n\nA bit of clarification about the format of Somnium: it's an ordinary DVD-video disc, playable in regular, garden-variety home DVD players, as well as DVD-rom drives on you PC or Mac. It does not require (and in fact is not compatible with) esoteric &quot;DVD-audio&quot; format players.\n\nThe DVD-video format was used because it enabled us to store 7 hours of continuous audio (believed to be the longest continuous commercial recording ever released in any format) on one side of one DVD. No stops in the program... no need to change discs, or wait for a changer to swap from disc 5 to disc 6, for example. It is a stereo (two channel) program, not 5.1 surround.\n\nRobert writes:\nSomnium represents the culmination of almost 20 years of research, field recordings, performances, and studio experimentation. This might also be the longest continuous composition ever released as a single recording. Somnium summarizes a major portion of my life's work, to create a womblike sonic environment that takes listeners on a journey through their own subconscious. This is my deepest, slowest, most atmospheric recording.\n\nSomnium reflects the rarified mood of a Sleep Concert, but I chose not to use a live recording from one of the events. I decided to start from scratch in the studio, to build an idealized sound world that could create an environmental surround in people's homes.\n\n\nListening Tips:\n\nYou can listen to Somnium at any hour, at any volume, but it works best quietly at night. You can set the best listening levels by adjusting the first 10 minutes so that it plays at a soft, comfortable volume for falling asleep. The environmental sounds during these opening minutes should be nearly inaudible. The music will gradually slow down and become quieter during the first hour, so that when you are sleeping, it should be soft enough that it hovers just at the edge of awareness.\n\nYou can create the optimum listening environment with mutiple speakers arranged in a circle around the listening space. Although Somnium is a stereo recording, you can use the effects settings in a 5.1-channel home theatre amplifier to create the illusion of a complete environment. A four speaker stereo arrangement can also succeed in evoking this environmental effect. You can listen to Somnium in your sleep with a small pair of headphones, although these can become uncomfortable if you try to sleep on your side. If you choose to use headphones, be sure to keep the volume extremely low.\n\nSomnium and the Sleep Concert\nby Robert Rich\n\nThe term &quot;Sleep Concert&quot; can be a bit misleading, as it implies that this music is intended to help you sleep deeply. On the contrary, when you play Somnium at night, you may find that you sleep less deeply, and wake up more often. The idea is to let the music incorporate itself into your perceptual framework during the night, to create a sonic surround, an environment for unique states of consciousness. The music is aimed at the nebulous territory that exists in your mind when you are hovering between awake and asleep, when you are still aware of your environment, yet detached, when your half-sleeping mind wanders into the realm of hypnogogic images and dreamlike non-linearity. You might find that this music can act as a trigger for these flowing thoughts, and the activation of the environment around you can help you to skate around the edges of sleep, with one foot in the dream world and one foot in the room where you are sleeping.\n\nThe experience of listening to Somnium in your home will differ from the experience of audience members during the Sleep Concerts that inspired this music. In the concert environment, an additional state of heightened arousal can occur from social factors, whereas the environment of the home is more relaxed. At home you will have more choices about the way you listen to this music, so the music must also conform to these different possibilities.\n\nCertain things happen when many people sleep in a room together. In general, people sleep less deeply. One of the more mundane reasons for this is snoring. An estimated 10% of the population snores, which means that in a room with 50-100 people, some will snore. Since the music is generally very quiet, snoring can become invasive (and sometimes it's quite funny.) Besides snoring, other interruptions will doubtless invade the Sleep Concert ambience. Among these may be traffic sounds, car alarms, sirens, or people walking around in the room when they get up to use the bathroom. Audience members may also notice my presence in the room as I work behind the mixer. The simple noises of other people can keep listeners in a lighter sleep.\n\nInterestingly, people become more physiologically activated merely by being in the proximity of other people. Perhaps this arousal is a purely chemical phenomenon. This is one of the interesting features that distinguish a live Sleep Concert from listening to Somnium at home. In the act of bringing a group of people together in the same room, we create an energized environment, which can contribute to the intensity of personal experiences. But for these factors to contribute to an interesting aesthetic experience, listeners must combine this activation with an increase in attention to internal states of mind. The music helps to intensify this internal focus. You can use Somnium at home in the same way.\n\nThe musical environment of Somnium can act like a lens to sharpen mental images, a stimulus to help you generate internal realities. Some of the sounds are abstract, blurry, hard to separate from the background. Other sounds evoke natural environments, open spaces, insects and animal calls, wind or rain. The music can replace the acoustics of a room with a shifting virtual soundscape.\n\nTo get the most out of Somnium, I recommend that you focus on several aspects of the sleeping experience. The most interesting experiences will occur in the transitions between sleeping and waking, and later when you are dreaming. Stage 1, non-REM sleep is the transitional stage of sleep, when you are still partly conscious of your environment. This distinguishes it from Rapid Eye Movement sleep (REM), when you have the most coherent dreams.\n\nDuring the transitions into Stage 1 sleep, you might have dreamlike thoughts and visions called hypnogogic images. Hypnogogic images are often less organized than true dreams, and often come blended with a semi-awareness of your environment. If you pass from this stage into a deeper sleep, you will not remember these images and thoughts. But if you can linger at the edge, slipping in and out of stage 1 sleep, you can ride along the edge of your own awareness. You can use the music as a focal point to hold yourself right at the brink of sleep, to help you maintain this hypnogogic state like a surfer uses gravity to stay on the leading edge of a wave. During these hypnogogic experiences, you might find that the sonic environment triggers dreamlike hallucinations, evoking fragile new mental landscapes.\n\nYou might also remember more dreams while sleeping with Somnium, and they might be more vivid and intense. The reasons for this again relate to the activated environment. In order to remember a dream, you must wake up from it. The more you pay attention upon awakening, the more you will remember and the more vivid the memories will be.\n\nOne of the more interesting dream experiences you might encounter is lucid dreaming - when you become aware that you are dreaming while still in the dream. Once you become aware that you are dreaming, you can affect the action within your dream, letting you explore the dream world actively rather than as a passive observer. Lucid dreaming becomes possible when you pay attention to the signs that you are dreaming, when you attend to your conscious processes. You may find that the activating nature of the Somnium environment can help you to pay closer attention to your mental states, and may even help you have a lucid dream.\n\nFor some people, more intense dreams can become unpleasant, due in part to negative expectations and mental habit. Self-awareness, and lucid dreaming in particular, can help overcome some of these habitual reactions. When you dream, your mind is trying to interpret current physiological and environmental conditions, and these interpretations can become incorporated into dream content. If your body starts to generate more energy or tension, the brain can interpret this arousal as fear, and the night's dreams might develop some dark overtones. However, the brain can also interpret arousal as mystical ecstasy, joy or sexual energy. All of these feelings are closely related in the body, and they relate closely to past experiences, expectations and environmental cues. The music on Somnium does not intentionally evoke any specific images, light or dark, but rather hangs in an indistinct place which you can interpret in many ways, like the ink-blots of a Rorschach test.\n\nThe dream journey resembles a shaman's journey, in that shamans know that they carry with them their own expectations when they enter their spirit world. Likewise, your past and your preconceptions will influence your dreams, along with your current environment. Throughout Somnium, the music gets quite deep, it explores the shadows. The music is also quite gentle. If you open yourself up to the possibility of intense experience, you can explore your mental states with an open mind. Even the shadows contain useful information. The more you pay attention, the more you might find.\n\nTechnical Notes:\n\nWe chose the DVD-V format for Somnium because it is the only widespread format (so far) that holds enough information to play seven hours of high quality audio. We did have to make a few compromises, however, to fit this music on the disk. You may notice that you cannot fast-forward or rewind through each audio segment. You can only skip to the start points. This is because the DVD-V format requires video frames for navigation, and in order to fit seven hours of video on the disk, we would have to compress the audio. We found the compression artifacts to be unacceptable, so we left the audio at the highest possible resolution and omitted the navigation. Even with no video track, we still had to compress one section with Dolby AC3 to fit everything on the disk. We chose Part 2 because its audio content suffered least from compression artifacts, and we used the highest quality (2:1) AC3 compression rate to compress that segment of Somnium.\n\nOther Albums by This Artist\n\n   1. Inner Landscape CD (Hypnos / Soundscape Productions, 1985)\n   2. Amoeba Side-Project: Watchful - OUT OF PRINT CD (Release / Relapse, 1997)\n   3. Seven Veils CD (Fathom, 1998)\n   4. Humidity 3-CD (Hypnos / Soundscape Productions, 1998)\n   5. Sunyata CD (Hypnos / Soundscape Productions, 2000)\n   6. Amoeba side-project: Pivot - OUT OF PRINT CD (Release / Relapse, 2001)\n   7. Bestiary CD (Release Entertainment, 2001)\n   8. Temple of the Invisible CD (Soundscape Productions, 2003)\n   9. Open Window CD (Soundscape Productions, 2004)\n  10. Calling Down The Sky (Live 2003) CD (Soundscape Productions, 2004)\n  11. &amp; Ian Boddy: Lithosphere CD (DiN/Soundscape, 2005)\n  12. Echo of Small Things CD (Soundscape Productions, 2005)\n  13. Electric Ladder CD (Soundscape, 2006)\n  14. Music From Atlas Dei CD (Soundscape, 2007)\n  15. Illumination CD (Soundscape Productions, 2007)\n  16. &amp; Markus Reuter: Eleven Questions CD (Unsung Records, 2007)\n  17. &amp; Ian Boddy: React CD (DiN/Soundscape, 2008)\n  18. and Faryus: Zerkalo CD (Faria/Soundscape, 2008)\n","torrent":{"xt":"urn:btih:d8ab6281a14a5dd60f299f9344050d9a56d0b79d","amp;dn":"Robert+Rich+-+Somnium","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8ab6281a14a5dd60f299f9344050d9a56d0b79d","infoHashBuffer":{"type":"Buffer","data":[216,171,98,129,161,74,93,214,15,41,159,147,68,5,13,154,86,208,183,157]},"announce":[],"urlList":[]}}