{"title":"Robert Fripp - Let the Power Fall","uid":6432848,"size":99434651,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d93b32897deeb7f49f0f667230703a2b9c104f4e&amp;dn=Robert+Fripp+-+Let+the+Power+Fall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rugalin","files":7,"time":1306713221,"description":"Audio format: Mp3 cbr 256 kbit/s\n\nLet the Power Fall is an album of Frippertronics, which to the uninitiated can sound like electrical hum. In reality it's a technique developed with Brian Eno, which allows the guitarist to play against a tape loop of sustained notes. With Frippertronics as his mantra, Robert Fripp creates impressive instrumental structures by building layers of sound atop one another. This sort of ambient music is conducive to a specific frame of mind, but like Eno's Discreet Music it rewards the careful listener. Let the Power Fall can be seen as a refinement of the music explored on earlier Fripp &amp; Eno collaborations, though with Eno out of the equation the songs take a decidedly more mathematical bent. The record begins with &quot;1984,&quot; picking up where Under Heavy Manners/God Save the Queen left off. The song titles are better seen as successive numbers in a catalog than specific dates, as they're all of a piece. You could make a case that &quot;1984,&quot; &quot;1987,&quot; and &quot;1988&quot; are the most impressive constructs, but it's foolish to put much meaning behind that. While Fripp employs the same soothing waves of sound that Eno used on Evening Star and Discreet Music, there's only so much that can be made from Frippertronics (think Yosemite Sam and his coconuts), and the end result feels a little cold and remote when compared with Eno's warm ambient textures. Let the Power Fall may be the ideal album of Frippertronics, yet it's a technique that, while fascinating at times, has its own limitations.\n\nReview by Dave Connolly (allmusic.com)\n","torrent":{"xt":"urn:btih:d93b32897deeb7f49f0f667230703a2b9c104f4e","amp;dn":"Robert+Fripp+-+Let+the+Power+Fall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d93b32897deeb7f49f0f667230703a2b9c104f4e","infoHashBuffer":{"type":"Buffer","data":[217,59,50,137,125,238,183,244,159,15,102,114,48,112,58,43,156,16,79,78]},"announce":[],"urlList":[]}}