{"title":"Nickelodeon All-Stars Tennis v1.0.3 Android","uid":14024021,"size":203956502,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:db9607d32859a7b3901f95207548d9b977632aa2&amp;dn=Nickelodeon+All-Stars+Tennis+v1.0.3+Android&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":2,"time":1458886833,"description":"Test your tennis skills against some of your favourite Nickelodeon characters as you climb the All Stars Tennis ranks from Rookie to World Champion! Play through 9 tournaments from the Bikini Bottom Cup and TMNT Challenge to the Down Under Slam. Unlock awesome playable characters, outfits and power rackets including SpongeBob SquarePants, the Teenage Mutant NinjaTurtles, and Sanjay and Craig!\r\n\r\nFast and fun gameplay and an awesome range of play styles, unlockable equipment, player customisation and tournaments. You can even challenge friends for Tennis glory!\r\nSummary of grand slam features -\r\n\r\n• Play as SpongeBob, Patrick, Leo, Mikey, Donnie, Raph or Sanjay and Craig.\r\n• Create your favourite player and climb the All Stars Tennis ranks across 9 tournaments\r\n• Action packed adrenalin fun with awesome tap and swipe controls for all the shots\r\n• Play top spins, slices, lobs and smashes from the baseline or net!\r\n• Crazy powerups including slime bombs, boomerang, whirlwind and more!\r\n• Amazing Tennis gameplay, upgradable characters and skills progression\r\n• Challenge friends for high score glory. Send Taunts and Gifts!\r\n• Colorful, vivid cartoon graphics and pumping soundtrack with umpire calls!\r\n• Universal App, optimized for phones and tablets. \r\n\r\nThe ball is in your court. Play now! Nickelodeon is the presenting partner for Kids Tennis Days around Australia, where kids will have the chance to experience tennis and play ANZ Tennis Hot Shots, Tennis Australia’s official development program. In 2016, the Australian Open is bigger and better than ever, with the all-new Australian Open Festival at Birrarung Marr. Kids’ World at the Australian Open Festival will feature a Nickelodeon playground and include characters SpongeBob SquarePants and Teenage Mutant Ninja Turtles, as well as the world famous Slime Lab.\r\n\r\nNickelodeon All Stars Tennis collects personal user data as well as non-personal user data (including aggregated data). User data collection is in accordance with applicable law, such as COPPA. User data may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content and advertising; and manage and improve Nickelodeon's services. For more information regarding Nickelodeon’s use of personal user data, please visit the Nickelodeon Group Privacy Policy below. Our Privacy Policy is in addition to any terms, conditions or policies agreed to between you and Google. Nickelodeon and its affiliated entities are not responsible for Google's collection or use of your personal user data and information. Use of this app is subject to the Nickelodeon End User License Agreement.\r\n\r\nWhat's in this version : (Updated : 14 January 2016)\r\nNo recent changes\r\nRequired Android O/S : 2.3.3 and up","torrent":{"xt":"urn:btih:db9607d32859a7b3901f95207548d9b977632aa2","amp;dn":"Nickelodeon+All-Stars+Tennis+v1.0.3+Android","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db9607d32859a7b3901f95207548d9b977632aa2","infoHashBuffer":{"type":"Buffer","data":[219,150,7,211,40,89,167,179,144,31,149,32,117,72,217,185,119,99,42,162]},"announce":[],"urlList":[]}}