{"title":"Gay Porn - [FFL] [Jet Set] Pizza Boy Gangbang (2010) ","uid":12323673,"size":691534602,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:dc4c5d48ce45dd7837ef9b810e6ad65f165570bb&amp;dn=+Gay+Porn+-+%5BFFL%5D+%5BJet+Set%5D+Pizza+Boy+Gangbang+%282010%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Chinu685","files":1,"time":1441086350,"description":"\n\nDescription:\n\nTake one ripped, handsome blue-eyed and flirtatious pizza delivery boy who promises but refuses to totally deliver and add almost a dozen horny guys and you've got the recipe for a hot, spicy and merciless revenge gangbang where each guy takes his turn trying to gag the blonde boy into submission with their big, meaty dicks, leading to an anal free-for-all that includes a double penetration and enough tasty, good old-fashioned muscled-buttfucking to satisfy even the horniest guy's hunger.\n\n\nScene 1: Jet Set Exclusives Hayden Stephens &amp; Dylan Roberts\n\nAfter getting played again by his always-flirtatious pizza boy, Hayden Stephens is surprised to find himself in his restaurant with a drunken Dylan Roberts, who's in no shape to drive home but plenty relaxed enough to play substitute pizza boy by getting in (and out of) costume and thereby providing Stephens with some temporary relief.\n\nScene 2: Jet Set Exclusives Hayden Stephens &amp; Landon Mycles, Joshua Logan, Chasen, Casey Monroe, Jesse Santana, Elijah Michaels, Parker Perry, Jake Lyons, Dayton O'Connor, Tucker Jennings\n\nLandon Mycles continues to flirt, but this time with a restaurant crowded with horny guys short on patience and long on dick. Pizza 'boss' Hayden Stephens sees it all and sets Mycles up to go down on all 10 guys. Cornered, Mycles delivers with very little gagging and lots of gusto to the full lineup of dudes, who then mix it up with a little butt pounding added into the mix, ending with Mycles, flat on the floor, being showered by every load and capping it off with his own creamy explosion just seconds after the last guy drops his jizz on him.\n\nScene 3:Jet Set Exclusives Hayden Stephens &amp; Landon Mycles, Joshua Logan, Chasen, Casey Monroe, Jesse Santana, Elijah Michaels, Parker Perry, Jake Lyons, Dayton O'Connor, Tucker Jennings\n\nBy the time all 11 guys shoot their first loads on Mycles (including himself), some are horny again, so the gang decides it's time for the real banging to begin. Mycles and always-eager bottom Jesse Santana serve up their asses to the hungry crowd along with several other 'plow me now' bottoms. Santana does double anal duty on the cocks of Stephens and Dayton O'Connor, taking both at once and also topping later himself, while the guys themselves mix and match in a relentless stream of ass slamming that cannot be ordered from the menu but sure delivers a heap of satisfaction to the almost dozen hungry, hungry hunks. The scene ends with each spraying out a second geyser of cum on the chest of the waiting pizza boy, who again shoots on himself and then, having completed his biggest delivery ever, flashes that killer smile.\n &lt;a href=&quot;\nhttp://sexyimage.org/img-55e52027b0f8c.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexyimage.org/img-55e52027b0f8c.html&lt;/a&gt;\n\n\n\n..:For more awesome stuff please click below:..\n                                    &lt;a href=&quot;\nhttps://thepiratebay.la/user/Chinu685/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.la/user/Chinu685/&lt;/a&gt;","torrent":{"xt":"urn:btih:dc4c5d48ce45dd7837ef9b810e6ad65f165570bb","amp;dn":"+Gay+Porn+-+%5BFFL%5D+%5BJet+Set%5D+Pizza+Boy+Gangbang+%282010%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc4c5d48ce45dd7837ef9b810e6ad65f165570bb","infoHashBuffer":{"type":"Buffer","data":[220,76,93,72,206,69,221,120,55,239,155,129,14,106,214,95,22,85,112,187]},"announce":[],"urlList":[]}}