{"title":"Questo.Piccolo.Grande.Amore.2008.iTALiA.DVDRip.XviD-Republic[vol","uid":4904271,"size":1467990016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dc51aa60acc79a834d18a8ccd2f4d1e7e3198861&amp;dn=Questo.Piccolo.Grande.Amore.2008.iTALiA.DVDRip.XviD-Republic%5Bvol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Volpebianca","files":2,"time":1242813762,"description":":::Scheda del film:::\nTitolo: Questo piccolo grande amore\nTitolo originale: Questo piccolo grande amore\nNazionalitÃƒÂ : Italia\nAnno: 2009\nGenere: Commedia\nRegia: Riccardo Donna\nData di uscita: 11 Febbraio 2009 (cinema)\nCast:Emanuele Bosi, Mary Petruolo, Daniela Giordano, Mariella Valentini, Federico Galante, Claudio Cotugno, Valentino Campitelli, Giulia Amato, Veronica Corsi\n\n:::Trama:::\n\nPrimi anni Settanta, a Roma. Andrea ha diciannove anni, Giulia diciassette. Si incontrano per la prima volta in un bar, per caso. Ancora non lo sanno, mentre si scambiano le prime parole e si guardano negli occhi come scoprendosi, ma quello ÃƒÂ¨ un incontro che segnerÃƒÂ  per sempre le loro vite. Andrea ÃƒÂ¨ al primo anno di architettura, immagina di poter cambiare il mondo con i suoi progetti, i suoi disegni, i suoi sogni. Giulia ÃƒÂ¨ all'ultimo anno di liceo classico, ÃƒÂ¨ timida, inesperta, impaurita dal primo vero sentimento della sua vita. Vengono da mondi diversi, hanno amici diversi, e due vite diverse che li chiamano prepotentemente in direzioni opposte. Attraversano insieme un pezzo di vita, conoscendosi, amandosi disperatamente, rifugiandosi uno nelle braccia dell'altra, con l'incoscienza e la paura di chi fa ogni cosa per la prima volta, usando parole, gesti, sguardi che non sono mai stati conosciuti prima. Questo Piccolo Grande Amore racconta la prima, vera storia d'amore di due ragazzi, l'ultima avventura dell'adolescenza prima di diventare adulti, il sogno di una passione senza limiti e senza fine che si scontra con la realtÃƒÂ  quotidiana. Una storia cosÃƒÂ¬ travolgente da costringere il mondo a ritirarsi, a farsi da parte, a cedere alle visioni d'amore dei due ragazzi. Le strade e le piazze della cittÃƒÂ  si trasformano nello scenario del loro sogno romantico, mentre le canzoni dell'album di Claudio Baglioni scandiscono i momenti piÃƒÂ¹ importanti della loro storia: il primo bacio sul Lungotevere, la paura di perdere la libertÃƒÂ , la loro prima volta, la gelosia, la separazione improvvisa, il lacerante senso di mancanza, la paura del tradimento e infine, nel ritrovarsi, la coscienza di avere vissuto la piÃƒÂ¹ grande avventura della loro vita di ragazzi. Di avere attraversato giorni che resteranno irripetibili per le loro vite a venire. La storia del primo amore di Andrea e Giulia, che diventa la storia di tutti gli indimenticabili primi amori delle nostre vite.\n\nQualitÃƒÂ  audio e video Ottima da DVD.","torrent":{"xt":"urn:btih:dc51aa60acc79a834d18a8ccd2f4d1e7e3198861","amp;dn":"Questo.Piccolo.Grande.Amore.2008.iTALiA.DVDRip.XviD-Republic%5Bvol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc51aa60acc79a834d18a8ccd2f4d1e7e3198861","infoHashBuffer":{"type":"Buffer","data":[220,81,170,96,172,199,154,131,77,24,168,204,210,244,209,231,227,25,136,97]},"announce":[],"urlList":[]}}