{"title":"(2012) The Agonist - Prisoners [FLAC+.cue] {100.XY}","uid":8385106,"size":461820184,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dd8cf5ca18cdd9c566624272d44f33f48b32a14b&amp;dn=%282012%29+The+Agonist+-+Prisoners+%5BFLAC%2B.cue%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"100.XY","files":14,"time":1366268717,"description":"bayimg off..no pic to upload :-(\n\nWikipedia:\nThe Agonist is a Canadian metal band from Montreal, Quebec formed in 2004 by guitarist Danny Marino, bassist Chris Kells, and vocalist Alissa White-Gluz, who uses both vocal fry and clean vocals for the band. Originally known as The Tempest, the band adopted their current moniker upon their signing to Century Media in 2007. To date, The Agonist has released three studio albums, the third - &quot;Prisoners&quot; - was released June 4, 2012. Touring extensively since their first album, they have shared the stage with bands such as Arsonists Get All the Girls, Epica, The Faceless, Chelsea Grin, Kamelot, Visions of Atlantis and many more.\n\n\nReview:\nPrisoners is an incredibly solid album throughout. Everyone in the band (and I mean EVERYONE) has upped their game on this release. The drumming is tight and interesting, holding songs together even at their most wild and frantic moments. New guitarist Paco provides a new element to the band's music; technical shredding, solos and harmonic leads over Danny Marino's natural climbing riffs. Hell, the bass is at least slightly more audible than on the last album. \n\nAnd then, of course, we reach Alissa. The band's attractive frontwoman and vocal powerhouse shines as ever here. Her growls are evil sounding and diverse, but more importantly Prisoners goes on to show that Alissa can really sing. Her hit and miss cleans almost ruined the last album, so I was both apprehensive and hopeful about her singing this time around. The strange half-growled-half-clean vocal style shown in the choruses of 'Predator and Prayer' and 'You're Coming With Me' is really down to personal taste, I wasn't too fond of it. But the chorus and groovy ending of 'Dead Ocean', most of 'Anxious Darwinians' and the epic finale of 'Revenge of the Dadaists' show that it's not only in the growl department that Alissa has serious power.\nReview by My1mmortal\nfull review at http://www.sputnikmusic.com/review/50160/The-Agonist-Prisoners/\n\n\nCountry: Canada\nGenre: Metalcore, Melodic Death Metal\nQuality: FLAC/tracks+.cue\n\nTracklist:\n01. You're Coming with Me\n02. The Escape\n03. Predator And Prayer\n04. Anxious Darwinians\n05. Panophobia\n06. Ideomotor\n07. Lonely Solipsist\n08. Dead Ocean\n09. The Mass Of The Earth\n10. Everybody Wants You (Dead)\n11. Revenge Of The Dadaists\n","torrent":{"xt":"urn:btih:dd8cf5ca18cdd9c566624272d44f33f48b32a14b","amp;dn":"%282012%29+The+Agonist+-+Prisoners+%5BFLAC%2B.cue%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd8cf5ca18cdd9c566624272d44f33f48b32a14b","infoHashBuffer":{"type":"Buffer","data":[221,140,245,202,24,205,217,197,102,98,66,114,212,79,51,244,139,50,161,75]},"announce":[],"urlList":[]}}