{"title":"Imaging Technologies and Data Processing for Food Engineers","uid":15086418,"size":39234672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddb8575e3cc23d85aeda19e0838e7fc80fd3c3e7&amp;dn=Imaging+Technologies+and+Data+Processing+for+Food+Engineers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466887479,"description":"Imaging Technologies and Data Processing for Food Engineers - Nesli Sozer (Springer, 2016).pdf\r\n\r\nISBN 978-3-319-24733-5\r\n\r\nFood products are complex in nature which makes their analysis difficult. Different scientific disciplines such as biochemistry, microbiology, and nutrition, together with engineering concepts are involved in their characterization. However, imaging of food materials and data analysis has gained more importance due to innovations in the food industry, as well as the emergence of food nanotechnology. Image analysis protocols and techniques can be used in food structure analysis and process monitoring. Therefore, food structure imaging is crucial for various sections of the food chain starting from the raw material to the end product. This book provides information on imaging techniques such as electron microscopy, laser microscopy, x-ray tomography, raman and infrared imaging, together with data analysis protocols. It addresses the most recent advances in imaging technologies and data analysis of grains, liquid food systems (i.e. emulsions and gels), semi-solid and solid foams (i.e. bakery products, dough, expanded snacks), protein films, fruits and vegetable confectionery and nuts.\r\nThis book also:\r\n\r\nProvides in-depth view of raw material characterization and process control\r\nCovers structure-functionality and structure-texture relationships\r\nReviews applications to emerging areas of food science with an insight into future trends","torrent":{"xt":"urn:btih:ddb8575e3cc23d85aeda19e0838e7fc80fd3c3e7","amp;dn":"Imaging+Technologies+and+Data+Processing+for+Food+Engineers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddb8575e3cc23d85aeda19e0838e7fc80fd3c3e7","infoHashBuffer":{"type":"Buffer","data":[221,184,87,94,60,194,61,133,174,218,25,224,131,142,127,200,15,211,195,231]},"announce":[],"urlList":[]}}