{"title":"Prisoners 2013.1080p.BluRay.x264 . NVEE","uid":9421653,"size":3584720790,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:dde888a567e440d9ddab5e4a574e2ec77a18c46d&amp;dn=Prisoners+2013.1080p.BluRay.x264+.+NVEE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".NVEE","files":-1,"time":1388602003,"description":"FULL_INFOs\n\n\n99.99%  SYNCED GUARANTEED \n\n&quot;Totally scrutinized / analyzed to be a verified torrent.&quot;\n___________________________________________\n\nSource : Blu-ray ~ 1080p\n\nMy Media Player of Choice &quot;VLC Media Player via HDMI&quot;\n\nSpoken Language : English\n\nAudio : 6 ~ Channels Only\n\nDon't delete torrent link,... Please seed . NVEE\n_____________________________________\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1392214/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1392214/&lt;/a&gt;\n\n\n\nSubs Info : MULTI_SUBS\n\n &lt;a href=&quot;\nhttp://www.subtitleseeker.com/1392214/Prisoners/Subtitles/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.subtitleseeker.com/1392214/Prisoners/Subtitles/&lt;/a&gt;\n\n654 Subtitles In 41 Languages Use Link Provided \n &lt;a href=&quot;\nhttp://www.subtitleseeker.com/1392214/Prisoners/Subtitles/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.subtitleseeker.com/1392214/Prisoners/Subtitles/&lt;/a&gt;\n\n654 Subtitles In 41 Languages Only @ SubtitleSeeker\n &lt;a href=&quot;\nhttp://www.subtitleseeker.com/1392214/Prisoners/Subtitles/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.subtitleseeker.com/1392214/Prisoners/Subtitles/&lt;/a&gt;\n\n&amp; or @\n &lt;a href=&quot;\nhttp://subscene.com/subtitles/prisoners&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://subscene.com/subtitles/prisoners&lt;/a&gt;\n\nAll .srt subs can be turned On/Off\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1392214/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1392214/&lt;/a&gt;\n\n\n\n---------------------------------------------------------------------------------\n\n\nGeneral Metadata\n\nComplete name : Prisoners 2013.1080p.BluRay.x264 . NVEE.mp4\nFormat : MPEG-4\nFormat profile : Base Media\nCodec ID : isom\nFile size : 3.32 GiB\nDuration : 2h 33mn\nOverall bit rate : 3 102 Kbps\nEncoded date : UTC 2014-01-01 01:55:12\nTagged date : UTC 2014-01-01 01:55:12\n\n\nVideo\n\nID : 1\nFormat : AVC\nFormat/Info : Advanced Video Codec\nFormat profile : &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7139181619313d455f41&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nFormat settings, CABAC : Yes\nFormat settings, ReFrames : 3 frames\nCodec ID : avc1\nCodec ID/Info : Advanced Video Coding\nDuration : 2h 33mn\nBit rate : 2 588 Kbps\nMaximum bit rate : 27.0 Mbps\nWidth : 1 920 pixels\nHeight : 1 080 pixels\nDisplay aspect ratio : 16:9\nFrame rate mode : Constant\nFrame rate : 23.976 fps\nColor space : YUV\nChroma subsampling : 4:2:0\nBit depth : 8 bits\nScan type : Progressive\nBits/(Pixel*Frame) : 0.052\nStream size : 2.77 GiB (83%)\nWriting library : x264 core 138 r2358 9e941d1\n\n\nAudio\n\nID : 2\nFormat : AC-3\nFormat/Info : Audio Coding 3\nMode extension : CM (complete main)\nFormat settings, Endianness : Big\nCodec ID : ac-3\nDuration : 2h 33mn\nBit rate mode : Constant\nBit rate : 512 Kbps\nChannel(s) : 6 channels\nChannel positions : Front: L C R, Side: L R, LFE\nSampling rate : 48.0 KHz\nBit depth : 16 bits\nCompression mode : Lossy\nStream size : 561 MiB (17%)\nLanguage : English\nEncoded date : UTC 2014-01-01 02:13:56\nTagged date : UTC 2014-01-01 02:22:32\n\n\nSynopsis\n\nKeller Dover (Hugh Jackman), a deeply religious man who runs a struggling carpentry business, attends a Thanksgiving dinner with his family at the house of their neighbors, the Birches. After dinner, the families' young daughters, Anna Dover and Joy Birch, go missing. After a police hunt, an RV that had been parked in the neighborhood is found outside a gas station next to a wooded area. When Detective Loki (Jake Gyllenhaal) confronts Alex Jones (Paul Dano), the RV's driver, Jones tries to speed away, but collides with a tree and is arrested.\nLoki begins questioning sex-offenders in the area. His investigation uncovers a corpse tied to a chair in the basement of a local priest. The priest claims that he killed the man when he confessed to having killed a number of children. The priest describes the man as &quot;waging a war against God&quot;. Loki takes note of a maze pendant worn around the neck of the corpse.\nDuring Detective Loki's interrogation, Alex is determined to be developmentally disabled, having the I.Q. of a ten-year-old. Despite many hours of aggressive questioning by Loki, he says nothing to indicate he had any connection to the missing girls. A forensics team that goes over his RV also find nothing to connect him with the crime. Alex is released due to lack of evidence. When Keller confronts Alex outside the police station, Alex says to Keller, &quot;They didn't cry until I left them,&quot; although no one else present hears this. Keller spies on Alex, and hears him singing one of his daughter's favorite songs, which convinces him that Alex knows where the girls are. Keller abducts and imprisons him in an abandoned apartment building left to him by his late father. With the reluctant help of Joy's father, Franklin Birch (Terrence Howard), Keller tortures Alex for days, but they obtain no further information. Overcome with guilt, Franklin tells his wife Nancy (Viola Davis) what they have done and brings her to see Alex. Franklin wants to release Alex, but Nancy demands they let Keller continue the torture, neither helping nor interfering.\nDuring a candlelight vigil for the girls organized by neighbors, Loki sees a hooded man acting suspiciously. When Loki approaches him for questioning, he runs. The suspect evades Loki, but Loki manages to create a composite sketch of the suspect that is released to the public. Later, Anna's mother Grace (Maria Bello) hears shuffling coming from Anna's bedroom and after searching the room discovers her own bedroom window has been opened. She reports the break-in, which is investigated by Loki. Loki notices that Grace is under the influence of prescription drugs and does not take the incident seriously, but he searches the house with Grace. Grace leads Loki to Keller's basement, which is filled with survival supplies. Loki notices a half-empty bag of lye, and Grace reports that Keller has told her he has been out late each night helping the police search for Anna. Loki and Grace both know it's not true.\nWhen Alex is reported missing, Loki becomes suspicious of Keller and begins tailing him. Loki discovers that Keller inherited the apartment complex when he finds the obituary for Keller's father, a corrections officer who committed suicide years before. Loki confronts Keller at the apartment complex, and Keller is able to conceal Alex's presence until Loki has to rush off in response to a phone call.\nBased on tips from a children's clothing department clerk at a local store, and finally a car number plate report, Loki identifies the hooded suspect as Bob Taylor (David Dastmalchian) and confronts him at his home and arrests him. Loki finds that the walls are covered in drawings of intricate mazes. In a back room, he discovers locked crates filled with maze books, snakes, and bloody children's clothing. The Birches and Keller positively identify bloodied items of clothing found in Taylor's home. At the station, Taylor confesses to the abduction, though he provides no information about where the girls or their bodies can be found. While being questioned by Loki, Taylor grabs a gun from one of the officers that run into the room and commits suicide.\nDespite Taylor's confession and the clothing found in his house, Keller continues to believe Alex knows where the girls are and continues torturing him. Alex finally speaks, mentioning escaping from a maze. Keller visits Alex's aunt, Holly Jones (Melissa Leo), to gauge her reaction when he mentions mazes. Holly says that Alex does not speak much, being very careful of what he says ever since an accident involving snakes when he was young.\nIt is determined that the blood found on the children's clothes is pig's blood. Only child-size mannequins are found buried in Taylor's yard, and no actual bodies. A forensic profiler determines that Taylor had been abducted as a child, and had been play-acting recreations of abductions based on descriptions in a true-crime book about a serial child abductor known as &quot;The Invisible Man&quot;, whose crimes involve a book of unsolvable mazes. Loki determines the clothing identified by Keller had been stolen after the abduction, during the break-in reported by Grace, concluding that Taylor had faked his involvement in the abduction.\nDays later, a drugged Joy Birch is found and hospitalized, but Anna is still missing. When Keller visits her in the hospital to ask for information, Joy, still disoriented from the drugs her captor gave her, says to Keller, &quot;You were there.&quot; Keller rushes off, believing he now knows where Anna is. Loki tries to stop him, but loses him. Loki goes to Keller's apartment building, where he discovers the imprisoned Alex.\nKeller has realized that Joy must have heard him at the Jones's house. He returns to Holly's, prepared to torture her, but Holly takes Keller by surprise at gunpoint. She reveals that Alex gave the girls a ride in his RV, but had no thought of harming them, and that she alone was responsible for the abduction. She and her husband, the man whose body was found in the priest's basement, had abducted many other children, including Bob Taylor, in order to make their parents lose faith. She claims to be waging &quot;a war on God&quot; for letting their son die of cancer. Alex was the first child they abducted, at age 7 (26 years ago). Holly shoots Keller in the leg and imprisons him outside in a pit hidden under an old car, where he finds a whistle that belonged to his daughter. As Keller knows that he is losing blood and about to die, he prays for God to watch over Anna.\nLoki goes to Holly's house to tell her that Alex has been found. He becomes suspicious when he hears someone moving around inside, but there is no answer at the door, and enters the house. He discovers a photograph of Holly's husband, wearing the maze pendant found on the body in the priest's basement. Realizing the danger he is in, he draws his weapon and searches the house, discovering Anna being injected with poison by Holly. Loki orders Holly, at gunpoint, to show her hands; Holly turns and fires at Loki with her revolver, grazing Loki's forehead, as he shoots and kills Holly. Loki rushes Anna to the hospital where she soon recovers and his wound is treated.\nAt the hospital, Grace thanks Loki, but also asks whether Keller, who is still missing, will go to jail if he is ever found, to which Loki responds, &quot;Probably.&quot; At the Jones residence, a police team who have been digging in the yard pack up for the night, telling Loki as they leave that the frozen state of the ground means it will take weeks to dig up the entire place. As Loki prepares to leave, he hears the faint sound of a whistle. At first he dismisses it, but then hears it more distinctly. As he turns to investigate, the screen fades to black.\n\nEnjoy !","torrent":{"xt":"urn:btih:dde888a567e440d9ddab5e4a574e2ec77a18c46d","amp;dn":"Prisoners+2013.1080p.BluRay.x264+.+NVEE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dde888a567e440d9ddab5e4a574e2ec77a18c46d","infoHashBuffer":{"type":"Buffer","data":[221,232,136,165,103,228,64,217,221,171,94,74,87,78,46,199,122,24,196,109]},"announce":[],"urlList":[]}}