{"title":"The Beatles - Day Tripper [2nd original promo].VOB","uid":11624528,"size":186163200,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:de1768d1537d53d28a690d27c216a34b827af7f4&amp;dn=The+Beatles+-+Day+Tripper+%5B2nd+original+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1417603337,"description":"The Beatles - Day Tripper [2nd original promo].VOB\n\n\nHQ very rare promo music video with both LPCM and AC3 audio from a promo DVD. &quot;Day Tripper&quot; is a song by the Beatles, released as a double A-side single with &quot;We Can Work It Out&quot;. Both songs were recorded during the sessions for the Rubber Soul album. The single topped the UK Singles Chart and the song peaked at number five on the Billboard Hot 100 chart in January 1966. \n\nUnder the pressure of needing a new single for the Christmas market, John Lennon wrote much of the music, including the famous guitar riff, and most of the lyrics, while Paul McCartney worked on the verses. \n\n&quot;Day Tripper&quot; was a typical play on words by Lennon: &quot;Day trippers are people who go on a day trip, right? Usually on a ferryboat or something. But [the song] was kind of ... you're just a weekend hippie. Get it?&quot; In the same interview, Lennon said: &quot;That's mine. Including the lick, the guitar break and the whole bit.&quot; \n\nIn his 1970 interview with Rolling Stone, however, Lennon used &quot;Day Tripper&quot; as one example of their collaboration, where one partner had the main idea but the other took up the cause and completed it. For his part, McCartney claimed it was very much a collaboration based on Lennon's original idea. \n\nIn Many Years From Now, McCartney said that &quot;Day Tripper&quot; was about drugs, and &quot;a tongue-in-cheek song about someone who was ... committed only in part to the idea.&quot; The line recorded as &quot;she's a big teaser&quot; was originally written as &quot;she's a prick teaser.&quot; \n\nThe Beatles filmed three different music videos, directed by Joe McGrath.\n\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n#video does not have any logos#\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Day_Tripper&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Day_Tripper&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/IAILlaAGA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/IAILlaAGA&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 #4:3# 29.97fps 7000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 256kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bits]\n   Duration: 00:02:47\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.7\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\n\nSgtRlee #Sgt.R.Lee#","torrent":{"xt":"urn:btih:de1768d1537d53d28a690d27c216a34b827af7f4","amp;dn":"The+Beatles+-+Day+Tripper+%5B2nd+original+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de1768d1537d53d28a690d27c216a34b827af7f4","infoHashBuffer":{"type":"Buffer","data":[222,23,104,209,83,125,83,210,138,105,13,39,194,22,163,75,130,122,247,244]},"announce":[],"urlList":[]}}