{"title":"Devourment - Molesting The Decapitated","uid":4189780,"size":51387353,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:de87af47ac2c3756587cc6861df3b2f0c8c7ff73&amp;dn=Devourment+-+Molesting+The+Decapitated&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"raiga88","files":11,"time":1210883844,"description":"Artist...............: Devourment\nAlbum................: Molesting The Decapitated\nGenre................: Death Metal\nSource...............: CD\nYear.................: 1999\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.92\nVersion..............: MPEG 1 Layer III\nQuality..............: CBR 192, (avg. bitrate: 192kbps)\nChannels.............: Stereo / 44100 hz\nTags.................: ID3 v1.1, ID3 v2.3, APE v2,00\n\n\n---------------------------------------------------------------------\nTracklisting/other files\n---------------------------------------------------------------------\n\n1. (00:02:52) Devourment - Festering Vomitous Mass\n2. (00:06:16) Devourment - Postmortal Coprophagia\n3. (00:04:18) Devourment - Choking On Bile\n4. (00:04:43) Devourment - Molesting The Decapitated\n5. (00:04:38) Devourment - Self-Disembowelment\n6. (00:05:28) Devourment - Fucked To Death\n7. (00:04:24) Devourment - Devour The Damned\n8. (00:02:58) Devourment - Shroud Of Encryption\nNFO\ninfo.txt\nmolesting the decapitated.jpg\nPlaying Time.........: 00:35:38\nTotal Size...........: 48.99 MB\n\n\n\nIn 1995, upon the demise of local Dallas based death metal band Necrocide, drummer Brad Fincher and guitarist Braxton Henry (Both of Necrocide) along with former me-at-us vocalist Wayne Knupp set out to push the boundaries of what brutal death Metal was all about.\n\nWayne decided to move back to his hometown of Chicago, Brad moved to San Antonio, TX to get his education. Months later both Wayne and Brad moved back to the Dallas area and decided it was time to form what would become the most abhorrent form of musical abomination to ever exist in the history of underground death metal. However, Braxton Henry had in the meantime already formed a band known as Dead Industry. Luckily Wayne knew a guy named Brain who he used to actually play with a few years before. What Brain was playing was a style that was uncompromising compared to a lot of other guitarists in the genre. His intensity was unmatched so after finally contacting him, Brain was introduced to the band whom musically, he clicked with instantaneously.\n\nSoon the trio put out a 2-song promo, which featured &quot;Shroud Of Encryption&quot; and &quot;Festering Vomitous Mass&quot;. Several months later with the additions of then guitarist of Sintury Kevin Clark, and underground artist Mike Majewski, Devourment on bass, the band recorded one more song, Choking On Bile, which would be added to the 2-song promo resulting in the 1997 demo released by Corpsegristle Records that gained such a tremendous fan base. The demo would be entitled Impaled. With this line-up Devourment were a complete outfit. Or so they thought.\n\nWayne Knupp decided to leave the band due to some internal problems leading up to and during the trip to New York. The band would have a hard time finding a new vocalist, somebody who could most importantly, compare with Wayne&amp;#039;s brutal vocal assault. Their choice would ultimately be guitarist/vocalist of local band Detrimental, Ruben Rosas.\n\nThe band then landed a record deal in 1999 with United Guttural Records and released the debut CD Molesting The Decapitated, engineered by the band?s original guitarist, Braxton Henry. Then the unthinkable happened. After playing possibly their sickest show ever with such bands as Macabre, Deaden, Cephalic Carnage and Fleshgrind, Ruben would be arrested as a fugitive from justice. Ironically this was also the same night that Molesting The Decapitated was released. Not knowing what to do, the band decided it was time to part ways. The album was hugely influential and is considered a cult classic and due to the overwhelming response from fans worldwide, Devourment reformed minus Brain and adding once again Braxton Henry on guitars and Wayne Knupp on Vocals.\n\nTogether they would record one new song entitled Babykiller, which was featured on the Southern Uprising compilation.\n\nRuben was eventually released from his 2 1/2 year incarceration and tried to rejuvinate the band. He eventually recruited various new musicians, played a few shows, but things never really materialized.\n\nA few years went by and Ruben, and original bassist Mike Majewski talked again about reforming the band and finally recording the band&amp;#039;s long awaited second album. Brad Ficher was approached about returning to the band, but turned down the offer due other priorities in his life. Erik Park, former drummer of Louisiana?s Suture, filled in the position of drummer and the band went into the studio of August 2005 and recorded &quot;Butcher the Weak&quot;. The album was release in November of 2005 and went on to gain critical success, as well as praise from Devourment fans all over the world. Ruben played the bass tracks on the record, but shortly after, Chris Andrews joined in on bass to complete the tightest and most intense Devourment lineup to date. Despite the success of Butcher the Weak, the band was never totally satisfied with the production of the album and felt it didn?t fully deliver the potential of the new songs. Being the perfectionist?s that they are, the band came to a decision to re-record the entire album from the ground up with their original guitarist and engineer, Braxton Henry. This time around, the band was 110% satisfied with the recording and believed it was now the true and worthy follow-up to Molesting the Decapitated. After the recording was complete, the band felt it would be necessary to get the support of a record label so they could get the distribution they needed. The band struck a 2 album deal with Minnesota based Brutal Bands Records. Butcher the Weak was re-released by Brutal Bands in the Summer of 2006 and was hailed by fans and critics and the true sophomore release by Devourment. Devourment continues to stay very active. The band recorded 2 brand new songs for a 4 band split compilation, played some well known major metal fests in the USA with great success and overwhelming praise and response for their insanely powerful live performance, and continues planning shows and tours.\n","torrent":{"xt":"urn:btih:de87af47ac2c3756587cc6861df3b2f0c8c7ff73","amp;dn":"Devourment+-+Molesting+The+Decapitated","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de87af47ac2c3756587cc6861df3b2f0c8c7ff73","infoHashBuffer":{"type":"Buffer","data":[222,135,175,71,172,44,55,86,88,124,198,134,29,243,178,240,200,199,255,115]},"announce":[],"urlList":[]}}