{"title":"To Kill Rasputin (2006 - Retail epub)","uid":9376083,"size":812978,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e17ad17ddc018b006e320c71ffd133660d3c24d5&amp;dn=To+Kill+Rasputin+%282006+-+Retail+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":5,"time":1387625245,"description":"Books : Biography : English\n\nThe murder of Rasputin on the night of 16-17 December 1916 has always seemed extraordinary: first he was poisoned, then shot and finally drowned in a frozen river by Russian aristocrats fearful of his influence on Tsar Nicholas II and Tsarina Alexandra. Or was he? Dramatic new evidence from previously unpublished documents, diaries, forensic reports and intelligence records now means the plot takes a remarkable twist. Grigori Rasputin is probably one of the best-known but least understood figures in the events that ultimately led to the downfall of the Russian tsars. His political role as the power behind the throne is obscured today, as it was then, by the fascination with his morality and private life. Andrew Cook's re-investigation of Rasputin's death reveals for the first time the real masterminds behind the murder of the 'mad monk'. Why does the story of a peasant from a distant Siberian village becoming the all-powerful favourite of the last Russian tsar excite us more than almost any other episode in Russian history? Why are there more lies and concealment than truth in the story of his murder? Was this extraordinary man an evil demon who brought down the royal family, or somebody who could have been its saviour? 'To Kill Rasputin' finally provides the answers to the many mysteries surrounding this pivotal moment in Russian history.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e17ad17ddc018b006e320c71ffd133660d3c24d5","amp;dn":"To+Kill+Rasputin+%282006+-+Retail+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e17ad17ddc018b006e320c71ffd133660d3c24d5","infoHashBuffer":{"type":"Buffer","data":[225,122,209,125,220,1,139,0,110,50,12,113,255,209,51,102,13,60,36,213]},"announce":[],"urlList":[]}}