{"title":"TrustPort Total Protection 2013 Build 13.0.1.5061 Final Multilan","uid":7415126,"size":255104332,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e1d7e85e8d85493a6e3bfd6d7e5fabfb1a833521&amp;dn=TrustPort+Total+Protection+2013+Build+13.0.1.5061+Final+Multilan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nikita200","files":-1,"time":1341449522,"description":"Maximum protection for your computer against malware, online threats and misuse of confidential data. The program protects the computer from viruses and spyware at all entry points. All electronic mail and websites are examined in order to detect dangerous or unwanted content. It enables the reliable protection of sensitive data by encryption or the permanent shredding of confidential files no longer in use.\n\nAntivirus and antispyware\nThe program uses traditional scanning and heuristic analysis in order to disable any malware which might enter the computer from the internet or add on media. Two top quality motors ensure the detection of harmful code almost to the magic figure of 100%.\n\nPersonal firewall\nThe firewall serves to distinguish between legitimate and illegitimate connections between the computer and the Internet. The program automatically allows Internet communication for commonly used applications. In the case of unknown or suspicious programs the user is always asked whether connection should be permitted or disabled.\n\nAccess management - NEW!\nThe software brings your data protection to a new level. It enables limiting access to selected system devices, e.g. flash drives or external hard drives. It is possible to assign different user privileges to these targets. Especially corporate customers may appreciate this feature as a huge benefit.\n\nData encryption and shredding\nTwo methods of file encryption are available. For the secure backing up of data it is advantageous to store it in an encrypted archive, for everyday security it can be kept on an encrypted disk. In addition the program enables the permanent shredding of sensitive data which is no longer in use.\n\nSystem recovery disk\nIn case of a serious virus damage the program enables creation of a system recovery disk with an antivirus module. After loading the operating system from the recovery disk it is possible to eliminate malware, which could not have been removed by other means.\n\nHomepage: www.trustport.com","torrent":{"xt":"urn:btih:e1d7e85e8d85493a6e3bfd6d7e5fabfb1a833521","amp;dn":"TrustPort+Total+Protection+2013+Build+13.0.1.5061+Final+Multilan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1d7e85e8d85493a6e3bfd6d7e5fabfb1a833521","infoHashBuffer":{"type":"Buffer","data":[225,215,232,94,141,133,73,58,110,59,253,109,126,95,171,251,26,131,53,33]},"announce":[],"urlList":[]}}