{"title":"Alternative Energy Sources - Efstathios E. (Stathis) Michaelides","uid":15182932,"size":5009689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4424c5201ea9239ae6bdee89e5a02a7f1a4fed8&amp;dn=Alternative+Energy+Sources+-+Efstathios+E.+%28Stathis%29+Michaelides&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467471418,"description":"Alternative Energy Sources - Efstathios E. (Stathis) Michaelides (Springer, 2012).pdf\r\n\r\nISBN 978-3-642-20950-5\r\n\r\nAlternative Energy Sources is designed to give the reader, a clear view of the role each form of alternative energy may play in supplying the energy needs of the human society in the near future (20-50 years).\r\n\r\nThe two first chapters on &quot;energy demand and supply&quot; and &quot;environmental effects,&quot; set the tone as to why alternative energy is essential for the future. The third chapter gives the laws of energy conversion processes, as well as the limitations of converting one energy form to another. The section on exergy gives a quantitative background on the capability/potential of each energy source to produce power. The fourth, fifth and sixth chapters are expositions of fission and fusion nuclear energy, the power plants that may produce power from these sources and the issues that will frame the public debate on nuclear energy. The following five chapters include descriptions of the most common renewable energy sources (wind, solar, geothermal, biomass, hydroelectric) some of the less common sources (e.g. tidal and wave energy). The emphasis of these chapters will be on the global potential of each source, the engineering/technical systems that are used in harnessing the potential of each source, the technological developments that will contribute to wider utilization of the sources and environmental effects associated with their wider use. The last three chapters are: &quot;energy storage,&quot; which will become an important issue if renewable energy sources are used widely.\r\n\r\nThe fourteen chapters in the book have been chosen so that one may fit a semester University course around this book. At the end of every chapter, there are 10-20 problems and 1-3 suggestions of semester projects that may be assigned to students for further research","torrent":{"xt":"urn:btih:e4424c5201ea9239ae6bdee89e5a02a7f1a4fed8","amp;dn":"Alternative+Energy+Sources+-+Efstathios+E.+%28Stathis%29+Michaelides","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4424c5201ea9239ae6bdee89e5a02a7f1a4fed8","infoHashBuffer":{"type":"Buffer","data":[228,66,76,82,1,234,146,57,174,107,222,232,158,90,2,167,241,164,254,216]},"announce":[],"urlList":[]}}