{"title":"Putumayo Presents-Puerto Rico by Ulysses56","uid":3514704,"size":72816627,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e454bfdfc76de4aed0ae79e97419f5666299fccb&amp;dn=Putumayo+Presents-Puerto+Rico+by+Ulysses56&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulysses56","files":14,"time":1156119379,"description":"Putumayo Presents:\nPuerto Rico 2000\nExhilarating bomba, plena, salsa and son from The Island of Enchantment. \nRip 192kbs\nCovers included.\n\nPutumayo World Music is pleased to present Puerto Rico, a collection of entertaining songs from an island where music is an essential element of daily life. Puerto Rico follows the well-received Putumayo collections Cuba and Republica Dominicana and completes a trilogy of the music of the Spanish Caribbean. \nIn recent years, Puerto Rican musicians such as Ricky Martin, Marc Anthony and Jennifer Lopez have been at the forefront of the Latin pop music boom. These artists would be the first to acknowledge that the traditional music of their homeland is at the core of their radio-friendly crossover hits. All grew up listening to Puerto Rican traditional styles like bomba, plena and musica jibara (country music), not to mention the urban grooves of salsa. Ricky Martin, for example, often ends his shows with a guest appearance from a plena ensemble, and the rhythms and melodies of the Isla del Encanto (Island of Enchantment) are fast becoming part of the mainstream. \nCuba and Puerto Rico are often described as &quot;two wings of the same bird,&quot; and this is certainly evident in their music. The songs and rhythms of both islands are irresistible, danceable and soulful and have influenced many forms of contemporary popular music and jazz. While the Cuban son has recently taken flight on a gust of international popularity, Puerto Rican traditional music is an equally important element of the Latin music boom. \n\n\nEddie Palmieri - Cafe \nAndres Jimenez - Me Voy Pa&amp;#039;l Campo \nJimmy Bosch - Pa&amp;#039; Mantener Tradicion \nRamito - Una Mujer En Mi Vida \nModesto Capeda - Homenaje A Caridad \nEdwin Colon Zayas - Seis Nilonguero \nPepe Castillo - Nadie Llore \nJulius Melendez - Caramelo \nAtabal - Musica Morena \nIsmael Miranda - La Naturaleza \nPlena Libre - Bembe de Plena \n\n\nThis is one of the many PutumayoÂ´s records I have in mind to upload, so please help keep seeding after you downloaded.\nEnjoy It!\nUlysses56\n\n\nFor more info: http://www.putumayo.com/","torrent":{"xt":"urn:btih:e454bfdfc76de4aed0ae79e97419f5666299fccb","amp;dn":"Putumayo+Presents-Puerto+Rico+by+Ulysses56","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e454bfdfc76de4aed0ae79e97419f5666299fccb","infoHashBuffer":{"type":"Buffer","data":[228,84,191,223,199,109,228,174,208,174,121,233,116,25,245,102,98,153,252,203]},"announce":[],"urlList":[]}}