{"title":"One: The Movie (XVID) + Extras","uid":4118355,"size":2023488596,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e57c4b0e2c338a39bd3768fd482b2e386306dc26&amp;dn=One%3A+The+Movie+%28XVID%29+%2B+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"foraneagle2","files":10,"time":1207423928,"description":" &lt;a href=&quot;http://www.onetheproject.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.onetheproject.com&lt;/a&gt;\n\n\\&quot;This is a truely fantastic documentary, a small GEM, with a interesting story behind it as well;\nThe makers of this film a couple from Detroit, wanted to do a movie, a documentary, about \\&quot;oneness\\&quot;, in the sense as the nondual traditions from Buddhism, Christianity, Judaism, Hinduism and Islam, in a way that is interesting in the eyes of modern man. It is expressed in an existential way, that is a thousand times more interesting and moving than a movie like \\&quot;what the bleep do we know\\&quot; (Which i by the way think sucks). But basicly, ONE: The Movie weaves the diverse questions, exploring topics of war and peace, fear and love, suffering, the question of existance of god, life after death, and the ultimate meaning of life. The answers reflect global diversity, while emphasizing the oneness of humanity.\n\nThe couple behind the movie built a filmstudio in their basement and worked with this for three years, travelled to India and other interesting countries to find the interesting people that creates the mosaik that combines it all into the wholeness of the movie. The movie is shot with Canon XL-1 cameras which makes it pleasent to watch, even if it at times gets a little bit \\&quot;grainy\\&quot;, when the lightsetting isnt efficient. The movie has a few small flaws because of its sometimes too \\&quot;american\\&quot; flavour, but it do not reach the level of being painful, because it is a movie done with care, so its not a sloppy result, it has a good narative flow, and the fantastic dialogues are structured in an very interesting and fruitful way that fits well with the overall concept. Also its interesting to see how worldviews sometimes differ and sometimes not. Watch the trailers here, which do not capture the mood of the movie but at least gives a glimpse. \n\nAlso, this DVD contains extras, 9 Bonusclips that at times glitters even stronger than the movie itself. Very recommended.\n\nSome of the people interviewed in this movie:\n  \nScott Carter, Mantak Chia, Deepak Chopra, Father Richard Rohr, Ram Dass    , Riane Eisler, Thich Nhat Hahn, Barbara Marx Hubbard, Robert Thurman,, Llewellyn Vaughan-Lee, Hasan Quasdini, Father Thomas Keating, And many, many, others...\\&quot;","torrent":{"xt":"urn:btih:e57c4b0e2c338a39bd3768fd482b2e386306dc26","amp;dn":"One%3A+The+Movie+%28XVID%29+%2B+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e57c4b0e2c338a39bd3768fd482b2e386306dc26","infoHashBuffer":{"type":"Buffer","data":[229,124,75,14,44,51,138,57,189,55,104,253,72,43,46,56,99,6,220,38]},"announce":[],"urlList":[]}}