{"title":"Orjan Nilsen-In My Opinion-Extended Versions-2011","uid":6890073,"size":263923370,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e5feb46e2f2be0fefe660863427dc2dc32fde5c9&amp;dn=Orjan+Nilsen-In+My+Opinion-Extended+Versions-2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flitigalisa","files":16,"time":1323979100,"description":"To infinity and back. The endless options of EDM have ever been the object of ÃƒËœrjan Nilsen's affection. Thrilled by diversity, he has spend months of time in the studio, trying to find the perfect blend of house, trance, progressive and everything else that tingles his open mind. The result, an amalgam of years of creativity, is ÃƒËœrjan's promising debut album, 'In My Opinion'.\n\n\n\nIndulged with music from an early age, he mastered the drums and keyboard at only 9 years old. At the age of 16, as he experienced his first crush on trance music and completely fell in love with rhythmic patterns and melodies, he got his first synthesizer. The Norwegian music lover, reigning from the cold, upper part of the country, soon learned about the magic of working on a pc and started experimenting with that extraordinary grey box. After some unofficial remixes and solo tracks, it was the release of 'Red Woods' in 2005 that turned out to be ÃƒËœrjan's breakthrough. Ever since, no dancefloor is safe to the sounds of the characteristic Norwegian. Summer-hit 'La Guitarra', hammered by the trance elite for months in a row, the rough 'Moving Mojave' and sensitive 'Lovers Lane', keeping up with the ever-throbbing heart of the club society, contagious 'So Long Radio', 'Mjuzik' and the strong and outstanding 'Go Fast!'. All original and different, yet distinctively riding the Nilsen sound.\n \n \n\nAfter months of hard work in the studio, ÃƒËœrjan Nilsen proudly presents 'In My Opinion'. Days of experimenting, blending and shaping now come together in an album that is, sounds and represents ÃƒËœrjan. ÃƒËœrjan:&quot;I can't describe it other than being me. The sound you're hearing is me, and how I feel and think. It seems like I have so many things that need to get to the surface, and I'm showing that through my music.&quot;\n\n\n\n \n \n","torrent":{"xt":"urn:btih:e5feb46e2f2be0fefe660863427dc2dc32fde5c9","amp;dn":"Orjan+Nilsen-In+My+Opinion-Extended+Versions-2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5feb46e2f2be0fefe660863427dc2dc32fde5c9","infoHashBuffer":{"type":"Buffer","data":[229,254,180,110,47,43,224,254,254,102,8,99,66,125,194,220,50,253,229,201]},"announce":[],"urlList":[]}}