{"title":"BRAVEHEART (Corazon Valiente) DVD (eng-spa)","uid":6696534,"size":7757801472,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e6f2a3c8caa1a9e0ae5a1941fd612c603715fdb3&amp;dn=BRAVEHEART+%28Corazon+Valiente%29+DVD+%28eng-spa%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VJMARCC","files":19,"time":1316802489,"description":"Braveheart es una pelÃƒÂ­cula ganadora de cinco Premios de la Academia, incluyendo el Oscar a la Mejor pelÃƒÂ­cula, estrenada en 1995. Es una pelÃƒÂ­cula ÃƒÂ©pica basada en la vida de William Wallace, un hÃƒÂ©roe nacional escocÃƒÂ©s. Mel Gibson dirigiÃƒÂ³, produjo y protagonizÃƒÂ³ la pelÃƒÂ­cula\n\nArgumentoWilliam Wallace, nombre del protagonista en &quot;Braveheart&quot; (Mel Gibson) es un rebelde escocÃƒÂ©s, que lidera una revuelta popular contra el cruel rey Eduardo I de Inglaterra apodado &quot;Longshanks&quot; (El Zanquilargo) (Patrick McGoohan), que quiere conseguir para ÃƒÂ©l la corona de Escocia y quedarse el paÃƒÂ­s, aprovechando que el ÃƒÂºltimo rey no tuvo herederos.\n\nDe niÃƒÂ±o (hacia 1280) Wallace perdiÃƒÂ³ a su padre y a su hermano a manos de los ingleses, y muchos otros han sido asesinados desde entonces. El joven William pasÃƒÂ³ entonces a la tutela de su tÃƒÂ­o Argyle (Brian Cox), y lo lleva al extranjero para que tenga una buena formaciÃƒÂ³n. AÃƒÂ±os despuÃƒÂ©s vuelve a Escocia con la intenciÃƒÂ³n de vivir en paz. Pero no puede ser. Longshanks endurece su opresiÃƒÂ³n al restablecer el Ius primae noctis (el derecho de pernada).\n\nCuando su amada Murron McGlannough (Catherine McCormack), con la que se habÃƒÂ­a casado en secreto, es asesinada por el Sheriff de Lanark (porque ella y Wallace se enfrentaron a los ingleses que la intentaron violar), su determinaciÃƒÂ³n de luchar a muerte para liberar a Escocia del yugo inglÃƒÂ©s ya no tiene marcha atrÃƒÂ¡s. Su valor, carisma e inteligencia hace que sus filas se llenen de voluntarios, como los miembros de su clan, su amigo de la infancia Hamish Campbell (Brendan Gleeson), y el carismÃƒÂ¡tico irlandÃƒÂ©s Stephen el Loco (David O'Hara) llevando a los escoceses a infligir a los ingleses una humillante derrota en Stirling.\n\nTras la victoria, Wallace es nombrado &quot;GuardiÃƒÂ¡n de Escocia&quot; por los nobles, pero es consciente del oportunismo y la desuniÃƒÂ³n de ÃƒÂ©stos, a los que Longshanks ha comprado con prebendas. El dubitativo Robert Bruce (Angus MacFadyen), heredero al trono de Escocia, se debate entre los consejos de su padre leproso (interpretado por Ian Bannen) de pactar con Inglaterra y su deseo de seguir los pasos de Wallace.\n\nConsciente de que el enemigo volverÃƒÂ­a, invade el norte de Inglaterra y conquista York. Pero William encuentra una inesperada aliada en la esposa del afeminado prÃƒÂ­ncipe de Gales, la princesa Isabel (Sophie Marceau) a quien el tirano habÃƒÂ­a enviado a negociar para ganar tiempo, pero ella se pone de su parte y ambos tienen un intenso romance.\n\nLongshanks envÃƒÂ­a a todas sus fuerzas para enfrentarse a Wallace, entre otras, tropas irlandesas y tropas procedentes de Francia. Gracias a la dama de compaÃƒÂ±ÃƒÂ­a de la princesa Isabel, Wallace se entera del movimiento de tropas de Longshanks y se reÃƒÂºne con los nobles, los cuales desean pactar con el rey inglÃƒÂ©s, Wallace consigue la palabra de Robert Bruce de que los nobles lucharÃƒÂ¡n.\n\nFinalmente, se inicia la Batalla de Falkirk, Longshanks envÃƒÂ­a a los irlandeses contra Wallace y sus tropas, pero los irlandeses, se unen a los escoceses. Las tropas de Wallace, ahora con los irlandeses de su lado cargan contra la infanterÃƒÂ­a inglesa, se produce una intensa batalla pero al mirar a su retaguardia, Wallace se percata de que los nobles huyen con sus tropas, entonces Longshanks ordena disparar a sus arqueros aunque sabe que tambiÃƒÂ©n daran a sus propias tropas, la lluvia diezma tanto a escoceses como a ingleses y el tirÃƒÂ¡nico rey inglÃƒÂ©s, ordena a sus refuerzos atacar, y se retira, dando por ganada la contienda, el propio Wallace es herido en el pecho por una flecha. Pero Wallace, coge su caballo y se lanza en persecuciÃƒÂ³n de los ingleses, un caballero se bate con ÃƒÂ©l y logra derribarlo. Cuando se acerca a Wallace tendido en el suelo, aparentemente inconsciente, este logra desenmascararlo, cuando se da cuenta de que es el propio Robert Bruce.\n\nWallace y los suyos reorganizan la resistencia. Los nobles que le traicionaron en Falkirk mueren por su mano. Wallace ya se ha convertido en un mito y es mÃƒÂ¡s peligroso que nunca para los ingleses. Sin embargo, ÃƒÂ©l sabe que sin el apoyo de la nobleza, no hay nada que hacer. Por eso se arriesga a reunirse con ellos en Edimburgo, a peticiÃƒÂ³n de Bruce (quien realmente desea ponerse de su lado). Pero los demÃƒÂ¡s nobles tienen otros planes y Wallace es capturado por los ingleses, para desesperaciÃƒÂ³n del joven Bruce, quien culpa del engaÃƒÂ±o a su padre moribundo.\n\nWallace es llevado a Londres, condenado por traiciÃƒÂ³n, brutalmente torturado y decapitado despuÃƒÂ©s de gritar Ã‚Â¡Ã‚Â¡LIBERTAD!!. Pero su sacrificio no ha sido en vano. Eduardo I de Inglaterra fallece y le sucede el dÃƒÂ©bil y afeminado Eduardo II. AÃƒÂ±os mÃƒÂ¡s tarde Robert Bruce es rey de Escocia, pero debe rendir vasallaje al monarca inglÃƒÂ©s.\n\nEn vez de eso, Bruce decide luchar y arenga a sus soldados diciendo &quot;habÃƒÂ©is sangrado con Wallace, sangrad ahora conmigo&quot;. Vence en la Batalla de Bannockburn (1314) a un ejÃƒÂ©rcito inglÃƒÂ©s superior en nÃƒÂºmero. Escocia ya es libre.\n","torrent":{"xt":"urn:btih:e6f2a3c8caa1a9e0ae5a1941fd612c603715fdb3","amp;dn":"BRAVEHEART+%28Corazon+Valiente%29+DVD+%28eng-spa%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6f2a3c8caa1a9e0ae5a1941fd612c603715fdb3","infoHashBuffer":{"type":"Buffer","data":[230,242,163,200,202,161,169,224,174,90,25,65,253,97,44,96,55,21,253,179]},"announce":[],"urlList":[]}}