{"title":"Tonio K. - Life in the Foodchain [1978][EAC,LOG,CUE,FLAC]","uid":9273425,"size":286627136,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e7597aa241747c081eedc032e634876aacc97888&amp;dn=Tonio+K.+-+Life+in+the+Foodchain+%5B1978%5D%5BEAC%2CLOG%2CCUE%2CFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":11,"time":1385819886,"description":"Artist: Tonio K.\nRelease: Life in the Foodchain\nReleased: 1978\nLabel: 1995 - GADFLY\nCatalog#: 208\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Americana,rock,punk\n\nimage\n\n\n\n1. Life in the Food Chain \n2. The Funky Western Civilization \n3. Willie and the Pigman \n4. Ballad of the Night the Clocks All Quit (And the Government Failed) \n5. American Love Affair \n6. How Come I Can't See You in My Mirror? \n7. Better Late Than Never \n8. A Lover's Plea \n9. H-A-T-R-E-D \n\n\n\nOne of the best things about the late-'70s punk rock explosion is that it changed the rules for pop musicians across the board, and while Tonio K. wasn't a for-real punk rocker (or even really new wave), there's no way he could have made an album as willfully strange and bitterly witty as Life in the Foodchain without Elvis Costello or Johnny Rotten first raising the stakes in the rock outrage department. And it's a good thing; Tonio K. (aka Steve Krikorian) was actually a staunch Leftist moralist wearing the cloak of a raving lunatic, and on Life in the Foodchain, his rampantly cynical trades about the abuse of wealth, the collapse of values, and the emotional abuse that passed for love near the end of the 20th century cut like a chainsaw while also managing to be pretty damn funny. &quot;The Ballad of the Night the Clocks All Quit (And the Government Failed)&quot; is nearly as ambitious as its title (and even funnier), while &quot;Life in the Foodchain&quot; and &quot;The Funky Western Civilization&quot; say a lot more about the failings of our culture than most &quot;serious&quot; songwriters were offering in 1979, and side two's meditations on romance (especially &quot;American Love Affair&quot; and &quot;How Come I Can't See You in My Mirror?&quot;) make Warren Zevon sound like James Taylor. And while one might wish that Tonio K. had had a band as tough and brittle as the Attractions backing him, he and producer Rob Fraboni got an admirably hard-rocking, stripped-down sound from their band of studio professionals (including Earl Slick, Albert Lee, and Garth Hudson) -- and Tonio K. was way ahead of the hipster curve in giving Dick Dale a guest shot on a couple cuts. And who wouldn't love an album released by the same people responsible for Dan Fogelberg's career that featured the line &quot;I wish I was as mellow/As for instance Jackson Browne/But 'Fountain of Sorrow' my ass, motherf--ker/I hope you wind up in the ground!&quot;? A masterpiece.","torrent":{"xt":"urn:btih:e7597aa241747c081eedc032e634876aacc97888","amp;dn":"Tonio+K.+-+Life+in+the+Foodchain+%5B1978%5D%5BEAC%2CLOG%2CCUE%2CFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7597aa241747c081eedc032e634876aacc97888","infoHashBuffer":{"type":"Buffer","data":[231,89,122,162,65,116,124,8,30,237,192,50,230,52,135,106,172,201,120,136]},"announce":[],"urlList":[]}}