{"title":"Anathma - A Sort Of Homecoming (Live) 2015 320ak","uid":12662359,"size":246631853,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e7b94a2985c8485112a2e918c295fd60f6cae896&amp;dn=Anathma+-+A+Sort+Of+Homecoming+%28Live%29+2015+320ak&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":16,"time":1446316461,"description":"Anathema are an English progressive rock band from Liverpool. The line-up consists of singers and guitarists Vincent and Daniel Cavanagh, their brother Jamie Cavanagh at bass, siblings John and Lee Douglas, respectively drummer and singer, and keyboardist Daniel Cardoso since November 2012.\r\n\r\nThe band was founded as Pagan Angel in 1990 by the three Cavanagh brothers, John, and singer Darren White, as a death/doom band. At the time White was the only singer of the band. The following year, Jamie left and was replaced by Duncan Patterson. Under this line-up, Anathema released their first EP, The Crestfallen (1992), and their first album, Serenades (1993). However, White left in 1995; Vincent decided to act as Anathema's vocalist in addition to his guitarist function in the albums The Silent Enigma (1995) and Eternity (1996), which were going into a more gothic metal direction.\r\n\r\nIn 1997, John left the band, and was replaced by Shaun Steels for the album Alternative 4 (1998). Both Patterson and Steels left the same year, replaced by Dave Pybus and a returning John Douglas, while former My Dying Bride keyboardist and violinist Martin Powell also joined the band (Daniel Cavanagh was also acting as the band's only keyboardist, and shared this position since). The only album released with this line-up was Judgement (1999): the same year Powell switched positions with Cradle of Filth's keyboardist Les Smith who joined Anathema, and Lee Douglas, John's sister, was added to the line-up as a backing and occasional lead vocalist.\r\n\r\nThe band released their sixth album A Fine Day to Exit in 2001, turning to an alternative sound. Shortly after the release, Pybus announced his departure and was replaced by the band's original bassist, Jamie Cavanagh, reuniting the three brothers in the band for the first time since 1991. There were no new members in the band during ten years, with the albums A Natural Disaster (2003) and We're Here Because We're Here (2010) being released under the same line-up, turning their sound even more into progressive rock; however, Daniel left Anathema from 2002 to 2003 to join Antimatter. Smith left Anathema in 2011, and Vincent and Daniel both assumed the function of keyboardist for the band's ninth album, Weather Systems, in 2012. The same year, Cardoso, the band's live keyboardist since 2011, joined as a full-time member.\r\n\r\nOn March 28th 2014, the band announced their tenth studio album called Distant Satellites to be released on June 9th of the same year via Kscope. It is their third studio album among five released since the comeback from the hiatus in 2008 with compilation album Hindsight.\r\n\r\n\r\nGenre:\tProgressive\r\n\r\nSubgenre:\tProg/Alt Rock\r\n\r\nBitrate:\t320 k\r\n\r\nSize:\t235.21 MB\r\n\r\nFiles  16\r\n\r\n\r\n\r\nAnathema - A Sort Of Homecoming (Live) (2015)\r\n\r\n1.The Lost Song Part 2\r\n2.Untouchable Part 1\r\n3.Untouchable Part 2\r\n4.Thin Air\r\n5.Dreaming Light\r\n6.Anathema\r\n7.Ariel\r\n8.Electricity\r\n9.Temporary Peace\r\n10.The Beginning and the End\r\n11.Distant Satellites\r\n12.Take Shelter\r\n13.Internal Landscapes\r\n14.A Natural Disaster\r\n15.Fragile Dreams","torrent":{"xt":"urn:btih:e7b94a2985c8485112a2e918c295fd60f6cae896","amp;dn":"Anathma+-+A+Sort+Of+Homecoming+%28Live%29+2015+320ak","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7b94a2985c8485112a2e918c295fd60f6cae896","infoHashBuffer":{"type":"Buffer","data":[231,185,74,41,133,200,72,81,18,162,233,24,194,149,253,96,246,202,232,150]},"announce":[],"urlList":[]}}