{"title":"Democracy Now - 01 nov 2011","uid":6788179,"size":455456993,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e7d36bfe07c06bcfda70d6bba17b184217009a56&amp;dn=+Democracy+Now+-+01+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1320175283,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 01, 2011\n\n-  European Stocks Plummet as Greek Prime Minister Announces Popular Referendum on Bailout\n-  Brokerage Giant MF Global Holdings Files Bankruptcy Following Risky Bets\n-  Police Raid Occupy Encampments in California, Virginia\n-  UNESCO Votes Overwhelmingly to Accept Palestinian Authority as Member\n-  Attorney of U.S. Soldier: My Client Severed Fingers of Afghan Civilians as War Trophies\n-  Kenya Accused of Killing Five, Wounding Dozens of Children in Somalia Camp Bombing\n-  Republican Presidential Hopeful Herman Cain Acknowledges Sexual Harassment Allegations\n-  Rick Perry's Flat Tax Plan Would Lead to Major Cut for Millionaires, Hike for Poor\n-  NATO Ends Libya Bombing Campaign After Striking Nearly 6,000 Targets\n-  California Firm Acknowledges Syrian Government Using Its Technology to Suppress Dissent\n-  Committee to Protect Journalists Alarmed over Ongoing Disappearance of Syrian Reporters, Bloggers\n-  Report: Increased Frequency of Weather Disasters Result of Global Warming\n-  Prominent Climate Change Skeptic Admits Global Warming is Real\n\n\nSpecial reports\n\n- U.S. Pulls All Funding for UNESCO After Sweeping Vote to Support Palestinian Membership\n\nIn an emotional-and largely symbolic-move, the United Nations cultural organization known as UNESCO overwhelmingly voted to grant membership to the Palestinians, despite opposition from the United States and Israel. Now the United States says it will cancel a $60 million payment due in November to the U.N. body. Membership dues paid by the U.S. account for about a fifth of UNESCO's annual budget. The U.S. is also threatening to veto any Palestinian effort to be recognized by the U.N. Security Council as an independent state. &quot;By going to UNESCO, this was a way both of gauging where the public opinion is among the various governments and, more importantly, symbolically for the world, showing that this is a moment of recognition that the 20-year-old U.S.-controlled so-called 'peace process' simply hasn't worked,&quot; said Phyllis Bennis of the Institute for Policy Studies.\n\n\n- As NATO Ends Libyan Bombing Campaign, Is the U.S. Seeking Greater Military Control of Africa?\n\nNATO ended its bombing campaign in Libya on Monday. Over the past seven months, NATO aircraft conducted more than 26,500 sorties, including 9,700 strike missions. NATO said it bombed 5,900 military targets inside the country. While NATO Secretary General Anders Fogh Rasmussen hailed the campaign as a success, many analysts say NATO's intensive bombing campaign violated its U.N. mandate. &quot;The role that NATO played in Libya has been a very, very problematic one, a very troubled one, and ultimately is going to have a very long-term, deleterious impact on Libya's future,&quot; says Phyllis Bennis of the Institute for Policy Studies. &quot;The notion that the NATO bombings somehow was to do nothing but protect civilians is simply not the case.&quot; Bennis said the Libyan revolution began as part of the Arab Spring, but the NATO intervention turned it into a &quot;Western assault on another North African, Middle Eastern, Arab country.&quot; She also expresses alarm over the rising U.S. military presence in Africa. &quot;Despite efforts to claim that AFRICOM [U.S. Africa Command] is really about healthcare and AIDS education and women's rights, to be carried out by the U.S. military, we have a very serious reality that Africa now provides more oil to the United States than the entire Middle East.&quot;\n\n\n- Jonathan Steele on Afghanistan: &quot;The War is Unwinnable. It is a Stalemate. There is No Military Victory&quot;\n\nThe U.S.-led war in Afghanistan, now entering its 11th year, shows no sign of ending. On Saturday, 12 U.S. soldiers died in a suicide bombing in Kabul. It was deadliest single ground attack against NATO forces in the decade of war. To discuss Afghanistan, we speak with Jonathan Steele, a longtime correspondent for The Guardian newspaper and author of the new book, &quot;Ghosts of Afghanistan: The Haunted Battleground.&quot; &quot;The [U.S. military strategy] doesn't work, because you create new resistance by being there. The resistance comes because you're there; you're not there because of the resistance. The occupying force itself creates the resistance,&quot; Steele said. &quot;And so, the crucial thing now is to recognize that the war is unwinnable. It's a stalemate. There is no military victory.&quot;\n\n\n- Move Your Money: Campaign Grows to Divest from &quot;Too Big to Fail&quot; Banks to Local Banks, Credit Unions\n\nAs participants in the Occupy Wall Street movement continue protesting the record profits made by banks bailed out by taxpayer money, a group of grassroots activists are hitting America's largest banks-including JPMorgan Chase, Bank of America and Wells Fargo-where it hurts most: the wallet. Dubbing this Saturday, Nov. 5 as &quot;Bank Transfer Day,&quot; activists are urging people to move their money out of the banks deemed &quot;too big to fail&quot; into local community banks and credit unions. Bank Transfer Day draws on an idea popularized by filmmaker Eugene Jarecki, economist Rob Johnson and columnist Arianna Huffington, among others. In 2010, they created the short film called &quot;Move Your Money,&quot; which became a viral sensation. We speak with filmmaker Eugene Jarecki.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e7d36bfe07c06bcfda70d6bba17b184217009a56","amp;dn":"+Democracy+Now+-+01+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7d36bfe07c06bcfda70d6bba17b184217009a56","infoHashBuffer":{"type":"Buffer","data":[231,211,107,254,7,192,107,207,218,112,214,187,161,123,24,66,23,0,154,86]},"announce":[],"urlList":[]}}