{"title":"Motorhead - Ace Of Spades (Live-Germany) (2nafish)","uid":6036304,"size":101556228,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e8824550b93d7714741a03e2016a908964062890&amp;dn=Motorhead+-+Ace+Of+Spades+%28Live-Germany%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1292239882,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Ace of Spades&quot; is a song by the English band MotÃƒÂ¶rhead, released in 1980 as a single and the title track to the album Ace of Spades. The song spent 12 weeks in the United Kingdom Singles Chart, peaking at #15.\n\nInitially issued as a 7&quot; vinyl single on 27 October 1980 as a preview to the album Ace of Spades and autumn tour, Bronze Records also released a 12&quot; vinyl pressing in special Christmas picture sleeves, limited to 50,000 copies. The picture of the band in Santa outfits used on the cover was taken at the Aylesbury Fair, while the band were on tour.\n\nBronze also issued German and Spanish 7&quot; vinyl versions which had a different sleeves, as well as a Japanese release, with a colour picture insert with song lyrics in English and Japanese. One sided test pressings (not mis-presses, but used in the trade) escaped the pressing plant and are on the market.\n\nFor the lyrics, Lemmy said he &quot;used gambling metaphors, mostly cards and dice - when it comes to that sort of thing, I'm more into the one-arm bandits actually, but you can't really sing about spinning fruit, and the wheels coming down&quot;.\n\nOn 6 September 1980 Lemmy was interviewed by Graham Neil on BBC Radio 1's Rock On Saturday show, &quot;Bomber&quot;, &quot;Ace of Spades&quot; and &quot;Love Me Like a Reptile&quot; were played. The following month, on 6 October and 20 October, the band played the song on BBC TV show Top of the Pops.\n\nThe song is considered to be the definitive MotÃƒÂ¶rhead anthem, and &quot;put a choke on the English music charts and proved to all that a band could succeed without sacrificing its blunt power and speed&quot;.\n\nIn March 2005, Q magazine placed it at #27 in its list of the 100 Greatest Guitar Tracks, stating &quot;This song has an intro which wouldn't be out of place ushering in the end of the world&quot;. In 2009 it was named both the 10th greatest hard rock and metal song of all time by VH1.\n\nThis song is considered to be their signature song.\n\nAce of Spades is the fourth album by the British band MotÃƒÂ¶rhead. Released on 8 November 1980, it peaked at #4 on the UK album charts and reached Gold status by March 1981. It was preceded by the release of the title track as a single on 27 October, which peaked in the UK singles chart at #15 in early November.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e8824550b93d7714741a03e2016a908964062890","amp;dn":"Motorhead+-+Ace+Of+Spades+%28Live-Germany%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8824550b93d7714741a03e2016a908964062890","infoHashBuffer":{"type":"Buffer","data":[232,130,69,80,185,61,119,20,116,26,3,226,1,106,144,137,100,6,40,144]},"announce":[],"urlList":[]}}