{"title":"Frank Zappa - 1979 - Sheik Yerbouti (only non-crappy CD version)","uid":5728089,"size":518739027,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e8aaf0f838e28f2e94f21031b4ce79ccc0b7aaba&amp;dn=Frank+Zappa+-+1979+-+Sheik+Yerbouti+%28only+non-crappy+CD+version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lonesomecowboy","files":-1,"time":1280538834,"description":"F R A N K   Z A P P A\n- Sheik Yerbouti (EMI CD Version) -\n\nThe only CD version that isn't fucked up by such incomprehensible remastering flaws you will have on the releases from Ryko or Zappa Records.\n\nSome statements from 'Frank Zappa Album Versions Guide':\n\n&quot;...i just found out how horrible  the Ryko Sheik Yerbouti really is, and I can't believe it. I think that Frank didn't know what he was doing AT ALL when it came down to re-mastering. He really was too much of a control freak ... he should have hired someone who KNEW WHAT THEY WERE DOING to take the original album masters and do it for him. FZ really made some POOR decisions when it came to his digital catalog ... worse decisions than anyone else that I can think of in the history of music. FZ gets my &quot;bad remastering&quot; award. Adding insult to injury is the fact that he DELETED  CDs that were superb quality, and deemed them &quot;rip-offs&quot; only to replace them with these garbage masters. What a tard!...&quot;\n\n&quot;...in particular, the right channel of the album sounds particularly chewed up, a common problem amongst the &quot;bad batch&quot; of discs. Something's wrong with the treble in the right channel. Check the right channel at the beginning of Dancin' Fool, for example. On the vinyl/EMI CD, the treble information is generally identical between the channels. On the &quot;bad&quot; CDs, it sounds as if the treble is being muffled by a blanket. This may not be obvious if you've never heard the vinyl before...&quot;\n\n&quot;...The beginning of &quot;City of Tiny Lites&quot; exhibits some major compression issues. The bass drum at the beginning of the track causes the cross faded synth drum from the end of &quot;Tryin' to Grow a Chin&quot; to actually pump in time with the bass drum. This does not happen on the LP or EMI CD...&quot;\n\nThese are only a few comments selected from &lt;a href=&quot;\nhttp://www.lukpac.org/~handmade/patio/vinylvscds/sheik_yerbouti.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lukpac.org/~handmade/patio/vinylvscds/sheik_yerbouti.html&lt;/a&gt;\n\nIf you own a cd copy of Sheik Yerbouti (from Ryko or Zappa Records) or feel encouraged to upgrade your old vinyl collection, give it a try!","torrent":{"xt":"urn:btih:e8aaf0f838e28f2e94f21031b4ce79ccc0b7aaba","amp;dn":"Frank+Zappa+-+1979+-+Sheik+Yerbouti+%28only+non-crappy+CD+version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8aaf0f838e28f2e94f21031b4ce79ccc0b7aaba","infoHashBuffer":{"type":"Buffer","data":[232,170,240,248,56,226,143,46,148,242,16,49,180,206,121,204,192,183,170,186]},"announce":[],"urlList":[]}}