{"title":"Bad Girls of Film Noir-Vol 2 - Bad For Each Other (1953) - The G","uid":11426134,"size":7732697088,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e93a8e0b44766fcc5a8eb30d9ba1ff0a6aad4eb2&amp;dn=Bad+Girls+of+Film+Noir-Vol+2+-+Bad+For+Each+Other+%281953%29+-+The+G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"SaM","files":-1,"time":1415667534,"description":"Bad Girls of Film Noir-Vol 2 - Bad For Each Other (1953) - The Glass Wall (1953) DVD9 [DDR]\n\n----------------------------------------------------------------\n\nBad For Each Other (1953 ) Xvid 1cd - Charlton Heston, Liz Scott [DDR]\n\nBad for Each Other is a 1953 film directed by Irving Rapper, and starring Charlton Heston and Lizabeth Scott.\n\n    CAST:-\n    Charlton Heston as Dr. Tom Owen\n    Lizabeth Scott as Helen Curtis\n    Dianne Foster as Joan Lasher\n    Mildred Dunnock as Mrs. Mary Owen, Tom's mother\n    Arthur Franz as Dr. Jim Crowley\n    Ray Collins as Dan Reasonover\n    Marjorie Rambeau as Mrs. Roger Nelson\n    Lester Matthews as Dr. Homer Gleeson\n    Rhys Williams as Dr. Leslie M. Scobee\n\nDirected by Irving Rapper\nRunning time 83 minutes\n\nMOVIE PLOT:- Bad For Each Other (1953)\nArmy colonel and doctor Tom Owen returns home to Coalville, Pennsylvania, on leave. He learns from wealthy mine owner Dan Reasonover that his brother Floyd, a mine safety engineer killed in an explosion, had betrayed Reasonover's trust; he had been embezzling and stealing even more money by purchasing cheap, substandard equipment. Floyd was also heavily in debt. Tom wants to pay it all back, though Dan Reasonover tries to talk him out of it.\n\nTwice divorced socialite Helen Curtis, Dan's daughter, meets Tom at a party and likes what she sees. Helen asks him for a date, during which she informs him she has arranged for him to meet Dr. Homer Gleeson. Gleeson runs a fancy Pittsburgh clinic catering to the upper class. Gleeson's associate has quit to start his own practice, so he offers Tom the vacancy. Knowing that Tom has vowed to pay his late brother's debts, she talks him into accepting, despite Tom's contentment in the Army and his mother's disapproval. Tom's first task is hiring a nurse; he selects Joan Lasher, an attractive and idealistic young woman who intends to become a doctor herself.\n\nTom and Helen begin dating. Eventually, Tom proposes to her, and she accepts. Her own father warns him that her wealth had poisoned her first two marriages, but Tom remains adamant.\n\nLasher becomes disappointed that Tom treats wealthy society patients for minor ailments when he could be doing more good elsewhere. Dr. Jim Crowley, a former sergeant who was inspired by Tom's example to resume his medical studies, comes to Tom to ask for a job, not for the money (though he is poor) but for the experience of working and learning from such a superb surgeon. Tom sends him to see Dr. Lester Scobee, who cares for the miners of Coalville.\n\nEmergency surgery is needed for Mrs. Roger Nelson, Helen's rich and influential aunt. Her personal physician, Gleeson, pleads with Tom to perform the operation for him, as he himself has not done any surgery in ten years. When Tom does so, unethically, Lasher quits. Gleeson decides to charge Mrs. Nelson an exorbitant fee, which he splits with Tom. Helen's aunt eventually finds out who actually operated on her. Though she is grateful, she questions his ethics. Before Tom can defend himself, he is called away by an emergency: a mine explosion at Coalville.\n\nTom enters the mine and joins Jim treating and rescuing miners. They get out before the chamber they were in collapses, but Jim is fatally injured and dies in the ambulance. Tom tells Helen he is quitting the clinic to work in Coalville. Helen tells him she cannot live there, so they reluctantly part. Tom arrives at his new office, to find Joan already at work.\n\nOTHER NOTES:-\nThe plot of the 1938 film, The Citadel, was reshuffled and simplified for Bad for Each Other. In The Citadel, Robert Donat plays a doctor who forgoes treating miners in Wales in order to become a highly paid society doctor in London. The mine-rescue sequence in Bad for Each Other is near-identical to the equivalent sequence in The Citadel.\n\n========================================================================\n\nThe Glass Wall (1953) - Vittorio Gassman, Gloria Grahame [DDR]\n\nThe Glass Wall is a 1953 American black-and-white drama film noir directed by Maxwell Shane and starring Vittorio Gassman and Gloria Grahame. \nThe film was produced and distributed by Columbia Pictures.\nIt and two other films tied for the Golden Leopard, the top prize at the Locarno International Film Festival, in 1953.\n\n    CAST:-\n    Vittorio Gassman as Peter Kuban\n    Gloria Grahame as Maggie Summers\n    Ann Robinson as Nancy\n    Douglas Spencer as Inspector Bailey\n    Robin Raymond as Tanya / Bella Zakoyla\n    Jerry Paris as Tom\n    Elizabeth Slifer as Mrs. Hinckley\n    Richard Reeves as Eddie Hinckley\n    Joe Turkel as Freddie Zakoyla (as Joseph Turkel)\n    Else Neft as Mrs. Zakoyla\n    Michael Fox as Inspector Toomey / Narrator\n    Kathleen Freeman as Zelda\n    Musician Jack Teagarden as himself\n    Musician Shorty Rogers as himself\n\nDirected by Maxwell Shane\nProduced by Ivan Tors\nScreenplay by Maxwell Shane, Ivan Tors\nMusic by Leith Stevens\nRunning time 82 minutes\n\nMOVIE PLOT:- The Glass all (1953)\nAfter the end of World War II, Peter Kuban (Vittorio Gassman), a Hungarian displaced person and survivor of the Nazi concentration camps, stows away on a ship bound for New York City. However, he is spotted and held for the authorities. When they arrive, he claims that he qualifies for entry under an exception for those who helped Allied soldiers during the war, but all he knows about the paratrooper he hid from the enemy is that his name is Tom and he is a musician from New York City. The authorities decide that this is not enough and that he must be sent back to Europe.\n\nHe jumps off the ship, breaking some ribs, and starts searching for Tom. He encounters an unemployed ex-factory worker named Maggie Summers (Gloria Grahame). When she steals a coat in a restaurant, Peter helps her keep away from the police. They go to her apartment, where she tends his injury as best she can and learns his story. When Mrs. Hinckley, her landlady, threatens to evict her for being behind on her rent, Peter gives her all the money he has. Later, however, Eddie Hinckley, the landlady's son, barges in and tries to become amorous with Maggie. Peter bursts out of hiding and starts fighting him, but gets the worst of it. Maggie knocks Eddie out with a chair, and the pair flee into the night. The police are notified. Meanwhile, Tom sees Peter's picture on the front page of a newspaper. He wants to go to the immigration department, but his girlfriend Nancy persuades him to go to an important audition she has arranged instead. Though he impresses band leader Jack Teagarden, Tom leaves abruptly to try to help Peter.\n\nThe fugitives are recognized in the subway. The police grab Maggie, but Peter gets away. She meets up with Tom. After hearing Tom's story, Inspector Bailey believes that Peter can stay, but only if they can reach him before 7 am. At that time, the ship will depart and, by law, Peter must be jailed and deported. The trio drive around searching. Peter slips into an unoccupied taxi and falls asleep. When burlesque dancer Tanya gets into the taxi after work, she recognizes Peter from the newspaper photo. However, she takes him home to her apartment for rest and a meal. When he asks why, she explains that her real name is Bella Zakoyla, and that she is a fellow &quot;Hunky&quot;. Her immigrant mother approves, but her brother Freddie does not want to risk getting into trouble, saying that it is the responsibility of the United Nations. The loud argument rouses Peter, sleeping in the other room, and he slips away.\n\nActing on Freddie's remark, Peter heads toward the United Nations building. He is seen. The police, Maggie, Tom and Bailey drive there. Peter panics and flees to the roof, where he contemplates jumping. However, Maggie and Tom get to him in time to reassure him that he is now safe.\n\nBACKGROUND NOTES:-\nThe film was shot on location in New York City and at the United Nations building (the &quot;glass wall&quot; of the title) on First Avenue at 46th Street in Manhattan.\nFilm critic Dennis Schwartz liked the film and wrote a positive review, &quot;Columbia's off-beat postwar noir project, whose title is taken from the U.N.'s glass wall, turned out rather well despite a number of awkward moments as it promotes its leftist agenda. Maxwell Shane (Fear in the Night/Nightmare/City Across the River) passionately directs this gritty immigration picture in a darker light than the usual idealistic films about Ellis Island and the Statue of Liberty, and strangely enough its concern for immigrants is still relevant in today's modern world. It's co-written by Shane, Ivan Shane and Ivan Tors with poignancy and feeling. It works best as film noir, that is better than its sob story/chase story thriller aspects because it's so moving, haunting and compelling in its characterization of a desperate Holocaust survivor on-the-run ... The atmospheric pic is well-served by cinematographer Joseph F. Biroc's great location shots of a seedy neon-lit Times Square at night and of an impressive though empty U. N. in the early morning. It also has much clout as a urban thriller, even if it gets heavy-handed at times and cannot be deemed a great film--just a film that sticks with you because it's so earnest and satisfying.&quot;\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4935 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 165 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:e93a8e0b44766fcc5a8eb30d9ba1ff0a6aad4eb2","amp;dn":"Bad+Girls+of+Film+Noir-Vol+2+-+Bad+For+Each+Other+%281953%29+-+The+G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e93a8e0b44766fcc5a8eb30d9ba1ff0a6aad4eb2","infoHashBuffer":{"type":"Buffer","data":[233,58,142,11,68,118,111,204,90,142,179,13,155,161,255,10,106,173,78,178]},"announce":[],"urlList":[]}}