{"title":"Discovering Psychology - The Science of Mind (gnv64)","uid":9306456,"size":143581928,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9eea5f0012c551e2731639a0d23e6c3af6a6b37&amp;dn=Discovering+Psychology+-+The+Science+of+Mind+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1386321260,"description":"Discovering Psychology: The Science of Mind \nby John Cacioppo and Laura Freberg\nCengage Learning | March 2012 | ISBN-10: 061818550X | True PDF | 944 pages | 135 mb\n\nIn this fresh new offering to the Intro Psychology course, authors John Cacioppo and Laura Freberg portray psychology as being an integrative science in two ways. First, they have written a text that reflects psychology's rightful place as a hub science that draws from and is cited by research in many other fields. Second, this text presents psychology as a unified science that seeks a complete understanding of the human mind, rather than as a loosely organized set of autonomous subspecialties. As psychology moves rapidly toward maturity as an integrative, multidisciplinary field, the introductory course offers an opportunity to teach all of psychology in one place and at one time. This text reflects that evolution--and the authors' excitement about it.\n\nAbout the Authors\nJohn Cacioppo is the Tiffany and Margaret Blake Distinguished Service Professor and director of the Center for Cognitive and Social Neuroscience at the University of Chicago. He is the chair of the Psychology Section of the American Association for the Advancement of Science and the president of the Society for Social Neuroscience, and he is a past president of four other scientific societies including the Association for Psychological Science. He is the recipient of numerous awards. He has served as editor and associate editor of various journal boards, and he currently serves on the Council of the Center for Scientific Review at the National Institutes of Health.\nLaura Freberg is Professor of Psychology at California Polytechnic State University, San Luis Obispo, where she teaches courses in Introductory Psychology, Biological Psychology, and Sensation and Perception. To better understand the needs of the online education community, Laura began teaching Social Psychology for Argosy University Online in 2011. Freberg's teaching career began over 35 years ago when she taught her first college course at Pasadena City College at the age of 23. She has received Faculty Member of the Year recognition from the Cal Poly Disabilities Resource Center three times (1991, 1994, and 2009) in recognition of her work with students with disabilities. She enjoys using technology and social media in the classroom, and is a syndicated expert blogger for Live Right Live Well! She serves as the Bylaws and Archives Committee Chair for the Society for Social Neuroscience.\n\nBRIEF CONTENTS\n1 The Science of Mind The Discipline of Psychology 2\n2 The Measure of Mind Methods of Psychology 42\n3 The Evolving Mind Nature and Nurture Intertwined 86\n4 The Biological Mind The Physical Basis of Behavior 124\n5 The Perceiving Mind Sensation and Perception 178\n6 The Aware Mind Elements of Consciousness 234\n7 The Feeling Mind Motivation and Emotion 286\n8 The Adaptive Mind Learning 346\n9 The Knowing Mind Memory 396\n10 The Thinking Mind Thinking, Language, and Intelligence 452\n11 The Developing Mind Life-Span Development 506\n12 The Individual Mind Personality and the Self 568\n13 The Connected Mind Social Psychology 618\n14 The Troubled Mind Psychological Disorders 678\n15 Healing the Troubled Mind Therapy 734\n16 The Healthy Mind Stress and Coping, Health Psychology, and Positive\nPsychology 786\nReferences R-1\nName Index N-1\nSubject Index/Glossary S-1","torrent":{"xt":"urn:btih:e9eea5f0012c551e2731639a0d23e6c3af6a6b37","amp;dn":"Discovering+Psychology+-+The+Science+of+Mind+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9eea5f0012c551e2731639a0d23e6c3af6a6b37","infoHashBuffer":{"type":"Buffer","data":[233,238,165,240,1,44,85,30,39,49,99,154,13,35,230,195,175,106,107,55]},"announce":[],"urlList":[]}}