{"title":"Fluorinated Ionomers - Walther Grot","uid":15533653,"size":11706960,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea731247b65512ed585c155470f66ad924a7aa40&amp;dn=Fluorinated+Ionomers+-+Walther+Grot&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1470857626,"description":"Fluorinated Ionomers - Walther Grot (WA, 2008).pdf\r\n\r\nThe author of this unique handbook on fluorinated ionomers is also the inventor of the first commercial product known as Nafion® (DuPont). The book covers partially fluorinated and perfluorinated polymers containing sufficient ionic groups to dominate the transport properties of the polymer. The emphasis of this book is on the practical aspects of working with fluorinated ionomers. It is intended to help the scientist and engineer in the preparation, fabrication, use, and study of these products as well as in the development of new applications and compositions.\r\n\r\nExtensive coverage has been given to perfluorinated ionomers because of the practical importance of this group of polymers. Commercial products such as Nafion®, Aciplex® (Asahi Chemical) and Flemion® (Asahi Glass) are fluorinated ionomers have been discussed in detail. Whether you need information about use of fluorinated ionomers in fuel cells, batteries, chlor-alkali cells, sensors, fabrication techniques, or commercial products you will find it in this valuable handbook.\r\n\r\n• Applicable information and data on processing fluorinated ionomers.\r\n• Author is the inventor of the first commercial fluorinated ionomer (Nafion – DuPont).\r\n• Information provides stepping stone for development of new applications and compositions.• Whether you need information about use of fluorinated ionomers in fuel cells, batteries, chlor-alkali cells, sensors, fabrication techniques, or commercial products you will find it in this valuable handbook","torrent":{"xt":"urn:btih:ea731247b65512ed585c155470f66ad924a7aa40","amp;dn":"Fluorinated+Ionomers+-+Walther+Grot","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea731247b65512ed585c155470f66ad924a7aa40","infoHashBuffer":{"type":"Buffer","data":[234,115,18,71,182,85,18,237,88,92,21,84,112,246,106,217,36,167,170,64]},"announce":[],"urlList":[]}}