{"title":"Dixon Brothers - Complete Works 1936-38 (4CD-Document)","uid":7269455,"size":296701507,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eb06e64ec607c91ef85e08b57d68e8b94ab89cde&amp;dn=Dixon+Brothers+-+Complete+Works+1936-38+%284CD-Document%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mudmashers","files":92,"time":1337005007,"description":"Dixon Brothers - Complete Recorded Works 1936-1938 (4CD, Document)\n\nDixon Brothers, Vol. 1: 1936 CD (128kb)\nThere's nothing that quite compares to the elemental and evocative sound of the Dixon Brothers. Their country blues might bring Dock Boggs to mind, but where Boggs failed at a banjo, here you have the tropical twang of Howard Dixon's acoustic slide guitar lines. The Dixons also precede the great Louvin Brothers, with close harmonies and a mix of sacred, heartfelt Gospel and secular tunes like &quot;Sales Tax on the Women.&quot; But the lack of polish on the Dixons makes them all the more compelling. So forget the comparisons and just revel in this wonderful music: honest, tuneful, and simply delightful. The transfers are excellent on this reissue, with clear reproduction that leaves enough of a scratch to give a sense of the history to these sessions. Awesome. Tim Sheridan\n\nDixon Brothers, Vol. 2: 1937 CD (192kb)\nThis second in the series of their complete chronological works finds the Dixon Brothers still doling out ragged but right performances of folk spirituals. Howard Dixon's slide guitar work is particularly fine throughout, especially on tunes like &quot;I Will Meet My Precious Mother&quot; and &quot;Darling Do You Miss Me.&quot; The reproduction is not flawless, with some harsh high levels, but it's still a fine collection. Tim Sheridan\n\nDixon Brothers, Vol. 3: 1937 - 1938. CD (160kb)\nDixon Brothers, Vol. 3: 1937-1938 is another addition to the series featuring the popular country duo. The brothers do not disappoint, delivering another strong set of country and spiritual favorites from the time period. What is notable about this entry in the series is how they have moved from an equal mix of spirituals and traditional country to mostly performing the latter. Because of this shift, this album ends up covering one of the most important times of their career. The only real problem with this collection is the sound quality, which tends to be rather shrill and obnoxious at times. This is a shame because their wonderful harmonies are weakened greatly by the poor reproduction. But with some home stereo tampering, this could be a great album for fans of the team as well as for those looking for some classic traditional country. Bradley Torreano\n\nDixon Brothers, Vol. 4: 1936 CD (160kb)","torrent":{"xt":"urn:btih:eb06e64ec607c91ef85e08b57d68e8b94ab89cde","amp;dn":"Dixon+Brothers+-+Complete+Works+1936-38+%284CD-Document%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb06e64ec607c91ef85e08b57d68e8b94ab89cde","infoHashBuffer":{"type":"Buffer","data":[235,6,230,78,198,7,201,30,248,94,8,181,125,104,232,185,74,184,156,222]},"announce":[],"urlList":[]}}