{"title":"Java Programming - 24-Hour Trainer - Yakov Fain","uid":12002644,"size":6523762,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebcf9c72815aa725b12d21a117627da7913e13ee&amp;dn=Java+Programming+-+24-Hour+Trainer+-+Yakov+Fain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433811976,"description":"Java Programming 24-Hour Trainer, 2nd Edition is your complete beginner's guide to the Java programming language, with easy-to-follow lessons and supplemental exercises that help you get up and running quickly. Step-by-step instruction walks you through the basics of object-oriented programming, syntax, interfaces, and more, before building upon your skills to develop games, web apps, networks, and automations. This second edition has been updated to align with Java SE 8 and Java EE 7, and includes new information on GUI basics, lambda expressions, streaming API, WebSockets, and Gradle. Even if you have no programming experience at all, the more than six hours of Java programming screencasts will demonstrate major concepts and procedures in a way that facilitates learning and promotes a better understanding of the development process.\n\nThis is your quick and painless guide to mastering Java, whether you're starting from scratch or just looking to expand your skill set.\n\nMaster the building blocks that go into any Java project\nMake writing code easier with the Eclipse tools\nLearn to connect Java applications to databases\nDesign and build graphical user interfaces and web applications\nLearn to develop GUIs with JavaFX\nIf you want to start programming quickly, Java Programming 24-Hour Trainer, 2nd Edition is your ideal solution","torrent":{"xt":"urn:btih:ebcf9c72815aa725b12d21a117627da7913e13ee","amp;dn":"Java+Programming+-+24-Hour+Trainer+-+Yakov+Fain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebcf9c72815aa725b12d21a117627da7913e13ee","infoHashBuffer":{"type":"Buffer","data":[235,207,156,114,129,90,167,37,177,45,33,161,23,98,125,167,145,62,19,238]},"announce":[],"urlList":[]}}