{"title":"Disney Movie -The Adventures of Bullwhip Griffin (1967)","uid":4512341,"size":1086248173,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ebd5aab11c6f51b73a25ad3fab67bf074aecc536&amp;dn=Disney+Movie+-The+Adventures+of+Bullwhip+Griffin+%281967%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"cowboy23","files":2,"time":1226835582,"description":"The Adventures of Bullwhip Griffin isn&amp;#039;t quite as obscure as some, but it certainly isn&amp;#039;t one that immediately comes to mind when one hears the name &quot;Disney.&quot;\nThis upbeat Gold Rush era Western, adapted from Sid Fleischman&amp;#039;s tongue-in-cheek novel By the Great Horn Spoon!, is one of about five productions that while Walt supervised was not released until after his December 1966 death. Bullwhip was actually the second film issued by the Disney studio in the wake of its namesake&amp;#039;s passing, arriving in theaters just two and a half months later.\n\nAt the start of the film, Bullwhip Griffin (Roddy McDowall) is neither adventurous nor known as &quot;Bullwhip.&quot; He&amp;#039;s simply Griffin (Eric Griffin, to be precise), the butler of a wealthy family in mid-19th century Boston. Only the Flagg family isn&amp;#039;t as wealthy as previously thought. The hundreds of thousands left in the will of the recently-deceased paterfamilias are really just a big post-mortem joke from Grandpa. Not only are there not thousands of dollars to be had, but the Flaggs are flat broke.\n\nButler Eric Griffin (Roddy McDowall) is unmoved by the bulky sum he&amp;#039;s just learned his former master has left him in his will. Jack Flagg and Griffin find themselves on a ship destined for San Francisco.\n\nUpon hearing this news, Jack Flagg (Bryan Russell) decides he&amp;#039;ll be heroic and return prosperity and good fortune to his family, which appears to be just older sister Arabella (Suzanne Pleshette) and a staff whose services are no longer needed. Losing his head as teenage boys sometimes do, Jack runs off and quickly finds himself upon a boat destined for San Francisco and its alluring promise of gold. In the process of retrieving his adolescent master, Griffin winds up on the same boat and before he can instill some sense, the ship takes off with the two ticket-less accidental passengers aboard. The adventures have begun!\n\nWhen they&amp;#039;re not delighting the captain with culinary concoctions (a position taken on to cover their fare), Griffin and Jack meet a couple of interesting characters. One is a fledgling actor named Quentin Bartlett who tells them with no shortage of drama about his prized possession: a map to golden treasure. Another is the conniving Judge Higgins (Oscar winner Karl Malden), who is as shrewd as he is unjust.\n\nAll four of those personalities wind up in San Francisco, with Judge Higgins in possession of the treasure map and a head start. Though Griffin, Jack, and Bartlett are in search of their nemesis and their much-needed riches, plenty of unconventional twists complicate the plot and offer not unwelcome diversions. In one such encounter, Griffin sets up shop as a barber in the middle of the town&amp;#039;s path and finds a large audience willing to pay. In another, a gargantuan local known as Mountain Ox (Mike Mazurki) demands a haircut and winds up unconscious and still unshaven.\n\nKarl Malden plays Judge Higgins, an unscrupulous baddie with a scarred forehead. Hermione Baddeley (who also played house help in &quot;Mary Poppins&quot; a few years earlier) portrays Miss Irene Chesney. Here, she discusses what&amp;#039;s next with Arabella (Suzanne Pleshette) as the Flagg household gets emptied.\n\nWhile it employs many of the formulas on display in the studio&amp;#039;s other live action films from the era, Bullwhip doesn&amp;#039;t feel commonplace or overly familiar. Perhaps that&amp;#039;s due to the period setting and genre, which do their part to lessen the film&amp;#039;s appeal for the narrow-minded and those who just don&amp;#039;t like Westerns. By and large, though, Bullwhip works for those willing to give it a chance. It&amp;#039;s not overwhelmingly funny or especially thrilling, but it&amp;#039;s got a nice bouncy spirit and plenty of surprises up its sleeve.\n\nThere&amp;#039;s a minimal amount of silliness, which distinguishes it from other Disney comedies of the time. Perhaps this contributed to its low box office returns and widely-forgotten status. But it works to the film&amp;#039;s advantage in some ways. That&amp;#039;s not to say that the film doesn&amp;#039;t have a sense of humor. Physical comedy figures largely in the final fisticuffs sequence in which Griffin (now with the legendary moniker &quot;Bullwhip&quot;) squares up for a rematch with Ox with thousands of dollars at stake. This prolonged final act is probably the flimsiest element of the film, but it&amp;#039;s also it&amp;#039;s showiest. Even if it&amp;#039;s not the most satisfying conclusion, one appreciates the thoroughly conceived choreography and semi-witty use of gags.\n\nThe cast is comprised of actors who made other films for Disney but aren&amp;#039;t the ones you associate strictly with the studio. This is another factor which makes the picture stand out from other productions. Even if the film at times feels flat-footed, that&amp;#039;s the last word you&amp;#039;d use to describe star Roddy McDowall. McDowall leaps, ducks, and bounces in the extended climactic fight sequence. When he&amp;#039;s less boisterous, he&amp;#039;s successfully pulling off the slick-but-stiff protagonist, against the large odds that state &quot;stiff&quot; does not make a good leading man. McDowall&amp;#039;s performance sets the tone for the film, which is the cinematic equivalent of a slight grin that indicates you&amp;#039;re having quite a good time.\n\nArabella finds a different way to make money out West. One of several transition screens animated by Ward Kimball.\n\nAs the different but both good-hearted Flagg siblings, Bryan Russell and Suzanne Pleshette do fine jobs. Russell, whose eyes are certainly bluer than the bluest Blue Tornado bar, doesn&amp;#039;t take you out of the film&amp;#039;s world the way some showier, less believable child performances do. Pleshette&amp;#039;s screen time is limited to a few early appearances and then a resurfacing as &quot;The Boston Belle&quot;, a singing and dancing showgirl met with whooping male audiences in a San Francisco tavern. Karl Malden appears to have a lot of fun with his villainous role, and he adds quite a bit of spark as the chameleon judge whose cleverness you admire but disdain through each disguise. Some of the film&amp;#039;s simpler and more potent pleasures stem from the battle of wits between Bullwhip and everyone else, especially the heinous Higgins.\n\nWard Kimball, legendary Disney animator and one of Walt&amp;#039;s &quot;Nine Old Men&quot;, is credited with &quot;Titles &amp; Things.&quot; In addition to the high-spirited opening credits sequence, he provides some clever cartoon interstitials and transitions throughout the film.\nAside from Kimball&amp;#039;s inspired asides (which while used sparingly come close to wearing out their welcome near the end), Bullwhip could use a bit of experimentation cinematically. Like most of the old live action Disney films, it relies heavily on basic two-shot setups, when some of its settings cry out for some more exciting or unorthodox photography.\n\nBullwhip Griffin is an old-fashioned hero, one whose adventures should be the stuff passed around by mouth over the years. That hasn&amp;#039;t really been the case in the decades since Disney first released this to theaters. As a film that&amp;#039;s embedded in the Western genre, this isn&amp;#039;t quite as personable or accessible as the contemporary family comedies Walt made. But even if it&amp;#039;s not a masterpiece, it&amp;#039;s quite a bit of fun. Well-crafted, fairly intelligent, and not offering simply variables plugged into a Disney formula, Bullwhip Griffin is a movie that should hopefully find a greater audience well presented on DVD and back in print for the first time in many years.","torrent":{"xt":"urn:btih:ebd5aab11c6f51b73a25ad3fab67bf074aecc536","amp;dn":"Disney+Movie+-The+Adventures+of+Bullwhip+Griffin+%281967%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebd5aab11c6f51b73a25ad3fab67bf074aecc536","infoHashBuffer":{"type":"Buffer","data":[235,213,170,177,28,111,81,183,58,37,173,63,171,103,191,7,74,236,197,54]},"announce":[],"urlList":[]}}