{"title":"The Bluetones -  the Last Chance Saloon [1998]","uid":9465425,"size":402024734,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ed00b1be37e68e5e44a25396e3ccce85b8442745&amp;dn=The+Bluetones+-++the+Last+Chance+Saloon+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389452100,"description":"Review by Jason Damas\nStylistically, Return to the Last Chance Saloon isn't a drastic change from the Bluetones' debut Expecting to Fly. The major problem with the debut, however, was that there was little musical variety, and the album seemed to drag at times. Luckily, on their sophomore effort, the Bluetones have added some much-needed tempo changes to the mix, making this album a more consistently engaging listen than their debut. They still have massive, Stone Roses-style riffs, but they also have tossed in a few acoustic numbers and an instrumental. Many of the songs here have an obsession with the American Wild West, especially &quot;Ames&quot; and the opening medley of &quot;Tone Blooze&quot; and &quot;Unpainted Arizona.&quot; Still, the band's sound is deeply rooted in British pop -- and that is what dominates the majority of this disc. The real highlight is the soaring &quot;Hey Jude&quot; soundalike, &quot;If:&quot; with a galloping bassline and ultimately memorable chorus, this is possibly the band's best song. There's more, though -- &quot;4 Day Weekend&quot; is more aggressive than anything on the debut, and the trashy blues tune &quot;Sleazy Bed Track&quot; are two more excellent cuts on this accomplished effort. While it was never released in the U.S., this is an essential purchase for fans. (3/5)","torrent":{"xt":"urn:btih:ed00b1be37e68e5e44a25396e3ccce85b8442745","amp;dn":"The+Bluetones+-++the+Last+Chance+Saloon+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed00b1be37e68e5e44a25396e3ccce85b8442745","infoHashBuffer":{"type":"Buffer","data":[237,0,177,190,55,230,142,94,68,162,83,150,227,204,206,133,184,68,39,69]},"announce":[],"urlList":[]}}