{"title":"Minority Report - 2002 (dvdrip.xvid.ac3.avi)","uid":3436120,"size":1468407311,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:edc67758191fde9357c00020488263653473949b&amp;dn=Minority+Report+-+2002+%28dvdrip.xvid.ac3.avi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"weaponofchoice","files":2,"time":1138274529,"description":"Minority Report \n\nYear: 2002\nDirected by: Steven Spielberg\nGenre: Action / Crime / Drama / Mystery / Sci-Fi / Thriller \n\nSize: 1.37 GB\nFormat: dvdrip.xvid.ac3.avi\nResolution: 720 x 304\nDuration: 2:25:04\n\nPlot Outline: In the year 2054, a so-called &quot;pre-crime division&quot; is working around Washington, DC. Its purpose is to use the precog(nitive) potential of three genetically altered humans to prevent murders. When the three precogs, who only work together, floating connected in a tank of fluid, have a vision, the names of the victim and the perpetrator as well as video imagery of the crime and the exact time it will happen, are given out to the special cops who then try to prevent the crime from happening. But there is a political dilemma: If someone is arrested before he commits a murder, can the person be accused of the murder, which - because of the arrest - never took place? The project of pre-crime, at the time being in a state of trial run, is going to be voted about in the near future. If people accept it, the crime rate is going to drop drastically, but it never will be known if there might not be too many people imprisoned, some or even all of them innocent. After John Anderton lost his son to a crime a six years ago, he took up drugs, and works the precog division like nobody else. One day, his own name arrives in the &quot;perpetrator&quot; chute, and the precogs predict that he will kill a man he never knew in less than 36 hours. John takes off, his trust in the system diminishing rapidly. His own colleagues after him, John follows a very small trace that might hold the key to his innocence, a strange unsolved yet predicted murder and a so-called &quot;minority report&quot;, a documentation of one of the rare events in which a precog sees something different than the other two.\n\nTagline: What would you do if you were accused of a murder, you had not committed... yet?\n","torrent":{"xt":"urn:btih:edc67758191fde9357c00020488263653473949b","amp;dn":"Minority+Report+-+2002+%28dvdrip.xvid.ac3.avi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edc67758191fde9357c00020488263653473949b","infoHashBuffer":{"type":"Buffer","data":[237,198,119,88,25,31,222,147,87,192,0,32,72,130,99,101,52,115,148,155]},"announce":[],"urlList":[]}}