{"title":"Lindsey Davis - The Silver Pigs (BBC)","uid":6528083,"size":106674495,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:edd602081fbc02b6fe48d3e93b5184c6fe61c94f&amp;dn=Lindsey+Davis+-+The+Silver+Pigs+%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fakeplastictrousers2","files":-1,"time":1310221246,"description":"From BBC Radio 4 Extra. Written by Lindsey Davis; Full-cast dramatisation starring Anton Lesser as Falco, with Fritha Goodey as Helena Justina; Dramatised by Mary Cutler.\n\nOne fine day in AD 70, scruffy, working-class informer Marcus Didius Falco literally runs into a beautiful sixteen-year-old girl on the steps of the Forum. Sosia Camillina is on the run from a couple of street toughs, and after rescuing her, Falco wants to find out why. It soon becomes clear that Sosia knows a dangerous secret about a stockpile of silver ingots - or 'pigs' - and there are those who will stop at nothing to prevent her telling what she knows. Hoping for future favours from Sosia's rich, influential uncle, Falco embarks on an intricate case of smuggling, murder and treason that reaches as far as the Emperor's palace, and beyond the seven hills of Rome. Soon, Falco finds himself in an inhospitable outpost of the Empire called Britain, where the weather is filthy, the natives restless and the women angry. There, he meets Helena Justina, a spirited aristocrat who becomes an important part of his life. But, if he does not tread carefully, the treacherous puzzle of the silver pigs could be the death of him...","torrent":{"xt":"urn:btih:edd602081fbc02b6fe48d3e93b5184c6fe61c94f","amp;dn":"Lindsey+Davis+-+The+Silver+Pigs+%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edd602081fbc02b6fe48d3e93b5184c6fe61c94f","infoHashBuffer":{"type":"Buffer","data":[237,214,2,8,31,188,2,182,254,72,211,233,59,81,132,198,254,97,201,79]},"announce":[],"urlList":[]}}