{"title":"The Origins of the Arab-Jewish Conflict Over Palestine","uid":6771542,"size":589376783,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ee75a75f10a180d6bc4cfcbb2d1fc7349d445868&amp;dn=The+Origins+of+the+Arab-Jewish+Conflict+Over+Palestine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":82,"time":1319593722,"description":"From Time Immemorial: The Origins of the Arab-Jewish Conflict Over Palestine by Joan Peters (Unabridged)\n\n\n\nThis monumental and fascinating book, the product of seven years of original research, will forever change the terms of the debate about the conflicting claims of the Arabs and the Jews in the Middle East.\nThe weight of the comprehensive evidence found and brilliantly analyzed by historian and journalist Joan Peters answers many crucial questions, among them: Why are the Arab refugees from Israel seen in a different light from all the other, far more numerous peoples who were displaced after World War II? Why, indeed, are they seen differently from the Jewish refugees who were forced, in 1948 and after, to leave the Arab countries to find a haven in Israel? Who, in fact, are the Arabs who were living within the borders of present-day Israel, and where did they come from?\n\nJoan Peters's highly readable and moving development of the answers to these and related questions will appear startling, even to those on both sides of the argument who have considered themselves to be in command of the facts. On the basis of a definitive weight of hitherto unexamined population and other historical data, much of it buried in untouched archives, Peters demonstrates that Jews did not displace Arabs in Palestine-just the reverse: Arabs displaced Jews; that a hidden but major Arab migration and immigration took place into areas settled by Jews in pre-Israel Palestine; that a substantial number of the Arab refugees called Palestinians in reality had foreign roots; that for every Arab refugee who left Israel in 1948, there was a Jewish refugee who fled or was expelled from his Arab birthplace at the same time-today's much discussed Sephardic majority in Israel is in fact composed mainly of these Arab-born Jewish refugees or their offspring; that Britain, the Mandatory power, winked at and even encouraged Arab immigration into Palestine between the two World Wars; that by disguising the Arab immigrants as &quot;indigenous native Palestinian Arabs,&quot; the British justified their restrictions on Jewish immigration and settlement, dooming masses of European Jews to destruction in the Nazi camps.\n\nJoan Peters also unfolds a historical record to shatter the widely held belief that Arabs and Jews harmoniously coexisted for centuries in the Arab world-the fact is that the Jews, along with other non-Muslims, were second-class citizens, oppressed in the Muslim world for more than a millennium. And this continuing prejudicial tradition of hostility underlies, as well, every Arab action toward the state of Israel.\n\nIn addition to her pioneering archival researches, Joan Peters has frequently traveled in the Middle East, conducting numerous interviews and gathering the personal observations of the first-rate reporter she is. The result is a book that has already had a major impact on policy discussions of one of the most vital and intractable of the world's problems, shrouded until now in a fog of misinformation and ignorance.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ee75a75f10a180d6bc4cfcbb2d1fc7349d445868","amp;dn":"The+Origins+of+the+Arab-Jewish+Conflict+Over+Palestine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee75a75f10a180d6bc4cfcbb2d1fc7349d445868","infoHashBuffer":{"type":"Buffer","data":[238,117,167,95,16,161,128,214,188,76,252,187,45,31,199,52,157,68,88,104]},"announce":[],"urlList":[]}}