{"title":"The Ether Ship Mystery and its solution","uid":4799831,"size":904625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eea2e7245ddd8caa8a16740a941c4b8c7e0c6dae&amp;dn=The+Ether+Ship+Mystery+and+its+solution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"madziar","files":1,"time":1238005339,"description":"&quot;The Ether Ship Mystery and its Solution&quot; is a unique document. Written in 1950, it deals with UFOs, their possible origin, and what principles they may operate on.\n\nProduced by Borderlands, called Borderlands Science Research Associates at the time and Borderlands Science Research Foundation now, it mixes statements of science with occult concepts, adds transmissions gotten from mediums to the mix, creates a sort of half science/half occult area, and puts a little bit of folklore into it as well.\n\nBorderlands distinguished itself by being a pioneer in the fields of free energy, alternative science, and radionics, not being afraid to meld spiritual concepts with technological ones. \n\nMeade Layne, the assembler of the document and a big contributor to it, was taught by Charles Stanfield Jones, better known as Frater Achad, who was Aleister Crowley's &quot;Magickal Child&quot; before he broke with him over doctrinal differences. \n\n&quot;The Ether Ship Mystery and its Solution&quot; is long, long, out of print and is otherwise only available for costs that are prohibitively expensive.","torrent":{"xt":"urn:btih:eea2e7245ddd8caa8a16740a941c4b8c7e0c6dae","amp;dn":"The+Ether+Ship+Mystery+and+its+solution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eea2e7245ddd8caa8a16740a941c4b8c7e0c6dae","infoHashBuffer":{"type":"Buffer","data":[238,162,231,36,93,221,140,170,138,22,116,10,148,28,75,140,126,12,109,174]},"announce":[],"urlList":[]}}