{"title":"Gary Numan - Cars [promo].vob","uid":7233877,"size":273577984,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:eec2a6b8699d44ec32363a68b294d5081297153c&amp;dn=Gary+Numan+-+Cars+%5Bpromo%5D.vob&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1335931250,"description":"Gary Numan - Cars [promo].VOB\n\n\nHQ promo music video. &quot;Cars&quot; is a 1979 song by UK artist Gary Numan, and was released as a single from the album The Pleasure Principle. It reached the top of the charts in several countries, and today is considered a New Wave staple. In the UK charts, it reached number 1 in 1979, and in 1980 hit number 1 in Canada two weeks running on the RPM national singles chart and rose to number 9 on the U.S. Billboard Hot 100. It debuted on the American Top 40 on 29 March 1980, and spent a total of 17 weeks in the AT40. &quot;Cars&quot; was released under the 'Atco' label, with the catalog number of 7211.\n\nThe song was the first release credited solely to Gary Numan after he dropped the band name Tubeway Army, with which he had released four singles and two LPs, including the number one UK hit &quot;Are 'Friends' Electric?&quot;, and its parent album, Replicas. Musically, the new song was somewhat lighter and more pop-oriented than its predecessors, Numan later conceding that he had chart success in mind: &quot;This was the first time I had written a song with the intention of 'maybe it could be a hit single'; I was writing this before &quot;Are 'Friends' Electric?&quot; happened&quot;.\n\nThe music video featured Numan's then-current backing band, including Billy Currie from the band Ultravox, though he had not actually played on the recording of &quot;Cars&quot;. Towards the end of the video, a multitude of Gary Numans are depicted &quot;driving&quot; (in a standing position, holding an imaginary steering wheel) along a Polymoog keyboard.\n\nGary Numan (born Gary Anthony James Webb on 8 March 1958) is an English singer, composer, and musician, most widely known for his chart-topping 1979 hits &quot;Are 'Friends' Electric?&quot; (as Tubeway Army) and &quot;Cars&quot;. His signature sound consisted of heavy synthesiser hooks fed through guitar effects pedals.\n\nNuman is considered a pioneer of commercial electronic music. His use of themes from science fiction, and his combination of aggressive punk energy with electronics, have been widely imitated.\n(video has a 5 semi-transparent blue dots at the bottom right)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Cars_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Cars_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/hAOGaaAdF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/hAOGaaAdF&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8000kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:46\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated April 01, 2012!\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t\n","torrent":{"xt":"urn:btih:eec2a6b8699d44ec32363a68b294d5081297153c","amp;dn":"Gary+Numan+-+Cars+%5Bpromo%5D.vob","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eec2a6b8699d44ec32363a68b294d5081297153c","infoHashBuffer":{"type":"Buffer","data":[238,194,166,184,105,157,68,236,50,54,58,104,178,148,213,8,18,151,21,60]},"announce":[],"urlList":[]}}