{"title":"il mistero della pietra azzurra [XviD - Ita Jap - Mp3 - Sub Ita]","uid":4823128,"size":1280249856,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:f004732cbf9a7919c688f0738ffd30010505746a&amp;dn=il+mistero+della+pietra+azzurra+%5BXviD+-+Ita+Jap+-+Mp3+-+Sub+Ita%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Maimato","files":4,"time":1238845199,"description":"Nel 1889 Nadia, una ragazza orfana dalla pelle scura che lavora come acrobata in un circo di Parigi, incontra Jean, coetaneo e geniale inventore, che si innamora a prima vista di lei. I due si trovano subito nei guai a causa del ciondolo che Nadia porta appeso al collo, una pietra azzurra, della quale tre &quot;cattivi&quot; piuttosto comici (Grandis, Hanson e Sanson) vogliono impossessarsi. Nel tentativo di fuggire dai tre ladri, i due giovani dapprima naufragheranno nell'Oceano Atlantico a causa di un guasto all'aereo costruito da Jean; verranno poi ripescati da una nave da guerra, ma, nuovamente in mezzo al mare, saranno tratti in salvo da un ipertecnologico sottomarino, il Nautilus, il cui equipaggio ÃƒÂ¨ comandato dal misterioso capitano Nemo, possessore di un'altra pietra azzurra. Jean e Nadia ripartiranno dopo che l'equipaggio del sottomarino avrÃƒÂ  riparato l'aereo, ma precipiteranno in un'isola, che si rivelerÃƒÂ  essere base segreta dell'organizzazione di Neo-Atlantide, capeggiata da Gargoyle (Argo nella prima edizione italiana), che uccide senza pietÃƒÂ  chiunque tenti di fuggire. Qui Nadia e Jean incontreranno la piccola Marie. I tre ragazzi (e i tre figuri che volevano rubare la pietra, anch'essi persisi nell'isola) saranno salvati nuovamente dal Nautilus. Da quel momento in poi Nadia e Jean, assieme all'equipaggio del sottomarino, a Grandis, Hanson e Sanson (passati definitivamente dalla parte dei &quot;buoni&quot;), affronteranno molte situazioni rischiose, prima di giungere alla battaglia finale contro Gargoyle.\n","torrent":{"xt":"urn:btih:f004732cbf9a7919c688f0738ffd30010505746a","amp;dn":"il+mistero+della+pietra+azzurra+%5BXviD+-+Ita+Jap+-+Mp3+-+Sub+Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f004732cbf9a7919c688f0738ffd30010505746a","infoHashBuffer":{"type":"Buffer","data":[240,4,115,44,191,154,121,25,198,136,240,115,143,253,48,1,5,5,116,106]},"announce":[],"urlList":[]}}