{"title":"Coast to Coast AM June 15, 2013 - IRS Scandal","uid":8586583,"size":57592244,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f09d8d29afa7ffb8798e9c44e35e9249297d062e&amp;dn=Coast+to+Coast+AM+June+15%2C+2013+-+IRS+Scandal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1371546842,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-15-13\nHost:\nJohn B. Wells\nGuests:\nJoseph R.  Banister,                   Malcolm  Out Loud\nFormer IRS Special Agent Joe Banister joined John B. Wells for a discussion on the recent IRS scandal, and why he's spoken out against the fraudulent administration and enforcement of the federal income tax ever since being fired after confronting top IRS officials. Based on his experience within the organization, he opined that the targeting of the tea party by the IRS was not merely the work of rogue agents acting on their own accord. To that end, he noted that &quot;you don't do a whole lot without your supervisors knowing&quot; and that the ultimate decision on what groups to scrutinize likely came from high level management officials in Washington D.C.  \nOn why the IRS targeted these specific groups, Banister theorized that there were two factors at work behind the scrutiny. First, he surmised that the government wants to stifle the growth of pro-Constitution groups and weaken their sway in the political arena. Secondly, Banister pointed to a more long-term agenda aimed at silencing people who are revealing that the income tax system is applied &quot;beyond the authority of the statutory law.&quot; Despite the scandalous nature of the IRS revelations, he put forward the idea that the government &quot;actually likes diversionary scandals&quot; on the domestic front, since it allows for less attention being placed on foreign policy maneuvers. &quot;They know a good IRS scandal will keep everyone chasing their tails and ultimately nothing will really get done about it,&quot; he mused.  \nBanister also detailed how paying federal income tax is actually not a legal requirement for Americans. He explained that, legally, only people who have to paid &quot;a non-resident alien or a foreign corporation&quot; are liable for income tax and that this technicality is obfuscated by the complex tax code enforced by the IRS. &quot;It's not an oversight,&quot; he said, regarding this lack of liability placed on everyone else, &quot;it was avoided on purpose because of the Constitutional limitations on income taxation.&quot; However, Banister advised that, in light of the massive power afforded the IRS, people should continue to pay their income taxes until such time as the true nature of these laws has become general knowledge and the system becomes corrected.  \nNSA Spying\nIn the first hour, political commentator Malcolm Out Loud reacted to the NSA spying revelations. He contended that public opinion is vastly in favor of Edward Snowden and argued that, rather than reveal classified information, the whistleblower merely &quot;uncovered questionable activities that those in power would rather have kept secret.&quot; To those who are dismissive about the government spying on Americans and believe it can be trusted to protect the best interests of the populace, Out Loud warned that this nonchalant attitude will ultimately lead the country towards a police state. He suggested that only 20% is committed to protecting the rights of Americans and that the other 80% are focused on assuring their own re-election and other short term goals. \nWebsite(s):\n freedomabovefortune.com\n\n malcolmoutloud.tv\n","torrent":{"xt":"urn:btih:f09d8d29afa7ffb8798e9c44e35e9249297d062e","amp;dn":"Coast+to+Coast+AM+June+15%2C+2013+-+IRS+Scandal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f09d8d29afa7ffb8798e9c44e35e9249297d062e","infoHashBuffer":{"type":"Buffer","data":[240,157,141,41,175,167,255,184,121,142,156,68,227,94,146,73,41,125,6,46]},"announce":[],"urlList":[]}}