{"title":"Thai Movie - Mon Rak Transistor","uid":4252755,"size":1507932928,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0de93606692aa2a26496251eef0099961d5ffe5&amp;dn=Thai+Movie+-+Mon+Rak+Transistor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rawbear","files":2,"time":1214090198,"description":"Monrak Transistor (2001)\nThai movie\nLanguage: Thai\nSubtitles: English\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0306359/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0306359/&lt;/a&gt;\n\nMonrak Transistor, English: Transistor Love Story) is a 2001 Thai film directed by Pen-Ek Ratanaruang. \nBlending several genres, including comedy, romance, musical (Look Thoong/Luk Thung music) and crime, it is the story of a young man named Pan and his odyssey after he goes AWOL from the army and tries to make it as a luk thung singing star\n\n\nRotten Tomatoes says:\n\n\\&quot;Monrak Transistor is one of those rewarding films that reveals something new with every viewing. Embodies all the traits I\\&amp;#039;ve come to recognize for the Thai films I enjoy - mirthful humor, gut-wrenching sadness and frenetic, bone-jarring action.\n\nEncompassing all these traits, Monrak Transistor is an epic love story that gets sadder and sadder the longer it goes. Yes, there is a bit of soap opera melodrama involved, but that is just part of the style, and it\\&amp;#039;s presented in a manner than I find more palatable than the everyday television shows.\n\nThe story opens in a jail, where a prisoner is being interrogated. The action is taking place in the background, behind bars and is blurred. The focus is on a bottle of laxative. Seems the prisoner has stolen something and swallowed it. Ah, here it comes. And it\\&amp;#039;s not even real gold.\n\nThe jailer picks up the thread, narrating the strange tale of the prisoner, a boy from his village named Pan (Supakorn Kitsuwan).\n\nPan is a simple country boy who loves music. That\\&amp;#039;s how we meet him, singing his heart out at a village fair. Besides music, he\\&amp;#039;s in love with Sadaw (Siriyakorn Pukkavesh), a village girl. He sings for Sadaw. When a local rich kid shows up with his thugs and dances with Sadaw, Pan is indignant. He spills soda on the guy and then spits on his shoes to clean it up. A fight breaks out, and the music keeps going, with the guitarist switching into high gear to spur the fighters on.\n\nPan and Sadow retreat to Sadaw\\&amp;#039;s home, but aren\\&amp;#039;t left in peace for long before Sadow\\&amp;#039;s father shows up with a shotgun, causing Pan to hightail it for the canal.\n\nBut Pan is not easily deterred. He shows up the next day to dig a pond for Sadow\\&amp;#039;s father. He insists on calling the man Dad.\n\n\\&quot;Stop calling me Dad. When did I fuck your mother,\\&quot; the old man cruelly admonishes Pan.\n\nPan offers to get the old man some medicine, something involving foot pollen, which because of the cultural association of the foot being the basest part of the body, gravely offends the old man.\n\nBut despite her father\\&amp;#039;s dislike of Pan, the two are married and have a baby on the way.\n\nThe movie could end here, the narrator chimes in, and you\\&amp;#039;d be heading for exits with a happy ending. But there is more to this sad tale.\n\nPan is drafted into the army. One day he sees an ad for a singing contest and enters. He wins and without giving thought to the consequences, is on a bus headed for Bangkok, where he hopes to become a big singing star.\n\nHe instead ends up mopping floors at the talent office for 27 months. This seems pretty unrealistic, but it is part of the charm of this movie. It is a movie, after all.\n\nAfter more than two years of mopping floors and being the errand boy for the transgendered dance instructor at the office, he asks his boss (Somlek Sakdikul), a slimy promoter who insists Pan call him Daddy, when he will get his break.\n\nThe break eventually comes, just when Sadaw comes for a visit. But the joy is short lived. Tragedy strikes and Pan is on the run.\n\nSadaw is not totally forgotten. Back up in the village, a sweet-talking medicine salesman woos her. He screens a free film for the village, showing them Tears of the Black Tiger (which co-starred Supakorn), narrating the action and adapting the lines in the film to fit his sales pitch and his advances on Sadaw.\n\nThe performances by all involved, especially Supakorn and Siriyakorn, are stupendous. Supakorn especially is a physically gifted actor who displays a subtlety that is rare. Siriyakorn, who gets a role that critics have blasted for being undeveloped, does what she can with the role, turning on the water works at just the time they are needed. She\\&amp;#039;s amazing. A better display of her talents is in One Night Husband.\n\nOf the supporting actors, talented veteran comic actor Somlek Sakdikul is particularly funny as the shady Daddy. Ampon Rattanawong is notable as Pan\\&amp;#039;s friend Seaw. He turns up in a small role in Pen-Ek\\&amp;#039;s next film, Last Life in the Universe.\n\nThe main highlight is the music. Along with being a romantic comedy and drama, Monrak Transistor is a musical. There most memorable interlude is staged during basic training at the army camp, with soldiers singing as they crawl on their backs under barbed wire, and during their haircuts. The barber moves Pan\\&amp;#039;s head to the side to help sing the chorus. The music is by famous Thai country artist Surapol Sombatcharoen (1930-1968), whose Don\\&amp;#039;t Forget is a repeated refrain. The music gives way to drama and action during the third act, but Don\\&amp;#039;t Forget is brought back one more time for a summation encore.\\&quot;\n\n","torrent":{"xt":"urn:btih:f0de93606692aa2a26496251eef0099961d5ffe5","amp;dn":"Thai+Movie+-+Mon+Rak+Transistor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0de93606692aa2a26496251eef0099961d5ffe5","infoHashBuffer":{"type":"Buffer","data":[240,222,147,96,102,146,170,42,38,73,98,81,238,240,9,153,97,213,255,229]},"announce":[],"urlList":[]}}