{"title":"FS9 - FSX - Aerosoft / Thomas MolitorÃ‚Â´s FSMAP","uid":4929881,"size":243558076,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f17bdce8e43c47c764a2e4155adabaf49f3a2c31&amp;dn=FS9+-+FSX+-+Aerosoft+%2F+Thomas+Molitor%C3%82%C2%B4s+FSMAP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tam408","files":-1,"time":1243997844,"description":"----------------------------------------------------------------------------------\nDuring the past couple of years, electronic navigation aids started to revolutionize aviation. Digitized charts, together with high-resolution displays and the ability to define your own position precisely via GPS, are the technological fundament, to have aeronautical information present even in general aviation aircraft.\n\nNow FSMap brings a realistic simulation of one of the leading devices in this area to flight simulation. With FSMap you will get high-resolution digitized VFR charts for Germany, Austria, Switzerland and the Benelux countries. More charts can be added easily by using the integrated chart editor and configurator. A sophisticated layering system ensures that you will always see the appropriate chart for the current flight phase and mode. But FSMap not only displays charts, it also supplies the virtual pilot with a wealth of information about his flight route, flight status, AI-, multiplayer- and online (IVAO and VATSIM) traffic, and environmental conditions. Additionally airport, navaid and city overlays can be added to the displayed map. And while you are taxiing on the ground, FSMap can even display taxiways and parking positions straight out of flight simulator data. A simple VFR flight plan editor allows you to quickly create a FS flight plan.\n\nBy using the supplied panel editor, the FSMap gauge may be added to any instrument panel with a few mouse clicks. Besides the supplied gauge, you may also use FSMap as an external application outside Flight Simulator. By using FSUIPC (for FS2004) or SimConnect (for FSX), users may even utilize a second PC in their home network to run the FSMap application. \n----------------------------------------------------------------------------------\n\nMore Info: http://www.fsmap.net/\n\n----------------------------------------------------------------------------------\n\nContents:\n\n - Installer\n\n - Serial\n\n----------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:f17bdce8e43c47c764a2e4155adabaf49f3a2c31","amp;dn":"FS9+-+FSX+-+Aerosoft+%2F+Thomas+Molitor%C3%82%C2%B4s+FSMAP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f17bdce8e43c47c764a2e4155adabaf49f3a2c31","infoHashBuffer":{"type":"Buffer","data":[241,123,220,232,228,60,71,199,100,162,228,21,90,218,186,244,159,58,44,49]},"announce":[],"urlList":[]}}