{"title":"Pandora's Keepers: Nine Men and the Atomic Bomb (2005)","uid":9376088,"size":3125544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f24ed401aab6f10b969c4b420df097148910ab4d&amp;dn=Pandora%27s+Keepers%3A+Nine+Men+and+the+Atomic+Bomb+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":5,"time":1387625336,"description":"Books : History : English\n\nPandora's Keepers: Nine Men and the Atomic Bomb By Brian Vandemark\n2005 | 416 Pages | ISBN: 0316160512 | EPUB + MOBI | 2 MB + 2 MB\n\n\n\nNine men - Oppenheimer, Teller, Fermi, Bohr, Lawrence, Bethe, Rabi, Szilard, Compton - brilliant men who believed in science and who saw before anyone else the amazing workings of an invisible world. Some of them were fleeing Nazism in Europe, others quietly slipping out of university teaching jobs, all gathering in secret wartime laboratories to create the world's first atomic bomb. At a secret laboratory in the mountains of northern New Mexico, they would crack the secret of the nuclear chain reaction and construct the most fearsome weapon mankind had ever known. Together they built a device that could incinerate a city and melt human beings so thoroughly that the only thing left would be their scorched outlines on the pavements. During the war, few of the atomic scientists questioned the wisdom of their desperate endeavour, but afterwards they were forced to deal with the sobering legacy of their creation. Some were haunted by the dead of Hiroshima and Nagasaki and would become antinuclear weapons activists; others would go on to build bigger and even deadlier bombs.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f24ed401aab6f10b969c4b420df097148910ab4d","amp;dn":"Pandora%27s+Keepers%3A+Nine+Men+and+the+Atomic+Bomb+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f24ed401aab6f10b969c4b420df097148910ab4d","infoHashBuffer":{"type":"Buffer","data":[242,78,212,1,170,182,241,11,150,156,75,66,13,240,151,20,137,16,171,77]},"announce":[],"urlList":[]}}