{"title":"The Spielberg-Williams Collaboration Boston Pops Orchestra 320cb","uid":9455696,"size":159000369,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f2a2af3e5a7d7d286c01d4e9f49a575f7a26b59e&amp;dn=The+Spielberg-Williams+Collaboration+Boston+Pops+Orchestra+320cb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1389268661,"description":"The Spielberg-Williams Collaboration Boston Pops Orchestra 320cbr (Big Papi) 1991 (Size: 151.63 MB)\n\n\n\n \t\t\n01 John Williams - Raiders of the Lost Ark; The Raiders' March.mp3\t12.04 MB\n \t\t\n02 John Williams - Always; Theme.mp3\t12.77 MB\n \t\t\n03 John Williams - E.T.; Adventures on Earth.mp3\t22.59 MB\n \t\t\n04 John Williams - Sugarland Express; Theme.mp3\t8.46 MB\n \t\t\n05 John Williams - Jaws; Theme.mp3\t6.9 MB\n \t\t\n06 John Williams - Jaws; Out to Sea; The Shark Cage Fugue.mp3\t10.28 MB\n \t\t\n07 John Williams - Empire of the Sun; Exsultate Justi.mp3\t11.47 MB\n \t\t\n08 John Williams - Indiana Jones and the Temple of Doom; Parade of the Slave Children.mp3\t11.32 MB\n \t\t\n09 John Williams - E.T.; Over the Moon.mp3\t5.18 MB\n \t\t\n10 John Williams - 1941; March.mp3\t9.81 MB\n \t\t\n11 John Williams - Empire of the Sun; Cadillac of the Skies.mp3\t11.57 MB\n \t\t\n12 John Williams - Indiana Jones and the Last Crusade; Scherzo for Motorcycle and Orchestra.mp3\t6.61 MB\n \t\t\n13 John Williams - Close Encounters of the Third Kind; Excerpts.mp3\t22.53 MB\n \t\t\n\n\n\n\nSource: 1991 CD\n\n\n\n\n\nThis is a real treat to hear The Boston Pops Orchestra play Speilberg movie themes. For best results &quot;watch&quot; the music in a nice graphic EQ. If you have Fubar music player then set the EQ bars to 160 and turn on the Jaws theme. You can see the music way before you can hear it. Just amazing. - Big Papi\n\n\n\n\n\n\n\n\nBy Alex\nFor almost 30 years, since 1974's The Sugarland Express, John Williams' music has been associated with director Steven Spielberg's films. With the notable exception of The Color Purple (scored by Quincy Jones), Williams has composed the scores to all of Spielberg's films, including 2002's Minority Report and Catch Me If You Can.\n\nThe Spielberg/Williams Collaboration predates the bulk of Spielberg's post-1980s works. It covers 15 years (1974-89), or half of their collaborative years. Although some of the films represented in this 13-track compilation were not successful (1941, Always), Williams' music has proved to be well-received, both by concert audiences and music-store customers alike.\n\nThe album starts off with the rousing &quot;Raiders March&quot; from 1981's Raiders of the Lost Ark. This unforgettable signature theme came about when Williams presented Spielberg with two musical motifs for adventurer/archaeologist Indiana Jones. The director listened to them, and instead of choosing one, asked Williams, &quot;Can't you use both?&quot; The first idea became the main theme, while the second became the &quot;bridge.&quot; Glorious and brassy, yet with a wink and a nod to the music from the 1930s and '40s serials that inspired the Indiana Jones trilogy, the Raiders March is one of the best-known movie themes ever. Later in the album, two other selections (Parade of the Slave Children from Temple of Doom and Scherzo for Motorcycle and Orchestra from The Last Crusade) round out the trilogy.\n\nAdventures on Earth, from 1982's E.T., begins with music that mimics the fast-and-furious pedaling of bicycles, then segues into several different musical themes, including &quot;Over the Moon&quot; (which is reprised independently on track 9), &quot;The Flying Theme,&quot; and the incidental music covering E.T.\nThe Theme from Sugarland Express, Spielberg's first feature film, takes listeners to the wide-open expanses of Texas and features the talented Toots Thielemans on harmonica. It's very much in the vein of a Western, though the movie (which starred Goldie Hawn) took place in the late 1960s and was based on a true story.\n\nJaws, which put both Spielberg and Williams into blockbuster territory for the first time, is represented by three compositions: the famous &quot;Theme,&quot; &quot;Out to Sea,&quot; and the suspenseful &quot;Shark Cage Fugue.&quot; They capture the primordial relentlessness of the great white shark, the optimism and excitement of the Orca's setting out on the hunt, and the frantic activity to get the shark cage put together as Chief Brody, Matt Hooper, and Quint confront the shark.\n\nExsultate Justi and Cadillac of the Skies from 1987's underappreciated Empire of the Sun highlight not only orchestral music but choral music performed by the American Boychoir and the Tanglewood Festival Chorus. Exsultate Justi is a joyous prayer of deliverance heard over the liberation of British and American civilians held in Japanese internment camps near Shanghai, while Cadillac of the Skies is a concert arrangement featuring incidental music, including the cue heard when Jamie, the film's protagonist, sees his first P-51 Mustang.\n\nThe Spielberg/Williams Collaboration ends with musical excerpts from 1977's Close Encounters of the Third Kind, starting with the eerie and atonal music of the title and evolving into the more melodic music heard during the awe-inspiring encounter between humanity and aliens. Featuring beautiful soaring thematic material, brief quotations from &quot;When You Wish Upon a Star,&quot; and ending with the classic five-note Close Encounters motif, Williams' medley from Spielberg's UFO film shows the versatility of both director and composer, whose friendship and teamwork may not have always resulted in successful movies, but provided listeners with a treasure trove of wonderful film music that will endure for many years to come","torrent":{"xt":"urn:btih:f2a2af3e5a7d7d286c01d4e9f49a575f7a26b59e","amp;dn":"The+Spielberg-Williams+Collaboration+Boston+Pops+Orchestra+320cb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2a2af3e5a7d7d286c01d4e9f49a575f7a26b59e","infoHashBuffer":{"type":"Buffer","data":[242,162,175,62,90,125,125,40,108,1,212,233,244,154,87,95,122,38,181,158]},"announce":[],"urlList":[]}}