{"title":"Dub Colossus Addis Through The Looking Glass","uid":6470481,"size":481127161,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f3f5dc2cbf23900733972febb5c98a873d7277b8&amp;dn=Dub+Colossus+Addis+Through+The+Looking+Glass&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ocnrf","files":23,"time":1308126505,"description":"Nick Page says his aim is to constantly surprise, and the second Dub Colossus album achieves just that with its fusion of Ethiopian jazz and traditional styles, dub reggae and widescreen, and atmospheric instrumentals. Three years ago, he travelled to the Ethiopian capital to record the experimental studio set A Town Called Addis with local musicians. Dub Colossus went on to prove that they were also a rousing live band, and now (after a brief delay while Page launched another successful fusion band, Syriana) comes this epic and confident new set. Page's love of reggae is reflected in the Africanised reworking of Satta Massagana and the Althea and Donna hit Uptown Top Ranking, but the best tracks are those that sound the most Ethiopian. The driving and edgy Guragigna, with sturdy vocals from Mimi Zenebe, and the African R&amp;B instrumental track Feqer Aydelem Wey, featuring the Bole Brass, are updated reminders of the golden era of Ethiopian music in the 1960s, while Kuratu is a soulful ballad matching the vocals of Tsedenia Gebremarkos against the jazz-edged piano work of the brilliant young Samuel Yirga. Then there are traditional songs, featuring the massinko fiddle or krar harp, and a brassy jazz-dub finale written as &quot;a soundtrack to the madness of Addis&quot;. An intriguing, inspired set.\n\nGuardian UK\n\nEAC rip, log, cue, images included\n\nI'll seed this between 0.00 &amp; 08.00 GMT","torrent":{"xt":"urn:btih:f3f5dc2cbf23900733972febb5c98a873d7277b8","amp;dn":"Dub+Colossus+Addis+Through+The+Looking+Glass","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3f5dc2cbf23900733972febb5c98a873d7277b8","infoHashBuffer":{"type":"Buffer","data":[243,245,220,44,191,35,144,7,51,151,47,235,181,201,138,135,61,114,119,184]},"announce":[],"urlList":[]}}