{"title":"Cosmos: A Space-Time Odyssey","uid":9822804,"size":3783733136,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f5508a698142e390c9c4521a0d79c762973ce2d0&amp;dn=Cosmos%3A+A+Space-Time+Odyssey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"incognia","files":9,"time":1395721271,"description":"Cosmos: A Spacetime Odyssey is an American science documentary television series. The show is a follow-up to the 1980 television series Cosmos: A Personal Voyage, which was presented by Carl Sagan on the Public Broadcasting Station and considered a milestone for scientific documentaries. This series was developed to bring back the foundation of science to network television at the height of other scientific-based television series and films. The show is presented by astrophysicist Neil deGrasse Tyson, who was inspired by Sagan as a young college student. Among the executive producers are Seth MacFarlane, whose clout and financial investment was instrumental in bringing the show to broadcast television, and Ann Druyan, Sagan's widow and a co-creator of the original series. The series loosely follows the same thirteen-episode format and storytelling approach that the original Cosmos used, including elements such as the &quot;Ship of the Imagination&quot;, but features updated information since the 1980 series and extensive computer-generated graphics and animation footage to augment the narration. The show is produced by Brannon Braga, and Alan Silvestri provides the backing score.","torrent":{"xt":"urn:btih:f5508a698142e390c9c4521a0d79c762973ce2d0","amp;dn":"Cosmos%3A+A+Space-Time+Odyssey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5508a698142e390c9c4521a0d79c762973ce2d0","infoHashBuffer":{"type":"Buffer","data":[245,80,138,105,129,66,227,144,201,196,82,26,13,121,199,98,151,60,226,208]},"announce":[],"urlList":[]}}