{"title":"Strategy Builder - 1st Ed (2015).pdf Gooner","uid":12675412,"size":10770238,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6a0328a0c14119ca3044b60d662828508eb670a&amp;dn=Strategy+Builder+-+1st+Ed+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1446500051,"description":"Strategy Builder - How to Create and Communicate More Effective Strategies - 1st Edition (2015).pdf Gooner\r\n\r\nPublisher: Wiley; 1 edition (April 27, 2015)\r\nLanguage: English\r\nISBN-10: 1118707230\r\nISBN-13: 978-1118707234\r\n\r\nA visual and interactive guide to building and communicating strategies that actually work YOUR STRATEGY HAS SEVEN SECONDS TO CAPTIVATE ITS AUDIENCE So how are you going to present it? A big wordy document? A lengthy address? Slides full of bullet points? The best way to engage and involve people is through pictures. Strategy Builder shows you how to creatively combine the best strategy frameworks to orient and animate strategy discussion and development in your team. This visual, interactive guide, with illustrations by Visory, uses real world examples and practical tips to help you: * Discover the five key foundations that every strategy should be built upon * Draw compelling and unique pictures that capture your organization s distinct strategies * Develop your skills as a leader of strategy discussions * Understand how to use interactive drawing to engage others and achieve buy in * Additional online resources available including Strategy Drawing Templates, plus Builder Slides and case studies materials for instructors. Locate the 'Companion Website' link towards the bottom of this page to access these materials. Test your strategic vision or develop a new strategic plan based on the best elements of key strategic frameworks by trying the FREE interactive Strategy Builder app, developed in association with StrategyBlocks, at www.strategicplan.com Praise for Strategy Builder: Cummings &amp; Angwin are pioneers in introducing novel approaches in teaching and applying the principles of strategy --Robert M. Grant, Bocconi University, author of Contemporary Strategy Analysis In a complex, fast changing world, where we are bombarded by words, numbers and reports, the visual-first approach to strategy provided by Strategy Builder is immensely helpful for inspiring and communicating a clearer vision of how to move forward. -- Rachna Bhasin, VP Strategy, SiriusXM At last someone has grasped this idea and come up with a way to help us demonstrate strategic plans and ambitions in a creative new way. --Vikki Heywood CBE, Chair of The Royal Society for the Arts This wonderful book is the first to solve a near-universal problem: communicating strategic ideas is just as hard and just as important as coming up with them in the first place, and both are visual activities. The question is not Do you understand? but Do you see? --William Duggan, Professor, Columbia University, author Strategic Intuition This book shows how to draw an organization's strategy so you see what's been considered, what's not been considered, and how things are related,. Strategy building is presented as a fun and involving learning process.The approach is revolutionary in that it enables not only the development but also the easy sharing of strategic understanding. --Roger L.M. Dunbar, Emeritus Professor, Stern School of Business, New York University What a great idea! They layout is also really thoughtful; it makes you immediately want to get out a pencil and start doodling. --Adam Martin, Customer Solutions Director, The Brakes Group As a time pressed executive it was a delight to find a book that I can dip into to find the best strategic frameworks - those that have proved the test of time and academic scrutiny as being truly useful in the workplace. Even better for an inveterate scribbler: endorsement that a picture and permission to play with ideas visually really does say a thousand words and more! --Sarah Mitson, Global Business Director, TNSGlobal This is an invaluable resource for any executive wanting to improve engagement in strategy development and communication. The accessible layout means that the book itself can play an active and inspiring role in strategy discussions. --Matt Thomas, Director, Braxton Associates, Strategy Consultants At last a book that grasps the implications of recent psychology: people think visually as well as verbally. The authors provide powerful visual devices that will both help managers conceive better strategies and enable their people to execute them more effectively. --Richard Whittington, Professor at Said Business School, Oxford University A powerful approach to make strategy more engaging again! Strategy Builder is landmark book is destined to make an important impact to the field of strategy, strategizing and strategic management. Executives across the board (and students of strategy) will find the core message of this book counterintuitive and compelling. The idea of &quot;drawing&quot; strategy may seem like child's play, yet all great strategists and philosophers know that it is through such &quot;serious play&quot; that allows us to see things differently so that we can see different things. --Robert Wright, Professor of Strategy, Hong Kong Polytechnic University","torrent":{"xt":"urn:btih:f6a0328a0c14119ca3044b60d662828508eb670a","amp;dn":"Strategy+Builder+-+1st+Ed+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6a0328a0c14119ca3044b60d662828508eb670a","infoHashBuffer":{"type":"Buffer","data":[246,160,50,138,12,20,17,156,163,4,75,96,214,98,130,133,8,235,103,10]},"announce":[],"urlList":[]}}