{"title":"(British TV mini-series) The Politician's wife (moviesbyrizzo)","uid":6080084,"size":2201452645,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f6ded63c126d90a77ec3f1f4e55e700f8e498869&amp;dn=%28British+TV+mini-series%29+The+Politician%5C%27s+wife+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1294077099,"description":"Note: Mature content, adult guidance\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0112126/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0112126/&lt;/a&gt;\n\n\nThe British mini-series &quot;The Politician's wife&quot; is a rather interesting look at the\ndevious workings of the mind in those that have nothing more than a vindictive \nstreak that sees no mercy or relent when feeling deceived - regardless of the real \nsense of what is all involved.\n\nSometimes its better just to call it quits than to belabour in some show\nof &quot;getting even&quot; trying to waste the prospects in if for those that you target\nin this manner. Why not just a simple divorce rather than a vendetta to destroy!\n\nThe issues are yet complex, and this mini-series is most recommended for those that\nare mature and well minded enough to make good use of the content in respect of\nits treatment of sex in marriage etc.\n\nSpecifically, there is a scene we are given to view, where what seems like an act \nof rape is quite clearly being played out. Yet, in what precedes the act, occurs at the moment of truth, and follows the entire matter gives us the indication that\nthe matter is too much more complex than to be handled in the severest ways of \nwhat view we take of that as a society and as law abiding citizens altogether.\n\nIn any event, we do not hear the protest that we might had the dynamics and responding patterns of the individuals concerned been saner. That's my take on it\nin any event.\n\nThis is an interesting look at the nature of British politics and the halls\nof power where people seem to want to play such games as we see in the plot\nof this tale.\n\nI couldnt find this series in local stores, so I bring you an xvid collection\nof three avi files as found at a private site where we paid for access.\n\n608 X 368 video 1448k bitrate, 128k audio\n\nBy the way, its a great joy to upload at such a site I find, as everything you\nseed is appreciatively shared 100% as you &quot;put out&quot; the seed! Almost everyone that\ngraduates goes on to seed after as well! Now if only they could somehow come up \nwith torrent seeding software that only gives a seed - if a peer gives it back - \nto the next in line that wants to &quot;pass it on!&quot;. In accounting its called\ndouble entry - the debits and credits must match - or people get took all\ntoo much in their desires to want to share fairly instead!\n\nEven a 4GB torrent gets gobbled up in a few very short hours at breathtaking speed\nwith all graduating at once! lovely!\n\nHappy new year folks!\n\nMichael Rizzo Chessman\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:f6ded63c126d90a77ec3f1f4e55e700f8e498869","amp;dn":"%28British+TV+mini-series%29+The+Politician%5C%27s+wife+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6ded63c126d90a77ec3f1f4e55e700f8e498869","infoHashBuffer":{"type":"Buffer","data":[246,222,214,60,18,109,144,167,126,195,241,244,229,94,112,15,142,73,136,105]},"announce":[],"urlList":[]}}