{"title":"For a New Liberty: The Libertarian Manifesto","uid":3514706,"size":232310206,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f82833ee296ac7c906a51954a0277170b3ed9b42&amp;dn=For+a+New+Liberty%3A+The+Libertarian+Manifesto&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jakob Lundberg","files":19,"time":1156119838,"description":"For a New Liberty\n\n\nIn For A New Liberty: The Libertarian Manifesto, Rothbard proposes a once-and-for-all escape from the two major political parties, the ideologies they embrace, and their central plans for using state power against people. Libertarianism is Rothbard&amp;#039;s radical alternative that says state power is unworkable and immoral and ought to be curbed and finally overthrown.\n\nTo make his case, Rothbard deploys his entire system of thought: natural law, natural rights, Austrian economics, American history, the theory of the state, and more.\n\nIt is relentless, scientific, analytical, and morally energetic?a book that makes an overwhelming case. Indeed, it gave an entire movement its intellectual consciousness and earned Rothbard the titles &quot;Mr. Libertarian&quot; and &quot;The State&amp;#039;s Greatest Living Enemy.&quot;\n\nSociety without the nation state? Rothbard shows that this is the way for peace, prosperity, security, and freedom for all. In the entire history of libertarian ideas, no book has more successfully combined ideological rigor, theoretical exposition, political rhetoric, historical illustration, and strategic acumen. Rothbard poured a lifetime of research and all his intellectual energy into this project and he succeeded in writing a classic.\n\nThe book is the result of the only contract Rothbard ever received from a mainstream commercial publisher. He was asked to sum up the whole of the libertarian creed. Looking at the original manuscript, which was nearly complete after its first draft, it seems that it was a nearly effortless joy for him to write. It is seamless, unrelenting, and full of life.\n\nHe cut no corners and pulled no punches. It appeared in 1973 and created a whole movement that set out to crush the political monopoly.\n\nFrom the day the book went out of print, the phonecalls and emails started coming into our offices, in hopes of a new edition. Thanks to benefactors that made it possible, this new edition from the Mises Institute is hardbound, beautiful, and affordable.\n\nIn subject after subject, this book is informative, bracing, challenging. It also features that characteristically clear writing style for which Rothbard is famous, which stemmed from his organized thinking and passionate drive to teach and change the world.\n\nThe book begins with American history to show that the revolution of 1776 was the most libertarian of any in history. The pastors, pamphleteers, and statesmen who led it held that the state has no rights of the people that the people themselves do not possess. They demand full liberty, not some truncated version that existed in the old world. In this discussion, the reader comes to appreciate the founders as never before.\n\nRothbard then sets out to rekindle that fire, first through a discussion of the philosophy and ethics of freedom. The central axiom: no man or group of men may aggress against the person and property of anyone else. He justifies the axiom on the basis of natural rights. It is an axiom that has few opponents, until Rothbard spells out the implications: taxation is theft, conscription is slavery, and war is mass murder, among many other points.\n\nBracing indeed! But the state is the primary violator of this simple axiom. It presumes the right to rob and kill while purporting to protect you from robbing and killing. Thus follows a full theory of the state, how it gains and maintains controls over the population (not through a ?social contract?!), the various failed methods for keeping it in check (not even constitutions work!), its operations and tendencies to work its evil (it never has enough power), and how intellectuals become co-opted by the forces of state power.\n\nHere again, Rothbard draws his argument from American history. He shows how dangerous it was for the US Constitution to entrust the Supreme Court with the job of policing the government for infractions against the Constitution. What it ended up doing, of course, was ratifying egregious violations of the Constitution, with full knowledge that there was no higher court to which the people themselves could appeal.\n\nRothbard isn?t satisfied to make the case on this abstract level. He shows that the most pressing problems of society are wrapped up in government operations. Whether it is medical issues, the price of oil, the disaster of education, conflicts over religion, police corruption, the scandal of war, the issues that are tearing us apart are invariably the result of government intervention into the sector. When markets are in full control?computer technology and software or cell phones?we find not conflict but cooperation and progress.","torrent":{"xt":"urn:btih:f82833ee296ac7c906a51954a0277170b3ed9b42","amp;dn":"For+a+New+Liberty%3A+The+Libertarian+Manifesto","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f82833ee296ac7c906a51954a0277170b3ed9b42","infoHashBuffer":{"type":"Buffer","data":[248,40,51,238,41,106,199,201,6,165,25,84,160,39,113,112,179,237,155,66]},"announce":[],"urlList":[]}}