{"title":"Amy Grant - That's What Love Is For (Xvid-2nafish)","uid":6015567,"size":63722210,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f8b660bb6c4ca42d67e9d1b0573bdd07ead045fb&amp;dn=Amy+Grant+-+That%5C%27s+What+Love+Is+For+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1291626382,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:12\n\n[Video]\nResolution : 480x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1891 Kbps\nQuality Factor : 0.37 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;That's What Love Is For&quot; is a 1991 single by Christian music singer Amy Grant. It was released as the fourth single from the Heart In Motion album. The single was the only one from the album to be released both to secular and Christian radio; &quot;That's What Love Is For&quot; was the album's second Christian radio single and its third pop radio single. In the United States, &quot;That's What Love Is For&quot; became Amy Grant's second Adult Contemporary chart-topper and third Top Ten Hot 100 single, peaking at #7, while in the United Kingdom the single reached #60.\n\nHeart in Motion is the twelfth album by Christian pop singer Amy Grant, released in 1991.\n\nIn contrast with its predecessor, the natural-sounding Lead Me On, Heart In Motion consisted of songs that were heavy in the style of mainstream music of the time. In addition, unlike Lead Me On, Heart In Motion contained few overtly religious songs, with most of the lyrics for the songs on the album dealing with love or other life issues to which non-Christian as well as Christian audiences could relate. There were a couple songs on the album, however, that were openly Christian in their content, such as &quot;Ask Me,&quot; which describes how a woman's faith helps her to heal from child sexual abuse, and &quot;Hope Set High,&quot; both of which were hits on Christian radio. Another song with an overtly Christian theme was &quot;You're Not Alone&quot; which reinforced a greater power despite edgy features like whipcracks and a screaming guitar solo.\n\nOtherwise, Heart In Motion was a pop music blockbuster upon its release in March 1991, going to the Top Ten of the Billboard 200 (as well as #1 of the Christian albums chart for thirty-two weeks), and selling five million copies by the end of 1997. The first single from the album, &quot;Baby Baby&quot; (more or less the title cut, the album's title derived from the lyrics of this song), hit the #1 position on the Billboard Hot 100 and the Adult Contemporary chart. The following four singles also performed well on the pop and AC charts: &quot;Every Heartbeat&quot; (#2 Hot 100, #2 AC), &quot;That's What Love Is For&quot; (#7 Hot 100, #1 AC), &quot;Good For Me&quot; (#8 Hot 100, #4 AC), and &quot;I Will Remember You&quot; (#20 Hot 100, #2 AC). It was listed at #30 in the 2001 book, CCM Presents: The 100 Greatest Albums in Christian Music and was certified 5x platinum by the RIAA for sales of over 5 million copies, making it the best-selling Christian music album ever released.\n\nAlso received a nomination at the Grammy Awards of 1992 for Album of the Year, losing to Unforgettable... with Love by Natalie Cole.\n\nIn 2007, Heart in Motion was reissued and digitally remastered by Grant's new record label, EMI/Sparrow Records. The remastered edition is labeled with a &quot;Digitally Remastered&quot; logo in the 'gutter' on the CD front.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:f8b660bb6c4ca42d67e9d1b0573bdd07ead045fb","amp;dn":"Amy+Grant+-+That%5C%27s+What+Love+Is+For+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8b660bb6c4ca42d67e9d1b0573bdd07ead045fb","infoHashBuffer":{"type":"Buffer","data":[248,182,96,187,108,76,164,45,103,233,209,176,87,59,221,7,234,208,69,251]},"announce":[],"urlList":[]}}