{"title":"El Dia De La Bestia (English subtitles)","uid":4689495,"size":660622349,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f8b70247f7ab3f0cecffb5f7d12937cb74b5cea1&amp;dn=El+Dia+De+La+Bestia+%28English+subtitles%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ghost Radio","files":-1,"time":1233344148,"description":"Spanish movie from 1995. English title: Day Of The Beast. It's on TPB already but I hardcoded English subtitles into it so English speaking people can enjoy the movie too.\n\nGenre: dark comedy / horror\n\nA priest discovers through cabalistic studies that the antichrist -the son of the devil- will be born on the upcoming christmas day. The priest attempts to contact the devil and gain his trust by sinning as much as possible. His goal is to find the antichrist and kill him to save the world. During his quest he befriends a metalhead who thinks it's awesome to have found a priest with the same satanic interests he has. Together they kidnap the host of a paranormal TV show as time is running out. Will they be able to save the world from doom or are they simply losing their minds?\n\nThis movie doesn't contain that much actual horror but it has enough dark humor, violence and suspense to keep the viewer occupied. Alex Angulo delivers a great performance in his role as the crazy priest. The weakest point of this movie is the music, some scenes would have worked a lot better if they would have used actual death metal music instead of the third rate pop metal that's employed. It just seems very misplaced in settings like a concert where people are walking around in Deicide and Impaled Nazarene shirts that the band they are watching on stage sounds so weak. But that's my only critism, other than that it's an amusing movie with good acting and interesting plot twists. And it's just plain funny to see a priest committing all these &quot;sins&quot;\n\n\n\nuploaded by: &lt;a href=&quot;\nhttp://www.ghostradio.co.nr&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ghostradio.co.nr&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f8b70247f7ab3f0cecffb5f7d12937cb74b5cea1","amp;dn":"El+Dia+De+La+Bestia+%28English+subtitles%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8b70247f7ab3f0cecffb5f7d12937cb74b5cea1","infoHashBuffer":{"type":"Buffer","data":[248,183,2,71,247,171,63,12,236,255,181,247,209,41,55,203,116,181,206,161]},"announce":[],"urlList":[]}}