{"title":"Quaternary Ammonium Salts - R. Alan Jones","uid":15383126,"size":10475406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f906eaf4c0ca43807033fc2523fd150e8222d1b4&amp;dn=Quaternary+Ammonium+Salts+-+R.+Alan+Jones&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469252822,"description":"Quaternary Ammonium Salts - R. Alan Jones (AP, 2001).pdf\r\n\r\nThis text provides experimental methods for a wide range of organic reactions, systematically arranged according to reaction type, and describes the advantages and limitations of the procedures. Traditional methods to speed up organic reactions involve energy-consuming processes and costly and environmentally &quot;unfriendly&quot; solvents. Additionally, isolation of the product requires energy and time-consuming purification processes. A simple solution, especially for reactions involving anionic reactants, is the use of phase-transfer catalysis. Quaternary ammonium cations have the ability to transfer the anionic reactants as non-solvated ion-pairs from aqueous media into organic media. The resultant effect is to increase the rate of the organic reaction by enhancing the reactivity of the anionic species and increasing the encounter rate with the organic substrate. Side reactions are frequently eliminated so that the overall yield of the desired product is increased.\r\n\r\nQuaternary Ammonium Salts presents procedures for reducing reaction times and the need for extreme conditions, which are frequently encountered under standard reaction procedures.\r\n\r\nThis is the only book to be published on quaternary ammonium salts. Best Synthetic Methods volumes allow the practicing synthetic chemist to choose between all the alternatives and assess their real advantages and limitations. Each volume of the series deals with a particular topic from a practical point of view, giving detailed examples and precise experimental directions and hints. With the emphasis on laboratory use, these volumes represent a comprehensive and practical guide to modern synthetic organic chemistry","torrent":{"xt":"urn:btih:f906eaf4c0ca43807033fc2523fd150e8222d1b4","amp;dn":"Quaternary+Ammonium+Salts+-+R.+Alan+Jones","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f906eaf4c0ca43807033fc2523fd150e8222d1b4","infoHashBuffer":{"type":"Buffer","data":[249,6,234,244,192,202,67,128,112,51,252,37,35,253,21,14,130,34,209,180]},"announce":[],"urlList":[]}}