{"title":"WinRAR v5.30 (x32-x64) ENG-ESP","uid":12857175,"size":4225028,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f988955eeaffb1b619c6b0eb4da0ad7a44081843&amp;dn=WinRAR+v5.30+%28x32-x64%29+ENG-ESP&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"edmacri","files":6,"time":1448681264,"description":"WinRAR is a powerful archive manager. It can backup your data and reduce the size of email attachments, decompress RAR, ZIP and other files downloaded from Internet and create new archives in RAR and ZIP file format.\r\n\r\n\r\nWinRAR is a program that can be used to open, create and decompress RAR, ZIP and other format files. The latest version also supports RAR5, the new compression algorithm.\r\n\r\nWhy use WinRAR?\r\n\r\nWinRAR is a program that compresses files so that they take up less space on your hard disk. It supports three compression formats, ZIP, RAR, and the new RAR5 format; introduced with this release, RAR5 offers a better compression rate.\r\n\r\nWinRAR gives you the option of protecting the compressed file with a password using a 256-bit AES encryption algorithm. Perfect for hiding your files from prying eyes!\r\n\r\nThe app can also create self-extracting files, or files that are decompressed automatically with a double-click, as well as including improved features for repairing damaged files.\r\n\r\nWith regard to the decompression functions, WinRAR supports 15 different formats : RAR, ZIP, 7-Zip, ACE, ARJ, BZ2, CAB, GZip, ISO, JAR, LHZ, TAR, UUE, XZ, and Z.\r\n\r\nThe options menu is very detailed and lets you configure every aspect of the program. It's definitely useful for the most demanding users, but it might end up confusing those who are less experienced.\r\n\r\nWinRAR is compatible with Windows 10,8.1,8, 7, Vista and XP, and the installation file is compatible with 32 and 64-bit systems. In addition, it can integrate with the antivirus installed on your PC and support a wide range of formats.\r\n\r\nxxxxxxxxxxxxxxxxxxxx\r\n\r\n\r\nInstrucciones:\r\n\r\n1.- Instala el programa de acuerdo a tu sistema: x32 o x64. Al terminar la instalación cierra el programa completamente.\r\n\r\n2.- Abre la carpeta &quot;Activation&quot; dentro encontraras dos archivos que te dan dos opciones diferentes de activación del producto:\r\n\r\n-&quot;keygen-CORE.(v3.91).exe&quot; este es un keygen que crea un archivo de registro (reg), en el espacio &quot;Name&quot; pones tu nombre, en &quot;Type&quot; escoges la opción &quot;Single PC usage license&quot; y das clic en &quot;Save License&quot; y lo guardas dentro del directorio donde se instaló el programa y lo ejecutas.\r\n\r\n-&quot;rarreg.key&quot; este es una archivo de registro, lo copias y lo pegas dentro del directorio donde se instaló el programa y lo ejecutas.\r\n\r\nCualquiera de las dos opciones es válida.\r\n\r\n*traducción al español:\r\n\r\nAbre la carpeta &quot;Ing&quot; y todo lo que está dentro lo copias y pegas dentro del directorio donde se instaló el programa y reemplazas todo lo que está dentro. Y listo ya lo tienes en español.\r\n\r\n--------------------------------------------\r\n\r\nInstructions:\r\n\r\n1.- Install the program according to your system: x32 or x64. When the installation is finished close the program completely.\r\n\r\n2.- Open the folder &quot;Activation&quot; inside you will find two files that give you two different options for activation of the product:\r\n\r\n- &quot;keygen-CORE.(v3.91).exe&quot;, this is a keygen it creates a log file (reg), in the option &quot;Name&quot; put your name, in the option &quot;Type&quot; choose the option &quot;Single PC usage license&quot;, and you click on &quot;Save License&quot; and save it in the directory where the program is installed and run it.\r\n\r\n- &quot;rarreg.key&quot; This is a log file, copy it and paste it into the directory where you installed the program and run it.\r\n\r\nEither of the two options are valid.\r\n\r\n\r\nxxxxxxxxxxxxxxxxxxxx\r\n\r\n\r\nYou can download the latest WinRAR (v5.30) from their official website:\r\n \nhttp://www.rarlab.com/\r\n\r\nOnly the following languages:\r\nArabic (32 bit, 64 bit), Armenian (32 bit, 64 bit), Bulgarian (32 bit, 64 bit), Chinese Traditional (32 bit, 64 bit), Danish (32 bit, 64 bit), Dutch (32 bit, 64 bit), English (32 bit, 64 bit), Estonian (32 bit, 64 bit), Finnish (32 bit, 64 bit), French (32 bit, 64 bit), German (32 bit, 64 bit), Hebrew (32 bit, 64 bit), Hungarian (32 bit, 64 bit), Indonesian (32 bit, 64 bit), Lithuanian (32 bit, 64 bit), Persian (32 bit, 64 bit), Portuguese Brazilian (32 bit, 64 bit), Russian (32 bit, 64 bit), Serbian Cyrillic (32 bit, 64 bit), Swedish (32 bit, 64 bit), Thai (32 bit, 64 bit), Ukrainian (32 bit, 64 bit), Vietnamese (32 bit, 64 bit).\r\n\r\nYou can check in this place if the file (activator) is trusted.\r\nAnalysis by &quot;Virus Total&quot;:\r\n\r\nkeygen-CORE.(v3.91).exe: \nhttps://www.virustotal.com/es/file/776303a0a9794f0abc8696c395892d84de37b050c5adb76e2f7fe64f594090e1/analysis/1448673658/\r\n\r\nrarreg.key: \nhttps://www.virustotal.com/es/file/fc18a1810fbdcf6093ac1329199d59f65a173c74fa24227bfbde9d971eed3362/analysis/1448676466/\r\n\r\n\r\n¡¡THANKS TO THE &quot;CORE TEAM&quot; BY THE KEYGEN-ACTIVATOR!!","torrent":{"xt":"urn:btih:f988955eeaffb1b619c6b0eb4da0ad7a44081843","amp;dn":"WinRAR+v5.30+%28x32-x64%29+ENG-ESP","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f988955eeaffb1b619c6b0eb4da0ad7a44081843","infoHashBuffer":{"type":"Buffer","data":[249,136,149,94,234,255,177,182,25,198,176,235,77,160,173,122,68,8,24,67]},"announce":[],"urlList":[]}}