{"title":"Risen 3: Titan Lords - Complete Edition (GOG)","uid":13615699,"size":6859058907,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fb069f57bb5274817063d5072c19496600c04ab6&amp;dn=Risen+3%3A+Titan+Lords+-+Complete+Edition+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":5,"time":1455935392,"description":"Install instructions:\r\n- Run &quot;setup_risen3_enhanced_edition_2.0.0.3.exe&quot;\r\n- Navigate to the DLC folder and run &quot;setup_risen3_enhanced_edition_complete_dlc_2.0.0.3.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: RISEN 3: TITAN LORDS\r\nGenre: Action - Adventure - Fantasy\r\nWorks on: Windows (Vista, 7, 8, 10)\r\nLanguages: Audio and text: Deutsch, English. Text only: español, français, italiano\r\nFeatures: single-player\r\nReleased: August 13, 2014\r\nSize: 6.7 GB\r\nCompany: Piranha Bytes / Deep Silver\r\nRating:\tESRB Rating: Mature\r\nStore page: http://www.gog.com/game/risen_3_titan_lords\r\n\r\nAbout:\r\nThe Risen 3: Titan Lords - Upgrade to Complete includes the following DLC: Risen 3 - Adventure Garb, Risen 3 - Fog Island, Risen 3 - Uprising of the Little Guys.\r\nThe world has been abandoned by its gods and is scarred from the rampage of the Titans. Humanity is struggling to regain strength and rally its forces. You, however, have more pressing concerns: your own life has been shattered and you must set off to reclaim what is lost amidst the darkness that is spreading throughout the world. Who knows, maybe you'll even save the world at the same time?\r\nFreedom: Freely explore and take on quests at your leisure. Quests will have different ways to tackle them and different outcomes. You can play different parts of the game in whatever order you wish and shape your character individually.\r\nExploration: Discover quests and characters as you make your way through the diverse world of Risen 3 - Titan Lords. From quaint medieval-style towns to delving deep into the dank dark of mines, to the supernatural shadow world, there is a wealth of possibilities waiting to be explored. You will be able to traverse this world in a variety of ways, from swimming to climbing.\r\nEnhanced combat: Featuring a revamped fighting system, with new animation systems in place that add nuance to the fights.\r\nMagic is back! Crystal magic has returned, bringing with it devastating new combat abilities. Wield elements such as lightning, fire and ice to obliterate your foes, or make use of a multitude of additional magical skills to aid you in exploration - the choice is yours!\r\nGuilds &amp; factions: Choose to ally yourself with one of three distinct guilds, each offering unique skills, armouries and quests allowing you to approach your quest in very different ways. Discover additional factions that exist to bend the balance of political power in the world, each with their own agenda for you to uncover. Be careful which characters you trust – some might ally with you with the intent of fulfilling their own sinister plans.\r\n\r\nMinimum system requirements - Windows: Vista SP2 / 7 SP1 / 8 / 10 64bit only\r\nProcessor: 2.4 GHz Dual Core Processor\r\nMemory: 4 GB RAM\r\nGraphics: Radeon HD 3850 or GeForce 9600 GT \r\nDirectX: Version 9.0c \r\nStorage: 8 GB available space\r\nSound Card: DirectX 9.0c Compatible\r\nMouse, Keyboard\r\n\r\nRecommended system requirements - Windows: 7 / 8 / 10 64bit only\r\nProcessor: Intel Core i5 at 2.5 GHz or better or AMD Phenom II x4 940 at 3.0 GHz Memory: 8 GB RAM Graphics: Nvidia GeForce GTX 470 or AMD Radeon HD 5850 \r\nSound: DirectX 9.0c compatible\r\n8GB Hard Drive Space\r\nMouse, Keyboard","torrent":{"xt":"urn:btih:fb069f57bb5274817063d5072c19496600c04ab6","amp;dn":"Risen+3%3A+Titan+Lords+-+Complete+Edition+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb069f57bb5274817063d5072c19496600c04ab6","infoHashBuffer":{"type":"Buffer","data":[251,6,159,87,187,82,116,129,112,99,213,7,44,25,73,102,0,192,74,182]},"announce":[],"urlList":[]}}