{"title":"fsx p3d nemeth Designs CH-53E Super Stallion","uid":10109268,"size":101814525,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fb7dc1f58419f1655bd546e794107778c27cbeb3&amp;dn=fsx+p3d+nemeth+Designs+CH-53E+Super+Stallion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kandoit","files":-1,"time":1399497521,"description":"i have instaled it to p3d all click spots seam to work not been able to start engin quick start doe's not seam to work looks like you have to follow the manual.\n\nThe CH-53E Super Stallion is used by US Marine Corps for amphibious assault, carrying heavy equipment and armament, and recovering disabled aircraft;also used by US Navy for vertical onboard delivery and recovery of damaged aircraft from aircraft carriers.\n\nThe development of the CH-53E is based on the CH-53D.\n\nImprovements include the addition of a third engine to give the aircraft the ability to lift the majority of the Fleet Marine Force's equipment, improved main rotor blades and composite tail rotor blades.\n\nA dual digital automatic flight control system and engine anti-ice system give the aircraft an all-weather capability.\n\nThe helicopter seats 37 passengers in its normal configuration and has provisions to carry 55 passengers with centerline seats installed.\n\n \n\nFeatures:\n\n    Accurate and detailed interior and exterior visual models and textures.\n    Custom exterior and interior animations such as foldable rotor and pylon, ramp door, EAPS, extendable refuel probe, gauges and switches.\n    Fully clickable dynamic virtual cockpit. Perfectly flyable from the VC.\n    Many implemented systems such as EAPS, de-ice system, firefighting\n    Realistic flight dynamics\n    Uses the newest FSX graphic featuires\n    Two variants with different paint schemes\n    PDF manual\n    Paint kit","torrent":{"xt":"urn:btih:fb7dc1f58419f1655bd546e794107778c27cbeb3","amp;dn":"fsx+p3d+nemeth+Designs+CH-53E+Super+Stallion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb7dc1f58419f1655bd546e794107778c27cbeb3","infoHashBuffer":{"type":"Buffer","data":[251,125,193,245,132,25,241,101,91,213,70,231,148,16,119,120,194,124,190,179]},"announce":[],"urlList":[]}}