{"title":"Sled Storm [Ntsc] [CD To DVD Build - Working], Ps2","uid":5203031,"size":303793031,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:fb912fbcf72081639bb675274fea3d881d7267bc&amp;dn=Sled+Storm+%5BNtsc%5D+%5BCD+To+DVD+Build+-+Working%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1260252880,"description":"Sled Storm for the Ps2                                            Rel. 03/11/2002\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         ISO\nGenre.:        Motor Sled Racing\nConversion:    Rebuilt from CD To DVD\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works. \n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n         &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n         &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nRace beyond boundaries in this all-out world of high-powered sled racing where speed is a necessity and losing is not an option. Sled Storm, the fuel-injected addition to the EA SPORTS BIG lineup, delivers the thrill of piloting rocket-powered sleds while pushing you to be first to the finish line. The screaming gas-powered engines compete in volume with the biggest beats from the industrial charts just whats needed to push you over the edge.\n\nSled Storm is racing with a difference. It has you racing a snowmobile around 14 tracks. Race on mountain tracks or in snowcross (like motocross). \n\nThere are 6 characters each with different attributes, such as better speed on their snowmobiles or they are better at tricks. You can performs many different tricks and use them together in combos.\n\nEarn cash for winning and upgrade your sled.\n\n\nFeatures:\n\n* High speed and incredibly powerful sleds combined with a fuel-injected attitude \n  provide intense, high-impact, neck-and-neck racing. \n\n* Hear the huge engine sounds that signal the power being unleashed. \n\n* Feel the power with controller rumble as the characters hold on for dead life. \n\n* The game goes beyond realism by providing places based in reality but with more \n  imagination. \n\n* 7 unique tracks with extensive hidden shortcuts and alternate routes. \n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media\nisn't working.\n\n\nIf using DVD+R then booktype to DVD-ROM. \n(If your mod-chip, or Ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:fb912fbcf72081639bb675274fea3d881d7267bc","amp;dn":"Sled+Storm+%5BNtsc%5D+%5BCD+To+DVD+Build+-+Working%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb912fbcf72081639bb675274fea3d881d7267bc","infoHashBuffer":{"type":"Buffer","data":[251,145,47,188,247,32,129,99,155,182,117,39,79,234,61,136,29,114,103,188]},"announce":[],"urlList":[]}}