{"title":"Pussy Riot - A Punk Prayer - Documentary.mkv","uid":9478483,"size":637352777,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fbc30967c08ea7da9d1f7b1813bc2f36faa94510&amp;dn=Pussy+Riot+-+A+Punk+Prayer+-+Documentary.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FreeSpeechForTheDumb","files":-1,"time":1389745358,"description":"On 21 February 2012, five members of the group staged a performance on the soleas of Moscow's Cathedral of Christ the Savior. Their actions were stopped by church security officials. By evening, they had turned it into a music video entitled 'Punk Prayer - Mother of God, Chase Putin Away!'. The women said their protest was directed at the Orthodox Church leader's support for Putin during his election campaign. \n\nOn 3 March, two of the group members, Nadezhda Tolokonnikova and Maria Alyokhina, were arrested and charged with hooliganism. A third member, Yekaterina Samutsevich, was arrested on 16 March. Denied bail, they were held in custody until their trial began in late July. \n\nOn 17 August, the three members were convicted of hooliganism motivated by religious hatred, and each was sentenced to two years imprisonment. Two other members of the group, who escaped arrest after February's protest, reportedly left Russia fearing prosecution. \n\nOn 10 October, following an appeal, Samutsevich was freed on probation, her sentence suspended. The sentences of the other two women were upheld. In late October, Alyokhina and Tolokonnikova were separated and sent to prison. \n\nThe trial and sentence attracted considerable criticism, particularly in the West. The case was adopted by human rights groups including Amnesty International, which designated the women prisoners of conscience, and by a wide range of musicians including Madonna, Sting and Yoko Ono. Public opinion in Russia was generally less sympathetic towards the women. Putin stated that the band had 'undermined the moral foundations' of the nation and 'got what they asked for'. \n\nPrime Minister Dmitry Medvedev said he did not think the three members of Pussy Riot should have been sent to jail, but stressed that the release of the remaining two imprisoned members was a matter for the courts. ","torrent":{"xt":"urn:btih:fbc30967c08ea7da9d1f7b1813bc2f36faa94510","amp;dn":"Pussy+Riot+-+A+Punk+Prayer+-+Documentary.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbc30967c08ea7da9d1f7b1813bc2f36faa94510","infoHashBuffer":{"type":"Buffer","data":[251,195,9,103,192,142,167,218,157,31,123,24,19,188,47,54,250,169,69,16]},"announce":[],"urlList":[]}}