{"title":"B.B.Blunder - Workers' Playtime 1971 (TQMP)","uid":8667731,"size":358812810,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fc10f502ccabc8a3d464f5bbbaa032f956d784bc&amp;dn=B.B.Blunder+-+Workers%27+Playtime+1971+%28TQMP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":12,"time":1373434894,"description":"B.B. Blunder-Workers Playtime \n(Blossom Toes)\n\n\nAudio CD (October 13, 2009)\nOriginal Release Date: 1970\nLabel: Sunbeam Records\n\n \n1. Sticky Living\n2. You're So Young\n3. Lost Horizons\n4. Research\n5. Rocky Yagbag\n6. Seed\n7. Put Your Money Where Your Mouth Is\n8. Rise\n9. Moondance\n10. New Day \n\nBonus\n11.Freedom \n12.Backstreet\n\nThe missing third Blossom Toes album October 25, 2009\nBy Kevin D. Rathert\nFor fans of the British pop psych band Blossom Toes Sunbeam Records, UK, has at long last unleashed the band that the bTs morphed into following a tragic auto accident and the departure of guitarist Jim Cregan. In the wake of the accident, guitarist/vocalist/songwriter Brian Godding, along with bassist Brian Belshaw, and sometime BT drummer, the late Kevin Westlake, recorded a progressive/psych lp under the moniker BB Blunder. The band name referring to the blunder of the Brians, Godding and Belshaw. Upon listening to &quot;Worker's Playtime&quot;, however, the listener will wonder why this band would ever refer to itself as a blunder. As is always the case Sunbeam Records have gone the extra mile and have added a bonus disc of previously unreleased music to the album proper. The proper album shows the development of the band from the heavy psych sound of &quot;If Only For A Moment&quot; into a more progressive sounding band. But don't mistake this album as lightweight, it is filled with wonderful guitar work by Godding and includes guest help from vocalist Julie Driscoll on 5 of the albums 10 cuts, as well as Mick Taylor's bass and Brian Auger's piano on &quot;New Day&quot; a song which was intended for release as the a side of a single by the Blossom Toes, and can be found in demo version on the BT's &quot;What On Earth&quot; cd as well as in finished form on the bonus disc of the BTs final album, &quot;If Only For A Moment.&quot; &quot;Worker's Playtime&quot; is filled with music that is both more introspective and exploratory than any of the Blossom Toes releases. Nine of the ten tracks on the lp proper were written or cowritten by Godding, but this is by no means a solo album. Highlights include the band penned &quot;Research&quot; an instrumental with a space rock feel. The lps second side is filled by masterworks, &quot;Seed,&quot; &quot;Put Your Money Where Your Mouth Is&quot; and &quot;Rise&quot; all of which have such full sound, thanks to Godding's guitar, that its hard to believe this is a three piece band. Its no surprise that Mick Taylor is present on &quot;New Day&quot; as Godding's guitar is reminiscent of the Stones' at the height of the Taylor years, Godding's slide work being simply luscious. The bonus disc is a real treat for the listener as the band is found experimenting with all sorts of sounds, from country to space rock. The tracks on the bonus disc tend to run longer, giving Godding a chance to stretch out on guitar. One wonders why these tracks were not included on the original album, but thanks to Sunbeam they do, at long last, see light of day. The bonus disc shows the band's versatility and contain 54 minutes of music which to my ear is superior to the original album. So Blossom Toe fans and fans of progressive rock in general, make sure you pick up this wonderful double disc set. If not, you won't know what you're missing and just what BB Blunder was capable of. Brian Godding's guitar work alone makes the set worth its price and then some. As with &quot;What On Earth&quot; pick this set up lest you regret not having it in your collection.","torrent":{"xt":"urn:btih:fc10f502ccabc8a3d464f5bbbaa032f956d784bc","amp;dn":"B.B.Blunder+-+Workers%27+Playtime+1971+%28TQMP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc10f502ccabc8a3d464f5bbbaa032f956d784bc","infoHashBuffer":{"type":"Buffer","data":[252,16,245,2,204,171,200,163,212,100,245,187,186,160,50,249,86,215,132,188]},"announce":[],"urlList":[]}}