{"title":"Coast to Coast AM January 29 2013","uid":8084050,"size":56908124,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fcba2e606844eb9c980bb2c08f20e7c468f5795d&amp;dn=Coast+to+Coast+AM+January+29+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1359581884,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-29-13\nHost: \tGeorge Noory\nGuests: \tGlynis McCants, Richard Heinberg\n\nNumerologist Glynis McCants, an expert in how patterns of events unfold according to the energy signature of specific numbers, appeared in the first half. She revealed what the &quot;6&quot; energy of the year 2013 holds for us, and how this year will be a stark contrast to 2012, a &quot;5&quot; year that proved chaotic and hard to keep focus. &quot;6&quot; has a strong magnetic vibration that is about family and unity, and she believes a lot of people will make commitments this year, whether in starting marriages, having children, or invigorating a business effort. She noted that with the new year, each person enters a new Personal Year Cycle. That number is determined by taking the month and day you were born and adding it to the world year. For example: You were born on 6/4 =6+4=10+1+0=1. You then take the World Number 6 (2013 = 2+0+1+3=6) add it to the 1, and reduce it to one digit. 6+1=7.\n\nAs opposed to last year when President Obama was in for the fight of his life, he is now in a cycle of &quot;9,&quot; she continued, which means clearing your space for a new beginning. Whether this means he will try to successfully work across partisan lines remains to be seen, she said. McCants provided us with a brief description of each Personal Year Cycle:\n\n    Personal Year Cycle of 1: A year to take control of your life, and do what you really want!\n    Cycle of 2: A year to work on your love relationships and get in touch with your true feelings.\n    Cycle of 3: A year to communicate, and really find ways to laugh and enjoy yourself.\n    Cycle of 4: A year to study something you have always been interested in, and increase your knowledge base.\n    Cycle of 5: A year to embrace freedom, and travel if possible. It is also a year to take care of your personal needs.\n    Cycle of 6: A year to look at your family and home. It is also a good year for signing contracts.\n    Cycle of 7: A year to get in touch with your inner voice, and get to a point where you can sincerely surrender and say, &quot;Let go and let God.&quot;\n    Cycle of 8: A year to work on the financial side of your life, and improve your physical health.\n    Cycle of 9: A year to clear remove all the clutter, and heal any unresolved emotional scars from your past. It is all about learning to be in the moment.\n\nEnergy Issues\n\nIn the latter half, Peak Oil educator and fossil fuel critic, Richard Heinberg, discussed the various ways we are selling out our future by tying ourselves to energy sources that cannot be sustained. He spoke of a &quot;resource pyramid&quot; with the material at the top the easiest to get at but less plentiful than what is at the bottom, which is harder to get to, and more expensive to extract. &quot;As time goes on we're moving down that resource pyramid to ever lower layers,&quot; he commented. This is one of the reasons that oil is costing more, and why we're seeing more accidents and oil spills, because we're having to go after more extreme energy sources, he explained. &quot;At some point in this century, we'll get to a stage where it costs more energy to produce oil than oil will give you when you take it out of the ground,&quot; he warned.\n\nHe was critical of the alternative fuel ethanol for that reason-- we invest so much energy in growing the crops, taking them to the plants, and cooking the mash etc., that it isn't cost efficient. He also addressed the topic of fracking, a set of technologies involving horizontal drilling and millions of gallons of water and chemicals to open up fractures in rocks so gas and oil will flow through. This technology poses environmental concerns, as there is the possibility that chemicals could end up in the water table, he noted. We're getting to a point where depletion of various resources like oil, coal, and gas is a real issue, and conservation rather than growth should be a focus, he argued. Yet within this century, he foresees the invention of new technologies, and energy sources, that will bring us into a post-carbon world, which will create tremendous opportunities for change.\n\nNews segment guests: Mitch Battros, Mish Shedlock\nWebsite(s):\n\n    numberslady.com\n    richardheinberg.com\n    postcarbon.org\n\nBook(s):\n\n    Glynis Has Your Number\n    Love by the Numbers\n    Energy: Overdevelopment and the Delusion of Endless Growth\n    The End of Growth: Adapting to Our New Economic Reality\n\n","torrent":{"xt":"urn:btih:fcba2e606844eb9c980bb2c08f20e7c468f5795d","amp;dn":"Coast+to+Coast+AM+January+29+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcba2e606844eb9c980bb2c08f20e7c468f5795d","infoHashBuffer":{"type":"Buffer","data":[252,186,46,96,104,68,235,156,152,11,178,192,143,32,231,196,104,245,121,93]},"announce":[],"urlList":[]}}