{"title":"The Pleasure of Finding Things Out","uid":8009560,"size":130038192,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fd51cea5b1052b371ca53736ae707f3612586c03&amp;dn=The+Pleasure+of+Finding+Things+Out&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SciBooks","files":176,"time":1357966649,"description":" &lt;a href=&quot;http://www.amazon.com/Pleasure-Finding-Things-Out-Richard/dp/0465023959/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1357962940&amp;sr=1-1&amp;keywords=the+pleasure+of+finding+things+out&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.amazon.com/Pleasure-Finding-Things-Out-Richard/dp/0465023959/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1357962940&amp;sr=1-1&amp;keywords=the+pleasure+of+finding+things+out&lt;/a&gt;\n\nWhy do we do science? Beyond altruistic and self-aggrandizing motivations, many of our best scientists work long hours seeking the electric thrill that comes only from learning something that nobody knew before. The Pleasure of Finding Things Out, a collection of previously unpublished or difficult-to-find short works by maverick physicist Richard Feynman, takes its title from his own answer. From TV interview transcripts to his acceptance speech for the Nobel Prize, we see his quick, sharp wit, his devotion to his work, and his unwillingness to bow to social pressure or convention. It's no wonder he was only grudgingly admired by the establishment during his lifetime--read his &quot;Minority Report to the Space Shuttle Challenger Inquiry&quot; to see him blowing off political considerations as impediments to finding the truth.\n\nFeynman had a fantastic sense of humor, and his memoirs of his Manhattan Project days roil with fun despite his later misgivings about nuclear weapons. Though one or two pieces are a bit hard to follow for the nontechnical reader, for the most part the book is easygoing and engaging on a personal rather than a scientific level. Freeman Dyson's foreword and editor Jeffrey Robbins's introductions to each essay set the stage well and are respectful without being worshipful. Though Feynman has been gone now for many years, his work lives on in quantum physics, computer design, and nanotechnology; like any great scientist, he asked more questions than he answered, to give future generations the pleasure of finding things out. --Rob Lightner --This text refers to an out of print or unavailable edition of this title. ","torrent":{"xt":"urn:btih:fd51cea5b1052b371ca53736ae707f3612586c03","amp;dn":"The+Pleasure+of+Finding+Things+Out","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd51cea5b1052b371ca53736ae707f3612586c03","infoHashBuffer":{"type":"Buffer","data":[253,81,206,165,177,5,43,55,28,165,55,54,174,112,127,54,18,88,108,3]},"announce":[],"urlList":[]}}