{"title":"My Morning Jacket - 2005 - Z  [EAC - FLAC]","uid":4637266,"size":308841213,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fd66c86403928f32942989872ec45fd2d92517eb&amp;dn=My+Morning+Jacket+-+2005+-+Z++%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bludStain","files":-1,"time":1231598101,"description":"Review    by Johnny Loftus\n\nIn 2004, a dreamy cover of &quot;Rocket Man&quot; concluded My Morning Jacket's first volume of rarities. Which was prescient, because it's Elton John that Jim James' songs for 2005's Z first bring to mind. From the wistful recollection of &quot;Goodbye Yellow Brick Road&quot; to Honky Chateau's melodic and genre explorations, John's ability to mesh styles and take detours within his sturdy pop songwriting applies to James here, particularly in the expansive opener, &quot;Wordless Chorus,&quot; or the initial happy-go-lucky lilt of &quot;Off the Record.&quot; Z is My Morning Jacket's fourth full-length (and second for ATO), and it's the one that might finally jump-start the reaction that James' music has always deserved. It Still Moves from 2003 rightly enjoyed its accolades, but it meandered a little structurally, too, and sometimes got a little lost in its own reverb. On Z, MMJ's traditional influences are present ÃƒÂ¹ the folk, blues, and country tones of John, Neil Young, and the Band shaded by contemporaries like Mercury Rev and Mark Kozelek. But songs like &quot;Lay Low&quot; and &quot;It Beats for You&quot; are crafted tighter, their sound-drenched keyboard lines meeting the percussion head on and riding meaningful flourishes of electric guitar. &quot;Gideon&quot; climaxes in James calling out throatily over twinkling piano and big chords borrowed from the Who, and &quot;What a Wonderful Man&quot; is a raucous, crashing tumble of unhinged crash cymbals, barroom piano, and mirthful yelping. Z is intuitive, intensely creative, classicist-minded, nearly flawless. It's music that's extruded from Jim James' id, and that's bearded, too.\n\nTracks\n01    Wordless Chorus     James     4:12\n02    It Beats 4 U     James     3:46\n03    Gideon     James     3:39\n04    What a Wonderful Man     James     2:25\n05    Off the Record     Hallahan, James ...     5:33\n06    Into the Woods     James     5:21\n07    Anytime     James     3:56\n08    Lay Low     James     6:05\n09    Knot Comes Loose     James     4:02\n10    Dondante     James     10:33","torrent":{"xt":"urn:btih:fd66c86403928f32942989872ec45fd2d92517eb","amp;dn":"My+Morning+Jacket+-+2005+-+Z++%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd66c86403928f32942989872ec45fd2d92517eb","infoHashBuffer":{"type":"Buffer","data":[253,102,200,100,3,146,143,50,148,41,137,135,46,196,95,210,217,37,23,235]},"announce":[],"urlList":[]}}