{"title":"Vegas Poker Challenge Pro v3.204 [PD]","uid":8852307,"size":43356503,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:fda13dd71efb438628624320dd2388c1b503b177&amp;dn=Vegas+Poker+Challenge+Pro+v3.204+%5BPD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1377563720,"description":"\nYou're in Vegas and your task is to defeat as many players and earn as much money and fame as possible! Progress your character through increasingly luxurious Five Card Draw, Texas Holdem and Blackjack venues. \n\nItems you discover along the way will help you and add variations to the game (altering game rules like turning No-limit Holdem to Pineapple, Limit-Crazy Pineapple, etc). This is essentially a poker game at it's core with RPG elements.\n\nGame Features include:\n\n* 17 different Five Card Draw poker venues and \n* 12 Texas Holdem venues that increase in difficulty and rewards\n* 3 venues that offer Blackjack and Double Blackjack\n* 180+ unique characters with individual AI, playstyles, stats and special moves \n\n(Note: A few characters appear dependent on what gender you play as and time of year)\n\n* Win consumable items after every game. Consume these items for a temporary bonus in your next game(s). These bonuses stack so you can either use them immediately for a small bonus, or stockpile the items and use them all later for larger bonuses.\n* Regular Items drop off specific opponents after you defeat them. You can equip or consume these items for a special effect or sell them for cash. Unlike consumables, these regular items have different effects while equipped (examples are the Insurance Card which rewards you with 10% of your buy-in back if you lose a game, and the Hunter's Cap which ensures that opponents with a bounty will always show up).\n* Earn luxury items that you can equip to change the game up. Examples of this are a monocle that turns all Texas Holdem venues from No-Limit to Limit, a Golden-Deck that gives you gold cards and allows you to choose how many decks to play with in Five Card Draw, and more!\n* Meld items from different games together, for example the Gold Ring (which awards 50% more fame in Five Card Draw games) and the Platinum Ring (awarding 50% more fame in Texas Holdem) can be melded together to produce the Stardust Ring (awarding 100% more fame in both games).\n* Loanshark offering loans (but make sure to pay your debts on time!) and luxury items.\n* Generate fame by defeating players (lose fame by being defeated, dependent on what order you go out)\n* Climb the dynamic player-ranking ladder by winning cash\n* Collect on bounties and defeat specific players for additional fame\n* Stats give you insight to your play-style along with where you've been and what you've accomplished\n* Retire with an ending tailored to your specific accomplishments in-game! Complete with high-scores list\n* Earn titles for your character based on your performance in-game, and upload your character's data to the website to see where you stand\n* Game goes on forever... and I am continually building new content. The game started as just Five Card Draw and overtime I added more venues, blackjack venues, texas holdem venues, items, etc.\nYou can leave a poker game and return at any time, in addition you may have up to 3 different careers saved at a time.\n\nWhat's New:\n\nNOTE: Please finish any games-in-progress before patching.\n3.204 - Autosave option added - disabled by default. Gold Rush rule change - deck now is only 2-10 and Aces, no face cards. A few other minor fixes.\n3.2\nTwo new venues to mid-strip\nNew Music\nRankings screen revamped, shows all opponents stats\nNew server - if you used the old website your old account will no longer work, please create a new account.\nFull patch notes on website\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.sundown.fivecarddraw&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.sundown.fivecarddraw&lt;/a&gt;\n","torrent":{"xt":"urn:btih:fda13dd71efb438628624320dd2388c1b503b177","amp;dn":"Vegas+Poker+Challenge+Pro+v3.204+%5BPD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fda13dd71efb438628624320dd2388c1b503b177","infoHashBuffer":{"type":"Buffer","data":[253,161,61,215,30,251,67,134,40,98,67,32,221,35,136,193,181,3,177,119]},"announce":[],"urlList":[]}}