{"title":"(Magic) Gregory Wilson Card Stunts (Full DVD)","uid":6052185,"size":4346708014,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:feb867e926e8c8314769aa65e0fb00a3816c903c&amp;dn=%28Magic%29+Gregory+Wilson+Card+Stunts+%28Full+DVD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RyleyMapl","files":12,"time":1292777865,"description":"Card Stunts is a must have DVD for card workers. It's one of the Top 5 Card Magic DVDs of ALL TIME. And it's the best example of a full act with cards ever put on tape.&quot; -- Maxwell Murphy, Penguin Magic \n\n&quot;[Gregory Wilson] is probably one of the top 3 or 4 magical &quot;entertainers&quot; in the world...he's not just another finger flinger...and this performance at the Magic Castle shows just how much his audiences love him. Study the magic, but more importantly, study his PERFORMANCE. -- Patrick Drake, Canadian Association of Magicians, 2005 Close-up Champion\n\nThe Effect\nCard Stunts is Gregory Wilson's complete Close-up card act performed live from the Magic Castle. You'll learn how to do it all! The explanations are thorough, and the material is some of the best in the world. If you perform with a deck of cards, this is a must-have DVD.\nHEAVYWEIGHT BOXING - The card box magically and mysteriously jumps out of your pocket and back around the deck - TWICE!\nPHOENIX SPLIT - Four aces magically appear at your fingertips one at a time -- with your sleeves rolled up!\nRESET WITH A HOOK - A jacked-up, nitro-burning demonstration of derring-do that masterfully motivates why the four aces change place with the jacks. BOOMERANG CARD OF DEATH A playing card shoots from the middle of the deck, high into the air, reverses direction mid-flight and plunges back into the deck -- between two selected cards -- with only one hand!\nBOXSPRING - One at a time, the four aces sneak our of a completely closed and ungimmicked card case.\nJOKE IN THE BOX - Finally, 'Card Under Glass' without getting your cards wet. The bone dry (signed if you like) oker jumps from the deck and under the card box -- twice. Then, for the surprise finish, instead of under, it goes. . . inside the box! Gentlemen, start your Sharpies!\nG FORCE - An unsuspecting spectator selects the same card three times in a row. You top things off with a transposition that leaves them in vertigo!\nREVELATION IN SPADES - Find thirteen cards in a row - in perfect order!","torrent":{"xt":"urn:btih:feb867e926e8c8314769aa65e0fb00a3816c903c","amp;dn":"%28Magic%29+Gregory+Wilson+Card+Stunts+%28Full+DVD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"feb867e926e8c8314769aa65e0fb00a3816c903c","infoHashBuffer":{"type":"Buffer","data":[254,184,103,233,38,232,200,49,71,105,170,101,224,251,0,163,129,108,144,60]},"announce":[],"urlList":[]}}